["Benefits of Premium Residency\nSaudi Premium Residency comes with many benefits, such as;\n- Premium residency to spouse and all children under 25.\n- Conduct business in Saudi Arabia.\n- There is no dependent fee for family members.\n- Travel without an exit reentry visa .\n- Own Real Estate in your name in Saudi Arabia.\n- Iqama transfer without any transfer fee.\n- Hosting and inviting relatives.\n\nEntrepreneur Residency\n2 types of people can get Saudi Premium Residency under the entrepreneur residency category.\n\nFirst Category\n- Obtain a minimum of SAR 400,000 round as investment from an entity accredited by the center.\n- The applicant’s share in the start-up must be at least 20%.\n\nGifted Residency\n2 types of people can get Saudi Premium Residency under the Gifted Residency category.\n- Nomination or Receiving one of the specified exceptional awards approved by the Ministry of Culture and Ministry of Sports.\n- Fulfilling the minimum eligibility criteria approved by the Ministry of Culture and Ministry of Sports.\n- Apply for it here .\n\nIntroduction\nSaudi Arabia has launched 7 types of Premium Residencies for different categories of foreigners to stay permanently in the Kingdom.\n\nInvestor Residency\nIf you are a businessman who has already invested or planning to invest SR 7 million in a business, you can apply for Saudi Premium Residency under the Investor residency category. The requirements are;\n- Get an investment license.\n- Commercial Regitration .\n- SR 7 million minimum investment.\n- Creating 10 jobs in the business.\n- Apply here .\n\nLimited duration residency\nThe limited-duration premium residency is available against an annual fee of SR 100,000/-.\n- Apply it here .\n\nReal Estate Owner Residency\nForeigners are eligible to get the Saudi Premium Residency if they invest in real estate as per the following terms;\n- Minimum Investment: SR 4 million.\n- Property must be free from mortgage.\n- The property cannot be mortgaged even in the future.\n- The property is purchased without any financing.\n- The real estate must be residential.\n- The real estate must be fully developed. It is not allowed to buy a piece of plot and develop it to get the Residency.\n- The property valuation must be approved by an evaluator registered with Taqeem .\n- Apply here .\n\nSecond Category\n- Obtain a minimum of SR 15 million round/s as investment from an entity accredited by the center.\n- The applicant’s share in the start-up must be at least 10%.\n- Apply here .\n\nSpecial Talent Residency\n3 types of people can get Saudi Premium Residency under the Special Talent category.\n- Iqama holders with a minimum salary of SR 80,000/month.\n- Professionals in healthcare and sciences with a minimum salary of SR 35,000/month.\n- Researchers who have a minimum wage of SR 14,000/month.\n- Apply here .\n\nUnlimited duration residency\nThe unlimited-duration Saudi premium residency is available against a one-time fee of SR 800,000/-.", "Benefits of Saudi Premium Residency\nSaudi Premium Residency comes with many benefits, such as;\n- Premium residency to spouse and all children under 25.\n- Conduct business in Saudi Arabia.\n- There is no dependent fee for family members.\n- Travel without an exit reentry visa .\n- Own Real Estate in your name in Saudi Arabia.\n- Iqama transfer without any transfer fee.\n- Hosting and inviting relatives.\n\nIntroduction\nSaudi Arabia has launched a premium residency program for foreigners against an investment of SR 4 million in real estate.\n- 7 types of Saudi Premium Residencies.\nIf you do not have SR 4 million to invest, you can still buy one residential property in Saudi Arabia as an expat.\n\nRequirements\nThe following are the requirements to apply for the Saudi Premium Residency by investing in real estate.\n- Valid Passport.\n- Medical test .\n- Valid Iqama (for Iqama holders).\n- Investment of SR 4 million.\n- Fee: SR 4,000.\n\nSaudi Premium Residency with Real Estate Investment\nForeigners are eligible to get the Saudi Premium Residency if they invest in real estate as per the following terms;\n- Minimum Investment: SR 4 million.\n- Property must be free from mortgage.\n- The property cannot be mortgaged even in the future.\n- The property is purchased without any financing.\n- The real estate must be residential.\n- The real estate must be fully developed. It is not allowed to buy a piece of plot and develop it to get the Saudi Premium Residency.\n- The property valuation must be approved by an evaluator registered with Taqeem .\n\nValidity\nThe Saudi Premium Residency obtained by investment in real estate will remain valid until the property remains under your ownership.\n- Apply for premium residency from this link .", "Introduction\nAfter submitting your resignation to your employer, you should always resign and terminate the contract in Qiwa as well.\n\nPost Termination Process\nAs soon as you complete the contract termination process in Qiwa, your employer will be notified.\n- Your contract will be terminated after the notice period is over.\n- If you requested a shorter notice period, wait for your employer’s approval. Once approved, your contract will end on the agreed-upon date.\n- During the probation period, your contract will be terminated immediately.\n\nResignation Reasons\nWhile termination the contract in Qiwa, you can select one of the following reasons.\nResignation : You must comply with the rules for the notice period in Saudi Arabia. Remember that the employer can apply Article 77 of Saudi Labor Law .\nDuring Probation : There is no need for a notice period if you resign during probation period .\nBy Mutual Agreement : If you select this option, the contract will be terminated only if the employer approves it. Once the termination is approved, the employer cannot apply Article 77 of Saudi Labor Law .\nTermination upon Expiry : Your last working day will be the day of the expiry of your contract.\nRetirement Age : You can resign at your retirement age in Saudi Arabia .\nArticle 77 : If you select this option, you must pay the employer until the end of the contract.\nIndividual establishment to a new owner : If your employer is moving from an individual establishment (Moassasa) to a company, you may decide to resign with immediate effect.\nDeath of the employer: You may decide not to continue with the employer after his death if it was an individual establishment.\nArticle 81 Resignation : There are 7 conditions under which you can resign under Article 81 of the Saudi Labor Law without any notice.\n\nTerminate the contract in Qiwa\nTo resign in Qiwa, you need to;\n- Register yourself with the Qiwa platform.\n- Log in to your Qiwa Individual account: https://sso.qiwa.sa/sign-in\n- Click on the “ Individual Account “.\n- Click on the 3 bars for options.\n- Select the “ Services ” tab.\n- Click on “ Manage Contracts. ”\n- Click on “ Employment Contract “.\n- Find the desired contract and click on ‘ Terminate contract ’.\n- Choose the reason for termination (explained below).\nRemember that you must comply with the rules for the notice period in Saudi Arabia while selecting the last working day. You can also request the employer to reduce the notice period through Qiwa at this stage.\n- Review the details and select ‘ Send termination request .’\n\nWhy to resign in Qiwa?\nIt is better to terminate your contract in Qiwa after the official resignation;\n- The employer cannot play around.\n- The notice period starts in the eyes of the government.\n- Qiwa Employee Transfer becomes obligatory on the employer.\n- You have a better standing in a legal case.", "Al Rajhi Bank\nIn order to pay the fee to issue the Iqama of a child born outside Saudi Arabia through Al Rajhi Bank;\n- Download the Application through PlayStore or iTunes .\n- Log in to your Internet banking account.\n- Select “ Payments “.\n- Press the “ Government Payment ” button.\n- Click on the “ Alien Control “.\n- Select Dependent Entry Visa Fee Collection .\nOn the next page do the following;\n- Enter the Iqama number of the father.\n- Number of Dependents: Number of Children born outside KSA.\n- Click on the “ confirm ” button to make the payment.\n\nAvailable funds on Iqama\n- Once the fee is paid, you can check the available funds on Absher .\n- After the funds start appearing on Absher, you can apply for the Iqama of the newborn .\n\nIntroduction\nIf your baby is born outside Saudi Arabia, you need to pay two types of fees to issue a new Iqama.\n- SR 2,000 fee as explained below.\n- Dependent fee for a new Iqama .\n\nSNB Bank\nIn order to pay the fee to issue the Iqama of a child born outside Saudi Arabia through SNB or Al Ahli Bank;\n- Download the Application through PlayStore or iTunes.\n- Log in to your Internet banking account.\n- Click on the “ Menu ” button.\n- Select “ SADAD “.\n- Click on “ Government Payments “.\n- Biller: Alien Control .\n- Service: Dependent Entry Visa Fee Collection .\n- Select Unregistered .\n- Enter the Iqama number of the father.\n- Number of Dependents: Number of Children born outside KSA.\nOn the next page, the SNB system will show you SR 2,000 to be paid for the issuance of the Iqama of a child born outside Saudi Arabia, click on the confirm button.", "Customer Service Professions\n100% Saudization in the customer service profession from  Dec. 17, 2022, would create 4,000 jobs for Saudis.\n- 221024 Tourist Information Clerk.\n- 422201 Call Center Clerk.\n- 422202 Customer Service Center Inquiries Clerk.\n- 422501 Query Clerk.\n- 422902 Customer Data Clerk.\n- 422302 ATV splitter operator.\n- List of Professions reserved for Saudis\n\nIntroduction\nSaudi Arabia has introduced 50% to 100% Saudization in 44 Iqama professions which would create 33,000 jobs for Saudis.\n\nLicensed aviation professions\n50% to 100% Saudization in the following licensed aviation professions starting from March 15, 2023, would create 4,000 jobs for Saudis.\n- 100% Saudization in Copilot – 315305.\n- 100% in Air controller – 315301.\n- 100% in Dispatcher – 315402.\n- 100% in Meteorologist – 315401.\n- 70% in Aviation Transport Pilot – 315304.\n- 60% localization in Air Host – 511101 .\n\nOptics Professions\n50% Saudization in the following optics professions from March 18, 2023, would create 1,000 jobs for Saudis.\n- Medical optics technician – 325401.\n- Physics laboratory technician – 3112042.\n- Optics technician – 325403 .\n- Minimum Salary for Saudis: SR 5,500.\n\nParcel Delivery Services\n100% Saudization in 14 activities for parcel delivery services outlets such as Aramex would create 7,000 jobs for Saudis.\n- 100% localization in the CEO jobs.\n- Providing delivery services via electronic platforms.\n- Parcel transportation (domestic and international).\n- Parcel transportation (domestic).\n- courier activities\n- Mail and parcel baggage activities\n- Activities of receiving, delivering, and transporting postal items and parcels\n- Providing postal room management services\n- Provision of processing, storage, and redistribution of postal items and parcels\n- Provide postal logistics\n- Activities of private mail carriers\n- Transaction Delivery Postal Service Activities\n- Postal mail activities\n- EMS activities\n- Other Postal Activities.\n70% Saudization in the sales outlets of the following 7 businesses;\n- Security and safety equipment.\n- Elevators, escalators, and conveyors.\n- Artificial grass and swimming pools.\n- Water purification and navigation equipment.\n- Catering devices and electric trucks.\n- Shooting weapons, airsoft guns, and picnic supplies.\n- Packaging equipment and tools.\n\nVehicle Regular Technical Inspection Outlets\n50% to 100% Saudization in 11 professions at vehicle regular technical inspection outlets in two phases which will create 5,000 jobs for Saudis.\n- 50% localization from 12 June 2023.\n- 100% localization from 31 May 2024.\n- Site manager.\n- Assistant manager.\n- Quality manager.\n- Financial supervisor.\n- Site supervisor.\n- Lane leader.\n- Inspection technician.\n- Assistant inspection technician.\n- Maintenance technician.\n- Information technician.\n- Data entry specialist.", "Current Practice\nCurrently, if the Maktab Amal fee or the Iqama Renewal fee for an employee is not paid by the old employer for some time, the new employer or the employee himself pays for it at the time of Iqama transfer.\n\nIntroduction\nHRSD Ministry has announced that the new employer is no longer required to pay the Iqama fee and Maktab Amal fee arrears of employees at the time of Iqama transfer.\n- How to transfer employees through Qiwa?\n\nNew Practice\nAs per the amendment, the Iqama fee, Maktab Amal Fee, and penalties for delaying the Iqama renewal are now the liability of the previous employer.\nThe Qiwa platform of the HRSD ministry thereby is implementing the new laws and thus charging the fee from the ex-employers of the workers.\nSource: Saudi Gazette", "Check Work Permit Expiry Date\nYou can check the work permit expiry date using your Qiwa account. To do it;\n- Register yourself with the Qiwa platform.\n- Log in to your Qiwa: https://sso.qiwa.sa/sign-in\n- Click on “ Individual Account “.\n- Click on the 3 lines in the upper right corner.\n- Select the “ My Information ” option.\nOn the next page;\n- Scroll down until you find the “ Employment Statuses ” option.\n- Click on “ Work Permit “.\n- You would be able to check the work permit issue and expiry date.\nUsually, the work permit expiration date coincides with the iqama expiration date . However, there could be exceptions to this rule.\n\nCheck Work Permit Status\nTo check the work permit status through MOL,\n- Open the Ministry of Labor website.\n- Enter your Border Number there.\nThe system will fetch the details, such as your name and the work permit number. The presence of the work permit number should assure you that your work permit is issued. The next step is issuing the Iqama.\n- How to check if Iqama number is issued?\nHowever, if the system shows the message “ لا يوجد عاملين بالمواصفات المسجلة “, it means that your work permit is not yet issued. In this case, you should chase your Kafeel.\nRemember that domestic workers cannot check their work permit status using this service.\n\nIntroduction\nAfter you enter Saudi Arabia, the employer must issue a work permit before issuing an Iqama. We have explained the process to check the work permit status and its expiry date below.", "Fingerprints from the police\nVisit the police station with the Jawazat letter.\n- Police will take your fingerprints.\n- Some people say that they send it to Interpool for verification.\n- After the verification, take the fingerprint report from the police station.\n\nGet the print of the Iqama\nBook Jawazat Appointment with the option Resident Services .\n- Take all the above requirements.\n- Submit it to Jawazat.\nIf all the details are correct, the Jawazat officer will change your nationality on Iqama and ask you to take a new print from another window.\n\nIntroduction\nYour nationality is written on the 9th line of Iqama. In case you have taken a second passport, you can always change your nationality on Iqama.\n\nLetter to the police\nBook Jawazat Appointment with the option Resident Services .\n- Explain the purpose of your visit.\n- Jawazat officer will issue a letter directed to the police requesting the fingerprint checkup.\n\nRequired Documents\nThe process of changing nationality in Iqama might take from 3 to 6 months. Jawazat needs the following documents to change it;\n- Fingerprints report from the police station.\n- New Passport.\n- Old Passport.\n- Original Iqama.\n- Jawazat Form (given below).\nNOC from the embassy is not required to change nationality on Iqama.\n\nWhy should you change it?\nIn Saudi Arabia, your nationality impacts your salary package. A person with a U.S/Canadian/British passport tends to get a way higher salary than someone on a Pakistani or Indian passport.\n- How your nationality impacts the salary in KSA?", "Change religion on Iqama\nThe sponsor will perform the following process to change the religion of Iqama.\n- GRO of the company is the sponsor of employees.\n- The family head is the sponsor of dependents.\nIf the religion is written by mistake or you have embraced Islam after entering Saudi Arabia, the sponsor will have to;\n- Book Jawazat Appointment with the option Resident Services .\n- Fill out the following form to change Iqama information. Point 9: تغيير الدين على الإقامة Point 10: غير زلك /غير مسلم Point 11: اسلام\n- Point 9: تغيير الدين على الإقامة\n- Point 10: غير زلك /غير مسلم\n- Point 11: اسلام\n- Reach out to the “ Ask me or Information help desk ” section. They will guide which section you need to go.\n- Reach out to the respective sections and identify the sub-section where the Family Iqama-related cases are handled.\n- Inform about the changes required, and the officer will do it after verifying the details.\n- Validate the changes in the Absher portal by downloading the digital Iqama .\n- How to change the name on Iqama?\n\nGet the print of the Iqama\nAfter submitting the form to Jawazat, the officer might ask you some questions if you have converted to Islam recently or may congratulate you.\nSoon he will ask you to get the print of the new Iqama from another window with the changed religion.\n- How to read 12 Iqama details?\n\nIntroduction\nThe 10th line of the Iqama is about the religion where it is written if you are a Muslim or a Non-Muslim. We have explained the process of changing the religion in Iqama.\n\nWhy should you change it?\nThe religion on your Iqama determines if you can enter the two holy cities of Saudi Arabia, i.e., Makkah and Madina. It is important to mention that Non-Muslims cannot enter these two holy cities.\n- Why Non-Muslims cannot enter Mecca and Madina?", "Get Cheap Health Insurance in KSA\nOnce you have all the above requirements and registered an account with Tameeni;\n\nIntroduction\nNormally, employers provide medical insurance to employees according to Article 144 of Saudi Labor Law. If they don’t, here is how you can get the cheapest health insurance in Saudi Arabia.\n- Note: Before you start the process, check if your employer can get you the insurance.\n\nRegister Tameeni Account\nIn order to get cheap medical insurance in Saudi Arabia, we will have to create a Tameeni account. In order to do that;\n- Click: https://health.tameeni.com/en\n- Click on the Menu bar given on the left hand.\n- Select “ Login ” from the options.\n- Click on “ Register here “.\n- Select “ Register using Tameeni Account “.\n- Enter your Mobile Number, Email, and Password.\n\nRequirements\nIn order to get cheap health insurance in Saudi Arabia, you need the following information;\n- Commercial Registration Number of the employer.\n- Sponsor ID .\n- Employer’s VAT Number.\n- Iqama Number.\n- Debit/Credit Card for the payment.\n- Policyholder’s Height in CM.\n- Policyholder’s Weight in KG.\n\nStep 1: Company Details\n- Click: https://health.tameeni.com/en\n- Enter the CR number of your employer.\n- Write the name of the employer.\n- Click on “ USE GRID “.\n\nStep 2: Personal Details\n- Member ID: Iqama Number .\n- Enter Sponsor ID .\n- Insurance Class: Select Basic if you want to get cheap insurance.\n- Basic insurance class would just get your Iqama renewed.\n\nStep 3: Additional Info\nNow at this step, you will have to provide some additional information to get the cheapest health insurance in Saudi Arabia;\n- Click on “ Confirm & Continue ” button.\n- Policy Effective Date: The date from which the insurance will start.\n- Entity Revenue: The annual sale of your employer.\n- Health Declaration: Answer a few questions. Normally the answer to all of them is “ No “.\n- Enter your Weight in Kg.\n- Enter Your Height in CM.\n\nStep 4: Select the best Qoute\nNow at this stage, you will compare different quotes by insurance companies and select the cheapest out of them. In order to do it;\n- Click on the “ Request Quotes Now “.\n- Sort by Price Ascending .\n- Select the cheapest Health Insurance.\n- Enter your employer’s VAT number.\n- Proceed with the payment.\nThat’s it, you have successfully got the cheapest health insurance in Saudi Arabia for Iqama renewal .", "Concerns Over Pilgrim Transport Safet y\nThe accident has raised serious questions about:\n- Safety standards for long-distance pilgrim buses\n- Driver fatigue during late-night travel\n- Emergency escape mechanisms in buses\n- Oversight of private operators arranging Umrah transport\nAs millions travel annually for Umrah and Hajj, the incident has renewed calls for strengthening pilgrim safety protocols.\nSource: Gulf News\n\nImpact on Communities Back Home\nMany of the pilgrims are believed to be from Telangana and Andhra Pradesh . Telangana Chief Minister A. Revanth Reddy has directed state officials to gather details from local communities, coordinate with the central government, and ensure support for the affected families.\nHyderabad MP Asaduddin Owaisi stated that the bus belonged to a Hyderabad-based pilgrim group and urged authorities to prioritize repatriation and immediate relief measures.\nFamilies in Hyderabad and surrounding areas remain in distress, repeatedly contacting travel operators and government helplines for updates.\n\nIndian Government’s Emergency Response\nThe tragedy has prompted immediate action from Indian authorities. The Indian Embassy in Riyadh and the Consulate in Jeddah have activated 24/7 emergency helplines and are coordinating with Saudi officials for identification, repatriation of remains, and assistance to survivors.\nExternal Affairs Minister S. Jaishankar expressed deep shock and conveyed condolences, confirming that India is working closely with Saudi authorities to support the victims’ families.\nThe Consulate in Jeddah has also issued a toll-free helpline (800 244 0003) to assist families awaiting information.\n\nScene of the Disaster\nRescue teams arriving at the site described horrific visuals: a burnt-out bus, charred remains, and only fragments of belongings scattered across the highway. The intense fire, fueled by the tanker’s diesel, left little chance for escape.\nAuthorities from Saudi Civil Defense and the Red Crescent swiftly began recovery operations, while the road was closed for several hours.\n\nTragic Collision on the Makkah–Medina Highway\nA devastating accident early Monday has left 42 Umrah pilgrims feared dead after their bus collided with a diesel tanker and caught fire on the Makkah–Medina highway near Muhras (also reported as Mufrihat), approximately 160 km from Medina.\nThe pilgrims were travelling from Makkah to Medina when the collision occurred at around 1:30 am IST , a time when most passengers were believed to be asleep. The impact triggered a massive fire that engulfed the bus, leaving it “completely gutted” and severely complicating identification of the bodies.\nInitial reports indicate that among the deceased may be 11 women and 10 children , though final confirmation awaits forensic identification. Only one person is believed to have survived , and their condition remains uncertain.", "Book in Advance for the Best Rates\nPlanning ahead can save you money. Abu Dhabi rental prices vary by season. In winter peak months, rates might be around AED 120–180/day, whereas in the summer off-season they can drop to ~AED 60–90/day. Booking your vehicle well in advance helps secure lower rates and guarantees availability.\nAlways compare offers from different companies. Big international brands often charge more than local firms, so shop around. Use online platforms or aggregators to find deals — discounts up to 70% are possible. For example, economy car rentals have been found for about AED 80/day even in high season when booked online. A bit of research can yield substantial savings.\n\nCar Rental vs Other Transportation: A Comparison\nFor perspective, here’s how renting a car stacks up against taxis and public transit for a weekend trip:\n\nCheck License Requirements and Documents\nVisitors from GCC countries (like Saudi Arabia) can use their home country driving license in the UAE. If your home license isn’t on the UAE’s approved list, carry an International Driving Permit (IDP). Also, the minimum age to rent a car is typically 21 years in the UAE, so ensure you meet that requirement.\nRental agencies will ask for your passport and tourist visa, along with your driving license (plus IDP if needed). You also must have a credit card in the driver’s name for the security deposit. Keeping these documents ready will speed up the car pickup process.\n\nInspect the Car and Read the Agreement\nInspect the vehicle before you drive off. Note any existing scratches or dents and have them recorded in the rental form (taking photos is wise). Check that lights, AC, wipers and other basics are working. Report any issues to the agent immediately to avoid charges later.\nRead through the rental contract to understand the terms. Look at the mileage limit (for example, ~200 km/day; extra kilometers cost extra), the fuel policy (usually full-to-full), and how toll fees are handled (each DARB toll gate is AED 4 and will be charged to you later). If anything is unclear, ask the staff to avoid any surprises later.\n\nIntroduction\nRenting a car in Abu Dhabi is an excellent way to get the most out of your weekend trip from Saudi Arabia to the UAE. A car rental Abu Dhabi experience offers the freedom and flexibility to explore the city and its surroundings at your own pace. Instead of relying on guided tours or waiting for taxis, you can create your own itinerary and drive directly to attractions like Yas Island, the Corniche, or desert landscapes. This article provides essential tips for car rentals in Abu Dhabi, covering everything from paperwork to road rules. By following this advice, you’ll be well-prepared for a smooth and enjoyable weekend journey.\n\nKnow the Local Driving Rules and Conditions\nUAE traffic rules are strict. Stay on the right side of the road and obey posted speed limits (cameras enforce them). There is zero tolerance for drunk driving. Also, everyone in the car must wear seat belts, and young children need appropriate car seats.\nBe prepared for local road conditions. Abu Dhabi’s roads are modern, but traffic can get heavy at rush hours. Most city parking is paid via the Mawaqif system (around AED 2–3 per hour), so use marked parking zones and pay at the meter or by app to avoid fines. Drive defensively: some drivers speed on highways, so stay alert, keep safe distances, and follow all traffic laws.\n\nMaking the Most of Your Trip\nRenting a car can truly enhance a weekend visit to Abu Dhabi if you plan properly. By following these five tips — carrying the right license and documents, booking early to secure a good deal, knowing your insurance and deposit terms, inspecting the vehicle and contract, and respecting local road rules — you’ll be well-equipped for a hassle-free experience. With your own car, you are free to explore the UAE capital on your schedule, from the city’s iconic sights to outlying attractions, without being tied to taxi schedules or tour groups. Just remember to drive responsibly and stay aware of the rules. With good preparation, a rental car gives you the freedom and convenience to make your trip truly memorable.\n\nUnderstand Insurance Coverage and Deposits\nBasic third-party insurance is included in UAE rentals, but that only covers damage to others’ property. Consider adding a Collision Damage Waiver or full coverage, since rental companies may charge for even minor scratches or dings.\nBe aware of the refundable security deposit. The company will place a hold of around AED 1,000–3,000 on your credit card and release it a few weeks after you return the car if no fines or damage are recorded. Make sure your card can handle this hold. Also budget for any additional fees (e.g. an extra driver fee or under-25 surcharge) so you’re not caught off guard.", "Introduction\nDespite not really being known as huge tech innovators, it’s becoming abundantly clear that, on a tech level at least, the kingdom’s focus is shifting. While investments and interest in the potential of the next tech frontier is growing, the move won’t be easy. There are many hurdles to overcome first.\nRight now, it seems that fields concerning AI, or Artificial Intelligence, is where the most potential lies. More specifically, Quantum AI is right at the top of the kingdom’s priorities. It’s easy to see why. This relatively new frontier is immensely promising. The first experts to crack it fully and bring it to the mainstream practically will undoubtedly be remembered by the history books.\n\nInvesting in the Quantum Advantage\nThis should probably go without saying, but innovating in tech is an extremely expensive endeavor. Saudi Arabia does have a large amount of resources to throw at the world’s most fascinating technological problems, and they’re choosing to invest strategically. Some of the top universities in the area have already created partnerships with a handful of the world’s largest quantum computing enterprises to tackle the challenges facing quantum AI head on.\nEarlier this year, news came out that Saudi Arabia’s government has been planning to invest around $40 billion in artificial intelligence. This is a big step in the right direction. The technology will need as much funding as possible to move to a stage where it might enter the mainstream.\nIf they get it right, the potential for quantum AI to change the game in areas like aerodynamics, healthcare, finance and even materials science is vast. As touched on previously, entire industries would benefit and the local economy would likely see massive amounts of positive growth.\n\nProgress will be slow\nIt’s not easy to develop groundbreaking, innovative technologies. Quantum computing still has a long way to go before everyone can start enjoying the potential benefits. There’s one major issue holding the tech back right now: Quantum computers are incredibly sensitive to even the most subtle environmental changes. Something as small as a stray radio wave has the potential to cause issues and force these powerful machines to output errors and mistakes.\nSolving these problems will require governments and universities to collaborate. Only with top minds will the technology advance at a reasonable pace. Putting the world’s brightest talent in the same room to find solutions together is just the first step. This is where Saudi Arabia will likely be focusing all their efforts at first.\n\nSaudi Arabia is on the right track\nThe move to invest in quantum AI is a smart one. Embracing the potential of this new frontier meant that the kingdom could help lead the charge towards mind-blowing progress. This will take lots of time, infrastructure and funding. The fact that Saudi Arabia is interested enough to invest in the potential means the kingdom has every chance of coming out on top.\n\nThe potential is impossible to ignore\nDespite the unfortunate fact that it might still take many years to perfect this new technology, the potential is simply too great to disregard. Quantum AI is already making significant waves in the global financial sector. Right now, it’s possible for people to see how promising the tech can be by downloading a modern AI trading app and using advanced, Quantum AI-powered tools to make better investment decisions.\nNaturally, the ability to use quantum AI to make better trades on stock exchanges is exciting. But it’s not the only reason why Saudi Arabia has set its sights on research and development. Here are a few of the most compelling contexts where advancements are sure to make a real difference one day:\n- Energy Sector: Using the speedy power of hyper-advanced Quantum AI, the kingdom could, someday soon, build simulations that would seriously optimize and refine energy production models and tools. This would assist with challenges surrounding oil and gas exploration.\n- Risk Management: At present, managing complicated and sensitive supply chains could do with some optimization. Quantum AI could assist here. How? By crunching vast datasets to evaluate potential disruptions faster. Using these insights, Saudi industries could detect issues earlier and develop powerful risk management systems.\n- Health: When Quantum AI leaves its initial development stages, it could be used to advance the field of medicine in a way that could benefit the whole of humanity. It would potentially be able to, with impressive precision, simulate incredibly detailed molecular interactions and help medical professionals develop life-saving treatments quickly.\n\nWhy Quantum AI?\nChoosing to place focus on Quantum AI is a smart move. The world has already seen the game changing effects of AI as it is presently. Artificial intelligence is now advanced enough to be integrated into platforms and applications like word processors and streaming apps, and the companies that brought the revolution about have profited greatly.\nOne of the main issues holding AI algorithms up is processing power. Even the most powerful traditional computers are simply not sophisticated enough to handle all the computational power AI systems need to run at their best. This is why Quantum AI is so promising. Once the challenges holding quantum computing have been smoothed out, there’s no telling what the future concerning AI will hold.\nWithout going into all the boring details, quantum computers don’t work exactly like traditional ones. Instead of using ones and zeros to solve problems and make calculations, these new computers use qubits instead. Now the science behind how this all works is very advanced. All everyday people need to know is that, through concepts like entanglement and superposition, quantum computers can solve problems faster. So much faster, in fact, that the same problems that would take regular computers decades to answer can now be solved in just days, or even hours.", "5 conditions to own a property\nThe following 5 conditions must be met for a foreigner or expat to buy a property in Saudi Arabia;\n- Iqama is valid.\n- Property information should be available with a copy of the official document.\n- He should not have any other property in his name in Saudi Arabia.\n- The property should not be in Makkah or Madina.\n- The expat will use the property only for residence purposes.\n\nApply for MOI approval\nForeigners can apply for purchasing a property in Saudi Arabia through their Absher account. To do that;\n- L ogin to Absher: https://absher.sa\n- Click on the “ My Services ” option.\n- Select “ General Services “.\n- Click on the “ Request Property Owning for Non-Saudis .”\nA new page will open with all the terms and conditions for foreigners to buy a property in Saudi Arabia.\n- Click on the “ Create Request “.\n- Enter property information.\n\nIntroduction\nSaudi Government has allowed Iqama holder expats/foreigners to buy one property in Saudi Arabia if the following conditions are met.\nIf you can invest up to SR 4 million in residential properties in Saudi Arabia, you can get a Saudi Premium Residency .\n\nProperty Linked to Waqf\nForeigners are not entitled to property rights if the property was linked to waqf and if the Supreme Council of Endowment has a supervisory role.\n\nProperty in Makkah and Madina\nGenerally, Non-Saudis are not allowed to buy any property in Makkah and Madina.\nHowever, expats living in Saudi Arabia can buy shares in real estate investment funds that own properties in Makkah and Madina. In this way, they can indirectly purchase real estate in Makkah and Madina. – Saudi Gazette\n\nRules for Inherited Property\nExpats can own a property or house in Saudi Arabia if inherited . Many expats own property in Saudi Arabia as it was allowed before.\nMoreover, there are Saudis whose children could not get Saudi nationality, so they are still treated as iqama holders.\n\nStep-by-Step Process\n- Search for the property.\n- Conduct Building Survey – Shaikh Al Aqar\n- Agree on the price.\n- Conduct a Title Search .\n- Obtain MOI permission (explained below)\n- Apply for and Obtain Mortgage & Pre Approval.\n- Prepare Documents & Ready Payment.\n- Register and First Visit To Notary Public Office (Ministry of Justice)\n- Transfer of Deeds & Final Visit To Notary Public Office (Ministry of Justice).\n- Receive The Title Deeds In Your Name.\n\nWhat if Iqama expires?\nYou must be thinking about what would happen if you buy a property in Saudi Arabia as an expat and then, for any reason, you cannot renew Iqama .\nThe Saudi government does not give you any right to extend your Iqama based on owning property in Saudi Arabia unless your portfolio is worth SR 4 million, entitling you to a Saudi Premium Residency .", "Family Visit Visa through Istiqdam\nIn some cases, you might have to apply for a family visit visa through Istiqdam. Here is how you need to proceed;\n\nIntroduction\nExpats with any Iqama profession can apply for a family visit visa and bring their family to KSA. In this article, we have explained the updated process to apply for a family visit visa in Saudi Arabia in 2024.\n\nPassport Details\nScroll down a little bit on the same page and enter the passport details of the applicant such as;\n- Passport Number.\n- Passport Type: Normal .\n- Passport Issue Date.\n- Passport Expiry Date.\n- Passport Issue Place: The country of the passport holder.\n\nPersonal Details\nOn the next page, you need to enter the personal details of the family visit visa applicant such as;\n- Name as per passport in ENGLISH ONLY .\n- Fill out the rest of the application in Arabic .\n- Enter Birth Date .\n- Enter Birth Place .\n- Select Gender .\n- Occupational Status: Unemployed .\n- Enter Mobile Number .\n- Select Religion.\n- Enter Relationship. Select Others if you want to apply for a family visit visa for someone else, such as a Brother or Sister.\nRecently, many family visit visa applications have been rejected with the message “ نأمل تعبئة طلب جديد مع تدوين المهنة بشكل دقيق في خانة ( المهنة)، أطيب تحياتنا .” which means that the profession selected is inaccurate.\nHowever, there is no profession of housewife, child, or retired in the list of professions provided above. We believe that this is a short glitch and soon the Saudi government will start to accept “Unemployed” profession.\n\nRequired Documents\n- Get the appointment from Istiqdam.\n- Download the family visit visa application form, fill it in Arabic, and get it attested by the Chamber of Commerce.\n- Introduction letter issued by the employer and stamped by the chamber of commerce.\n- Copy of marriage certificate if you are applying for in-laws.\n- Copy of Iqama and Passport.\n\nRequirements for the visa\nYou need the following documents to apply for the family visit visa;\n- Applicant’s passport.\n- Saudi visa of the Iqama holder person applying for the visa.\n- 3 months of Iqama validity.\n- No need to be physically present in KSA to apply.\n- Activate Nafath app.\nNow expatriates with any Iqama profession including labor and house drivers can also apply for a family visit visa.\n\nStep 01: Log in to Nafath\nIn order to fill out the application for a family visit visa;\n- Open this website https://visa.mofa.gov.sa/Account/\n- Click on the “ Login ” button.\n- Enter your Iqama Number .\n- Approve the Nafath access .\n\nStep 02: Fill out the application\nOn the next page, you will be given many options out of which you need to select;\n- Family Visit Visa Application for Residents .\nOn the first page of the Saudi family visit visa application, the system will fetch your details while you need to enter;\n- Saudi Visa Number is written on the work visa stamped on your passport when entering Saudi Arabia. In case you were born in KSA, you can leave the field blank.\n- Click on the “ Add ” button.\n\nStep 03: Submit the application\nIn the next step, you need to submit the application to your employer to sign and stamp it.\n- Private Employees: After this, the HR of your company will submit the application to the chamber of commerce of the same city mentioned in the address above.\n- Government Employees: The government employees will submit the application to the Ministry of Foreign Affairs.\n- Domestic Workers: The employer of the domestic workers will approve the visa through his Absher account. They don’t have to submit it anywhere.\n\nStep 04: Check Visit Visa Application Status\nNow keep on checking the family visit visa status from the MOFA website. As soon as the family visit visa is approved, send it to the country from where your family wants to enter KSA. https://visa.mofa.gov.sa/\nIn some cases, the MOFA requests some additional documents from the Iqama holder before approving the visa. If this is the case, you need to visit the Ministry of Foreign Affairs along with the required documents.\n\nStep 05: Submit the application to the Saudi Embassy\nYour family will contact an agent to submit the application to the Saudi Embassy or Saudi Consulate. In Pakistan, your family will have to book an appointment with Etimad.\nAt this point, you need to pay the fee for the family visit visa to your agent. Here is an approximate breakup of the fee;\n- Visa Fee: SR 300.\n- Insurance: SR 100.\n- Other Charges: SR 500.\n- Total Fee: SR 800 approx.\nMake sure the application is submitted to the Saudi Embassy within the family visit visa validity .\n\nStep 06: Check Saudi Visa Status\nAfter submitting your passport to the embassy, you can check the Saudi Visa status with the passport number online.\nIf the visa is stamped, you need to book a return ticket for the family visit visa holder. Saudi authorities have the right to deport a visit visa holder if he does not have a return ticket.\n\nType of Visa\nNow scroll down a little further and select the type of family visit visa you want to apply for in Saudi Arabia;\n- The single-entry visit visa is issued for a period of 30 days only with 8 possible extensions of 30 days each i.e. 270 days.\n- The multiple-entry visit visa is issued for a period of 90 days only which cannot be extended anymore.\n- How to check Visit Visa validity in KSA?\n- Coming from : The Embassy from where you want to stamp the visa.\nIf you want to apply for a family visit visa for more than one family member, click on the “ Add ” button again to enter the details of the second applicant who wants to come to KSA. Otherwise,\n- Check “ Agreement Approval “.\n- Click on the “ Save ” button.\nOnce done, the MOFA system will generate an application number.\n- Save the application number for future use.\n- Print the application for further processing.\n\nVisit the Istiqdam office\n- Submit all the documents to the Istiqdam office and get Green and White paper from them.\n- After this fill the application online following the guidelines given above. Here is the link https://visa.mofa.gov.sa/Home/Services/citizens\n\nVisit the MOFA\nThe last step is to visit the MOFA with a print of your online application along with the paper given to you by the Istiqdam.\nOnce the documents are submitted, you can check the status of the approval of the application online.\n\nWho is eligible for a family visit visa?\nThe family visit visa can be applied for only the following people in Saudi Arabia. While relation 1-4 listed below is approved for everyone, relation 5-9 would be approved only if you have a good Iqama profession.\n- Wife/Husband.\n- Children.\n- Parents.\n- Parents-in-Law.\n- Grand Parents.\n- Brother and his family (wife and children).\n- Sister and her family (husband and children).\n- Sister-in-Law (sister of the spouse).\n- Brother-in-Law (brother of the spouse).", "Introduction\nAn Iranian woman who was once a beautiful lady with her own beautiful face, but unfortunately she ruined her own features and natural beauty just to make herself look like her favorite actress Angelina Jolie.\nIt is reported that this girl is just 19 years old and said that she is one of the biggest fans of the Hollywood actress, Angelina Jolie and she would do anything to transform herself into Angelina Jolie and she did.\nThis young lady created her Instagram account where she often posts her selfies. She was a beautiful and attractive lady when she started to operate herself. A soon as her story started to make headline Sahar Tabar Instagram followers increased to 307K.\nShe started to mold herself into Angelina Jolie by operating her face and losing her weight. Although she suffered a lot, instead of calling her Angelina Jolie, people started calling her Real Life Corpse Bride.\nAllah has granted us our face as a unique identity. Everybody has their own features and beauty. It is beyond our mind that a person can change his face totally to look like another person, this can only happen in TV dramas, movies or fantasy.\nThough there are many types of plastic surgeries being done in this era, every face has its own feature that can never be altered totally by surgeries. Many of the people feel regret after the surgeries for the results may not be as expected.\nSource: Al Arabiya", "Introduction\nThe HRSD Ministry has allowed expats to transfer jobs through Qiwa before completing the 1-year service after his arrival to Saudi Arabia. In this regard, the Ministry has approved 3 changes;\n1- The employee can change his job to another employer without completing the first year of service after his arrival to Saudi Arabia with the current employer’s consent.\n- Currently, there is no time restriction on the transfer of jobs. An employee can transfer to another employer even the next day.\n2- An expat has the right to transfer his job to another employer at the end of his contract without the permission of the current employer.\n- How to transfer iqama without Kafeel’s permission?\n- How to check the contract completion?\n3- An expat can also transfer his job to another employer before  completing the contract and without the consent of the current employer if;\n- 12 months have passed since the arrival in Saudi Arabia.\n- The employee provides 3 months’ notice to transfer his job.\n- The contract is terminated under Article 77 of Saudi Labor Law.\nKeep in mind that in case of resignation under Article 77, the employee will have to pay salaries equivalent to the remaining period of the contract to the employer.\nSource: Saudi Gazette", "Introduction\nThe Ministry of Interior has added 51 names to the list of banned names in Saudi Arabia. In other words, as a parent, you cannot name your child born in Saudi Arabia with any of these names.\n\nList of banned names in Saudi Arabia\nParents cannot give their babies born in Saudi Arabia with the following names;\n1- Malak – ملاك\n2- Abdul Ati – عبد العاطي\n3- Abdul Nasser – عبد الناصر\n4- Abdul Mosleh – عبد المصلح\n5- Nabi – النبي\n6- Nabiya – النبية\n7- Emir – أمير\n8- Somu – اذا مو\n9- Al-Mamlaka – المملكة\n10- Malika – مليكة\n11- Mamlaka – مملكه\n12- Tabaraka – طبرقة\n13- Nardeen – ناردين\n14- Maya – مايا\n15- Linda – ليندا\n16- Randa – رندة\n17- Basmalah – البسملة\n18- Tuleen – تولين\n19- Arm – ذراع\n20- Nareej – ناريج\n21- Rital – ريتال\n22- Als – ألس\n23- Sandi – ساندي\n24- Rama – راما\n25- Maleen – ماليين\n26- Eleen – إيلين\n27- Alas – واحسرتاه\n28- Ainar – عينار\n29- Loran – لوران\n30- Malkiteena – مالكيتينا\n31- Lareen – لارين\n32- Kibriyal – Kibriyal\n33- Laureen – لورين\n34- Binyameen – بنيامين\n35- Narees – ناريز\n36- Yara – يارا\n37- Sitaf – سيتاف\n38- Aileen – أيلين\n39- Loland – لولاند\n40- Tilaj – تلاج\n41- Barah – براح\n42- Abdul Nabi – عبد النبي\n43- Abdul Rasool – عبد الرسول\n44- Jibreel – جبريل\n45- Abdul Mo’een – عبد المعين\n46- Abrar – أبرار\n47- Milak – ميلاك\n48- Aiman – أيمن\n49- Bayan – بيان\n50- Baseel – باسيل\n51- Rilam. – ريلام.\nSource: Saudi Gazette\n\nWhy did they ban names?\nThe Ahwal Madani or Civil Affairs department said that some names are not in line with social traditions while others are not appropriate in terms of religion or have a Western origin.\n- How to get Iqama for a newborn in Saudi Arabia?", "Introduction\nThe Qiwa portal of the HRSD Ministry has set the maximum limit of workers in private establishments for some nationalities including India and Bangladesh.\nIt means that the number of workers from that particular nationality in a company cannot exceed the percentage of total workers.\n\nQiwa Maximum limit of workers for nationalities\n- Maximum Limit for Indian Workers: 40% .\n- Maximum Limit for Bangladeshi Workers: 40% .\n- Maximum Limit for Yemeni Workers: 25% .\n- Maximum Limit for Ethiopian Workers: 1% .\nLabor market experts believe that a limit has also been set for Pakistani nationals. However, it has not been disclosed yet.\nThe Qiwa portal has emailed the business owners about the percentage system.\n\nWhat if the number is already exceeded?\nThe Qiwa portal has clarified that companies with more than the maximum number of workers for these nationalities can still renew their employees’ work permits and Iqama. However, they would not be able to;\n- transfer new employees of the same nationality.\n- Issue visa for the same nationality.\n\nYou have exceeded the permissible number of workers for this nationality.\nThe establishments trying to transfer new employees through Qiwa receive the following error message.\n“You have exceeded the permissible limit of the number of workers for this nationality. So you can request one visa for this nationality in the event that there is no employee of this nationality with you.”\nSource: Saudi Gazette", "Introduction\nTo visit any of the Saudi Council of Engineers’ offices, one must book an appointment through the SCE website.\nOpen the SCE website and select the Branch and the period. The SCE has three branches in Saudi Arabia: Riyadh, Jeddah, and Dammam.\n- https://www.saudieng.sa/English/Contacts/Pages/Appointments.aspx\nOn the next screen, you will find SCE appointments on different dates and times. Click on any of them to proceed.\nEnter the following details to book an appointment with the Saudi Council of Engineers.\n- Name.\n- ID Number = Iqama Number.\n- Mobile Number.\n- Captcha Code.\nOn the next page, the SCE website will show you the confirmation page for the SCE appointment. Make sure you either print it or save it on your mobile.\nThe security guard at the gate would not let you enter without scanning the barcode during the appointment.\nRelated Articles\n- How to register with the Saudi Council of Engineers?\n- How to renew the Saudi Council of Engineers membership?", "Al Rajhi Bank\nTo pay the SCFHS Mumaris plus fee through Al Rajhi Bank;\n- Download the Application through PlayStore or iTunes .\n- Log in to your internet banking account.\n- Select “ Payments “.\n- Click on “ One-Time Payment “.\n- Press the “ Government Payment ” button.\n- Biller: 129: Saudi Commission for Health Specialities .\n- Enter the subscriber number.\nAl Rajhi Bank will show you the fee to be paid. If you are comfortable with the details, click the “payment” button.\n\nIntroduction\nWhen registering or renewing the Saudi Commission for Health Specialities on Mumaris Plus, you must pay the SCFHS fee through SADAD. This article explains how to pay the SCFHS Mumaris plus fee.\n\nSNB Bank\nTo pay SCFHS Mumaris plus fee in Saudi Arabia through SNB or Al Ahli Bank;\n- Download the Application through PlayStore or iTunes.\n- Log in to your internet banking account.\n- Click on the “ Menu ” button.\n- Select “ SADAD “.\n- Click on “ One-Time Payment “.\n- Biller: 129: Saudi Commission for Health Specialities .\n- Enter the subscriber number.\nIf all the details are correct, you can click the proceed button to pay for SCFHS Mumaris plus the fee.", "Introduction\nWe know that there are many professions in Saudi Arabia that need a degree for Iqama renewal and today we are going to share a list of those professions.\n\nList of professions which need a degree for iqama renewal\n- List of 310 medical professions.\n- List of 43 Engineering professions.\n- List of 136 Technician professions.\n- List of 19 professions that need SOCPA membership.\nCurrently, there are only 3 professional bodies that require registration of expats to work in Saudi Arabia. However, it is expected to increase in the future as the Saudi government is working on plans to regulate more sectors for better control and improved Saudization level.\n\nWhy is there a need for a degree for iqama renewal?\nSome time ago, all the professional fields in Saudi Arabia were unregulated which resulted in many fake and undeserving people securing key positions. In some sensitive fields such as medicine, this phenomenon can affect the lives of people.\nConsidering the situation, the government of Saudi Arabia decided to launch different professional bodies for different fields of workers who would verify their credentials and register them as a member.\nThe membership to those professional bodies with a degree is required to renew Iqama in Saudi Arabia. Now, we are going to share with you the list of professions that need a degree for iqama renewal.", "Businessmen Iqama\nExpats who invest in Saudi Arabia by registering their companies get an investor Iqama. These expats are also entitled to many benefits. However, they are not allowed to work for anyone except for themselves.\n\nDependents Iqama\nThe fourth type of Iqama in Saudi Arabia is dependent Iqama. People in this category are housewives, the children of expatriate workers, and their parents.\nThe expat needs to pay a dependent fee to renew their Iqama. Typically, the employer pays for the worker’s insurance cards. However, if the contract does not cover it, the worker must renew their insurance cards.\n\nDomestic Worker Iqama\nSaudis employ people with domestic workers’ Iqama at home as housemaids, drivers, and building watchmen. People with this type of Iqama can apply for a family visit visa . However, they cannot apply for a permanent family for their loved ones.\n\nGovernment employees Iqama\nPeople working in the government sector have a government employee, Iqama. They are also entitled to free treatment in Saudi Arabia’s government hospitals. Moreover, they don’t have to pay the dependent fee, which is a great advantage.\n\nIntroduction\nAround 10 million expats live in Saudi Arabia on different types of Iqama. Many people don’t even know that the kind of Iqama has an impact on your social class and entitlement to rights in Saudi Arabia.\n\nLabor Class Iqama\nThe second type of Iqama in Saudi Arabia is the labor class. These people are generally construction workers, cleaners, plumbers, and all workers with blue-collar jobs. Their companies pay for their insurance cards. People with this type of Iqama can apply for a family visit visa . However, they cannot apply for a permanent family for their loved ones.\n\nProfessional Class Iqama\nThe third type of Iqama in Saudi Arabia is a professional class iqama. Doctors, professors, accountants, and engineers working in the private sector come under this category of iqama. The people of this category are entitled to apply for a family visit visa and a permanent family visa for their families.\nPeople with this type of Iqama can easily apply for a visa to other countries such as Thailand , Malaysia , the Philippines , Canada , Schengen , the USA , or the UK . Their companies pay for their insurance cards.\n\nSpecial Privileged Iqama\nThe government of Saudi Arabia recently launched this type of iqama, which entitles you to many rights and benefits. To get this special, privileged Iqam or green card, you must pay SR 100,000 per annum, a one-time fee of SR 800,000.\nThe good thing about this type of iqama is that they don’t have to pay their children’s dependent fees.", "Introduction\nAs an ordinary investor, I was long troubled by the market’s dramatic fluctuations. The pressure of constantly monitoring market changes and trying to predict market highs and lows left me physically and mentally exhausted. I had always hoped to find a more stable and sustainable way to grow my wealth. Until I came across Anchor Mining , this platform finally allowed me to build a stable cash flow system, achieving a consistent daily return of several thousand dollars.\nThis isn’t a generic marketing article, but a real and feasible wealth growth experience. Today, I’ll share with you how to transform Anchor Mining from a simple “money-making tool” into a continuous “passive income goldmine.”\nRethinking Mining: It’s No Longer Just for Tech Players\nInitially, like many others, my understanding of “mining” was limited to the traditional model: buying expensive mining rigs, deploying on-site environments, dealing with constant noise and high electricity costs… This seemed only suitable for tech experts or capital investors.\nAnchor Mining, with its intelligent cloud mining model, completely overturned my thinking. In the Web3 era, individual users no longer need to bother building their own mining farms; they can simply lease and manage digital computing power resources. I no longer focus on complex mining machine parameters and operational details, but rely on the platform’s AI algorithm scheduling, making everything incredibly simple and easy.\nHow to Start Your Passive Income: Register and Receive $18 in Free Computing Power. Registration takes only seconds, and the system will automatically issue $18 in trial computing power.\nMy initial approach was very cautious, perhaps a common trait among all rational investors. (Week 1): I invested $600, choosing a short-term contract. The goal was simple: to verify the platform’s legitimacy and payback period. The results were surprising; upon contract maturity, principal and interest were successfully credited to my account, and the returns were clear and transparent.\nAfter confirming the platform’s stability and the authenticity of the returns, I began investing larger sums in batches. By comparing contracts with different periods and yields (such as Avalon Miner1446 and Whatsminer M60S), I constructed a contract portfolio to diversify risk and smooth the return curve. At this point, my daily returns steadily increased from tens of dollars to hundreds of dollars.\nI established a strict rule: reinvest 80% of all daily earnings to purchase new mining contracts. This simple action allowed my mining assets to snowball. Soon, my daily earnings surpassed $1000 and steadily progressed towards the thousands of dollars mark.\n(Anchor Mining offers a variety of mining contracts from beginner to professional levels)\nChoose your contract earnings, and your daily earnings will be automatically allocated. You can choose to withdraw to your wallet or automatically reinvest for compound growth.\nThe Cornerstone of Stable Earnings: Why Did I Dare to Invest So Largely?\nEarning thousands of dollars a day is not just luck. My confidence in allocating a large portion of my assets here stems from a deep understanding of Anchor Mining’s underlying logic.\nUltimate Compliance and Security:\n- Legally registered in the UK and regulated by law, not an anonymous “unofficial platform.”\n- Bank-grade SSL encryption and offline cold wallet technology ensure the safety of my principal and earnings.\n- Dual security protection with McAfee and Cloudflare effectively resists external attacks. Transparent Profit Model:\n- All cntract yields are based on actual mining output, deducting electricity, maintenance, and other costs, making them clear and transparent.\n- Every profit can be queried on a blockchain explorer, ensuring complete transparency and eliminating the “false prosperity” of Ponzi schemes.\nTechnology-Driven Efficiency Maximization:\n- The platform’s AI intelligent scheduling system is its core competitive advantage. It can automatically switch computing power to the highest-yielding cryptocurrency for mining 24/7, with efficiency and response speed far exceeding manual operation. This is equivalent to hiring a tireless, top-tier mining fund manager.\nGreen and Sustainable Business Model:\n- Anchor Mining’s mining farms are located in areas rich in clean energy, fundamentally solving the environmental controversies and energy cost issues of traditional mining, ensuring the long-term sustainability of the business.\nCore Advantages Overview:\n- 100% green energy mining, adhering to sustainable development principles.\n- Bank-grade security measures, including SSL encryption and cold wallet storage.\n- Legally registered in the UK, ensuring high operational transparency.\n- 24/7 customer support, with an average response time of only 1 to 3 minutes.\n- Compatible with multiple mainstream cryptocurrencies: BTC, ETH, XRP, DOGE, LTC, USDT, USDC, SOL, etc.\nConclusion: The Transformation from Investor to “Digital Miner” Today, I still don’t need to stare at market data software every day, and I’m no longer anxious about short-term market fluctuations. My work has become very simple: regularly check my earnings, execute reinvestment strategies, and continuously learn to optimize my asset allocation.\nAt Anchor Mining, I’ve gained more than just stable daily earnings of thousands of dollars; I’ve gained a sense of control over my wealth and inner peace. I’ve finally made “computing power,” this never-ending money-making machine, work for me 24/7.\nThe world is rewarding those who embrace future trends and skillfully utilize tools. Anchor Mining is the key I found to unlock the door to digital wealth.\nOfficial Website: anchormining.com\nContact Email: info@anchormining.com", "AI and cybersecurity services\nAs more companies digitize operations, demand for affordable AI and cybersecurity solutions is soaring. Tech-savvy entrepreneurs can offer chatbot development, data-protection training, or IT consultancy.\n\nBest business ideas for beginners in Dubai\nhttps://www.pexels.com/photo/question-marks-on-craft-paper-5428830/\nIf you’re just starting out, Dubai offers low-cost, high-potential ideas that can grow quickly with the right guidance.\n\nBusiness-friendly environment\nDubai ranks among the top 20 cities globally for ease of doing business. Entrepreneurs benefit from streamlined licensing, 100% foreign ownership, no NOC requirements, and fast, fully digital company setup.\n\nConsultancy services\nMany businesses in Dubai prefer hiring consultants instead of full-time staff. Consultancy opportunities include marketing, finance, HR, real estate, and legal services. This is ideal for professionals who want to monetize their expertise.\n\nDigital marketing\nAs companies move online, demand for SEO, social media, and content creation is soaring. Setting up a digital marketing agency positions you perfectly to serve both local and international clients.\n\nDigital transformation\nLicensing, visa services, and government approvals can now be completed online in a matter of hours. This efficiency allows entrepreneurs to focus on business growth instead of paperwork.\n\nE-commerce business\nOnline retail continues to boom, with the UAE’s e-commerce market expected to reach USD 17 billion by 2025. You can start with minimal stock or try dropshipping. All you need is a niche, an engaging website, and a smart marketing strategy.\n\nE-commerce store\nThe UAE’s rapid digital transformation and strong logistics infrastructure make e-commerce one of the top business opportunities. You can sell niche products — from fashion to electronics — and reach customers across the GCC.\n\nFinancial and tax advantages\nWith 0% personal income tax, competitive corporate tax exemptions, and over 130 double-tax treaties, Dubai is built for wealth creation and preservation. Its currency is pegged to the US dollar, providing stability for international investors.\n\nFood and beverage\nDubai’s multicultural population supports a dynamic food scene. Cafés, restaurants, and specialty outlets that focus on healthy or ethnic cuisines can easily attract loyal customers.\n\nFreelance services\nFreelancing is one of the easiest ways to begin. With minimal overheads, you can work independently, test business ideas, and build a portfolio. A freelance permit lets you start small — while an LLC structure provides legal protection and credibility.\n\nGlobal reach\nDubai’s location gives businesses access to billions of potential customers within a four-hour flight radius. It’s a natural gateway between Asia, Europe, and Africa — ideal for trade, logistics, and digital commerce.\n\nHealth and wellness\nWith growing health awareness among residents and expatriates, wellness centers offering yoga, physiotherapy, and nutritional counseling are in demand.\n\nHome-based business\nFrom handcrafted décor to home-cooked meals, Dubai consumers love locally made products. Home-based ventures require low investment, flexible hours, and are easy to market through social media. Influencer marketing also falls into this category — as long as you’re licensed and compliant with UAE advertising laws.\n\nIntroduction\nDubai is one of the world’s most exciting destinations for entrepreneurs. With its strategic location, business-friendly laws, and tax incentives, the city offers newcomers the perfect launchpad to turn ideas into thriving ventures. Whether you’re an individual freelancer, an aspiring e-commerce seller, or a future consultant, the opportunities are limitless.\nThe UAE consistently ranks among the top countries for entrepreneurship, with over 95% of Dubai’s businesses classified as SMEs. This means first-time founders can start lean, scale fast, and plug into a vibrant ecosystem built for innovation. The best part? You don’t need a large team or big capital — just the right foundation for your business setup in Dubai\nThis guide explores why entrepreneurs choose Dubai and highlights the best small-business ideas for beginners who want to start strong and grow with confidence.\n\nInvestor confidence\nDubai’s reputation for transparency and global standards attracts both local and foreign investors — giving new startups better access to funding and partnerships.\n\nLifestyle and talent\nThe city’s cosmopolitan environment, safety, and connectivity make it an attractive place to live and work. This helps entrepreneurs attract and retain skilled professionals from around the world.\n\nReal-estate activities\nDubai’s thriving property market offers beginners a chance to start small and scale quickly. You can begin as a real-estate consultant or broker and later expand into leasing, holiday-home management, or property development.\n\nSocial-media consultancy and content creation\nWith the rise of Instagram, TikTok, and YouTube, social-media management is one of Dubai’s most in-demand skills. You can help small businesses grow online, manage their content calendars, or provide creative campaigns — all with minimal setup costs.\n\nStart your business journey in Dubai\nStarting a business in Dubai may seem complex, but with the right support, it’s easier than ever. Whether you’re launching an online store, consultancy, or creative agency, the process is fast, digital, and built for first-time founders.\nWith a clear plan and the right business setup in Dubai , you can get licensed, open a corporate bank account, and start operations in as little as 60 minutes. You’ll gain full ownership, access to more than 2,500 business activities, and the flexibility to expand at your own pace.\nDubai is where ambition meets opportunity — a place where anyone with a vision can build, grow, and succeed.\n\nSupportive ecosystem\nFrom incubators and accelerators to mentorship programs and networking hubs, Dubai supports founders at every stage of growth.\n\nTop business opportunities in Dubai’s growing economy\nDubai’s economy is diverse, fast-moving, and constantly evolving. Here are some of the most promising sectors attracting entrepreneurs today.\n\nTourism and hospitality\nAs a global tourist hub, Dubai offers opportunities in travel agencies, concierge services, and custom tour packages. Businesses that deliver unique visitor experiences can expect high returns.\n\nWhy entrepreneurs choose Dubai to launch and grow\nPeople from all over the world choose Dubai to start their business — and for good reason. The city combines global reach, financial stability, and a future-ready infrastructure that few other destinations can match.\n\nWhy now is the best time to start a business in Dubai\nDubai’s economy is driven by diversification, innovation, and entrepreneurship. As the government continues to simplify regulations and promote small businesses, there’s never been a better time to start.\n\nWorld-class infrastructure\nDubai blends innovation and lifestyle — from high-speed transport systems to smart homes and digital services. The city’s infrastructure ensures business owners can operate efficiently and live comfortably while scaling their ventures.", "Convert the temporary SCE membership to permanent\nIn case you have got the degree/certificate relevant to your profession, you can convert your temporary membership of the Saudi Council of Engineers to the normal one following this way;\nLog in to your SCE account and click on the option to “ convert temporary membership to permanent “.\nClick on the “ Add New Request ” button.\nUpload the degree/certificate required to convert the temporary SCE membership to permanent.\nOnce the request status changes to “ completed “, it means that the Saudi Council of Engineers has converted your temporary membership to the normal one.\nNow you need to request the renewal following the procedure explained above. The SCE will issue a SADAD number to pay for the renewal of membership . Your membership will be renewed after a while.\nImportant Note\nIf your request to convert your temporary membership to the normal one is not accepted after a few days, you can always book an SCE appointment and visit them.\n\nIntroduction\nEvery expatriate engineer and technician needs to renew the Saudi Council of Engineers (SCE) membership for Iqama renewal. Here is the complete guide.\n- How to register with the Saudi Council of Engineers?\n\nIqama renewal during the validity of SCE membership\nIt is worth mentioning that Iqama renewal is possible;\n- 3 months before the Iqama expiry date.\n- While your SCE membership is valid.\n\nRenewing temporary membership of SCE\nIf you have initially got a temporary membership with the Saudi Council of Engineers, the renewal is possible in only two scenarios ;\n- Change the Iqama profession .\n- Provide the degree/certificate relevant to your profession.\n\nSaudi engineers council renewal\nLog in to your SCE account. In case you have forgotten the password for the Saudi Council of Engineers account, you can click on the “ retrieve login information ” button.\n- https://eservices.saudieng.sa/en/accreditation/Pages/login.aspx\nNow login to your Saudi Council of Engineers account;\n- Scroll down until you see the “ Renew Membership ” button.\n- This option will appear only 90 days before the SCE membership expiry.\nA new page will open where you need to click on the “ Add New Request ” button.\nOn the next page, you need to enter 3 details;\n- The duration for which you want to renew your Saudi Council of Engineers membership.\n- Iqama Number.\n- Iqama Expiry Date.\nThe fee for the renewal of the Saudi Council of Engineers membership is;\n- Engineers: SR 250/year.\n- Technicians: SR 200/year.\nAfter submitting this information, the SCE website will open a new page containing your request number for the renewal of your membership.\nWait for a couple of hours and log in to your account again. Go to the messages section where you will find a SADAD number to pay for the renewal of your membership.\nCheck your account again after a while of making the payment , you will find a message that your request for the renewal of the Saudi Council of Engineers membership has been accepted.", "Deactivate / Delete SCE Account\nIf you do not have access to the email address used to create the SCE account, you will have to request the Saudi Council of Engineers to deactivate or delete the account.\n- Ask your employer to write a letter requesting SCE to delete/deactivate the account.\n- Get the letter attested by the chamber of commerce.\n- Take the appointment with the SCE and submit the letter.\n- SCE will deactivate the account.\n- After 10,15 days, you can register with the Saudi Council of Engineers again with the new email.\n\nIntroduction\nEvery expat engineer and technician working in Saudi Arabia has to register with the Saudi Engineering Council for Iqama renewal. Here is Saudi Engineering Council (SCE) registration process for technicians with and without a diploma certificate.\n- How to renew the Saudi Council of Engineers membership?\n\nIqama Renewal\nYou can renew your Iqama when your SCE membership is valid, even if it is valid for the next 2 days. Otherwise, you can start the process for the renewal of the Saudi Council of Engineers membership.\n\nJawazat Updated\nOnce you have paid SR 500 fee for Saudi Engineering Council Registration for technicians, the SCE will start verifying your documents. They might ask you to send additional documents or a clear copy of the same file.\nOnce the verification process is completed, you will receive an SMS from the Saudi Council of Engineers to pay the membership fee .\nOnce it is paid, the status of your account will change to Yaqeen verified and Jawazat updated.\n\nLetter of Introduction\nTo register with the Saudi Council of Engineers, you need your employer’s authorization letter. Make sure that the Chamber of Commerce stamps the letter.\n\nPayment of SCE Registration Fee\nNow, you need to pay SR 500 as the registration fee . An SMS will be sent to you containing the SADAD bill number. The SCE will not start auditing your request for registration until SR 500 fee is paid.\n\nPrint SCE Certificate\nAfter successfully registering as an engineer or technician, you can visit any Saudi Engineering Council office to collect your SCE certificate and membership card.\n\nSCE Professions List – Technicians\nHowever, regarding the technicians, Saudi Engineering Council technician registration is necessary for the iqama renewal of 136 professions only.\n\nSCE Registration Requirements\nHere are the requirements for registration with the Saudi Council of Engineers.\n- Photograph.\n- Iqama scanned copy.\n- Passport scanned Copy.\n- Saudi Council of Engineers authorization letter.\n- Letter of Introduction duly attested by the Chamber of commerce.\n- Degree or Diploma duly attested by the Saudi Embassy.\n- Academic Transcript or Marksheet.\n\nSCE Registration for diploma holders\nIn the next step, the system will ask if you have a diploma certificate. Since we are filing the Saudi Engineering Council registration application for diploma holders, we have selected “ Yes ” here. Enter other details such as;\n- Specialization.\n- Graduation Country.\n- Graduation Year.\n- The name of the college or university.\nNow upload all the required documents in the SCE portal for the registration as an engineer or technician.\n\nSCE registration for Technician\nFirst, open this link and enter details such as your email, nationality, mobile number, and membership classification i.e., engineer or technician.\nLogin to your email account and activate your SCE account. After activation, login to your SCE account.\nIn the next step, you need to enter the following details into your Saudi Engineering Council account;\n- Iqama Number.\n- Passport Number.\n- Iqama Expiry Date.\n- Iqama Profession.\nNow the system will fetch your name and the name of your employer from the Jawazat while you will have to;\n- Upload your photograph.\n- Enter the country of Birth.\n- Enter Date of Birth.\n- Select the country, region, and city of residence.\nIn the next step, select the duration of membership with the SCE. The membership cost for the Saudi Council of Engineers is;\n- SR 200/year for technicians.\n- SR 250/year for engineers.\n\nSaudi Council of Engineers profession list\nWe have provided a list of engineering professions required to register with the Saudi Council of Engineers. Keep in mind that all engineers are required to register with the Saudi Council of Engineers, no matter whether their profession appears here or not.\n- Engineer of auxiliary power units for aircraft.\n- Petroleum Engineer.\n- Microwave engineer.\n- Mechanical engineer hydraulic inhibitors.\n- Vehicles mechanical engineer.\n- Mechanical engineer, engines and machines, except marine.\n- Welding mechanical engineer.\n- General Mechanical Engineer.\n- Mechanical engineer, train maintenance.\n- Aircraft maintenance mechanical engineer.\n- Mechanical engineer, ship maintenance.\n- Mechanical maintenance engineer.\n- Shipbuilding mechanical engineer.\n- Poured mechanical engineer.\n- Central air conditioning mechanical engineer.\n- General production mechanical engineer.\n- Production mechanical engineer.\n- Mechanical engineer, methods.\n- Mechanical engineer of machines and industrial machines.\n- Soil Mechanics.\n- Engineer Materials Engineer Material handling engineer.\n- Mining engineer.\n- Military Aircraft Calibration Engineer.\n- Aircraft brake component processing engineer.\n- Metal engineer.\n- Project Engineer.\n- General Survey Engineer.\n- Aerospace engineer.\n- Marine Survey Engineer Engineer propeller for military aircraft.\n- Quality control engineer.\n- Civil engineer (ports).\n- Civil engineer (airports).\n- Civil engineer (traffic).\n- Civil engineer (methods).\n- Civil engineer (railway).\n- Civil engineer (dams).\n- Civil engineer (irrigation).\n- Civil Engineer (Bridges).\n- Civil engineer (metal constructions).\n- Civil engineer.\n- Quarry engineer.\n- General chemical engineer.\n- Chemical engineer petroleum industries.\n- Chemical engineer, food industries.\n- Chemical engineer, fertilizer industries.\n- Chemical engineer research and development.\n- Safety electrical engineer.\n- Electrical engineer, transmission and distribution.\n- Transmission electrical engineer.\n- Electrical engineer monitoring and control.\n- General Electrical Engineer.\n- Maintenance electrical engineer.\n- Electrical engineer electric power generation.\n- Distribution electrical engineer.\n- Electrical engineer extensions.\n- Electrical engineer and instrumentation.\n- Efficiency engineer in water analysis.\n- Flight engineer.\n- Nuclear power engineer.\n- General industrial engineer.\n- Sanitary engineer, water and sewage.\n- Occupational Safety and Health Engineer.\n- Agricultural engineer.\n- Time and motion study engineer.\n- Cathodic protection engineer.\n- Well drilling engineer.\n- Geologist Engineer.\n- Engineer gearbox aircraft and artillery.\n- Site Coordination Engineer Blasting engineer.\n- Mining engineer.\n- Development and specification engineer.\n- Aircraft workshop production development engineer.\n- Manufacturing engineer.\n- Interior design engineer.\n- Industrial equipment installation engineer.\n- Aircraft landing gear engineer.\n- Factory planning engineer.\n- City planning engineer.\n- Environment engineer.\n- Naval engineer on board.\n- Senior Survey Engineer.\n- Senior mapping software engineer.\n- General electric engineer.\n- Electronic maintenance engineer.\n- Electronic engineer, medical devices.\n- Engineer of agricultural machinery.\n- Mineral extraction engineer.\n- Engineer Coordinator of Quality Systems.\n- Senior digital aerial survey supervisor.\n- Senior Aerial Survey Supervisor.\n- Safety and Loss Prevention Adviser.\n- Occupational Safety and Health Adviser.\n- An internal auditor for quality systems.\n- Senior inspectors non-destructive inspection of aircraft.\n- Senior Quality Systems Auditor.\n- Senior environmental monitoring systems technician.\n- Senior Occupational Safety and Health Specialist.\n- Head of the Internal audit program.\n- Safety and Loss Prevention Expert.\n- Occupational safety and health expert.\n- Geodetic expert.\n- Technology in the glass and ceramics industry.\n- Marine equipment specialist.\n- Digital aerial survey specialist.\n- Digital Cartographer.\n- Occupational Safety and Health Specialist.\n- Digital Maps Specialist.\n- Patent specialist.\n- Senior Specialist Quality Check.\n- Cartography Aircraft supply specialist.\n\nTechnicians without a Diploma\nThe expats who do not have a degree or diploma but whose profession is one of the 136 technician professions listed below can also complete the temporary registration process with the Saudi Engineering Council.\nAt the time when the SCE system asks if you have a diploma or certificate, select “ NO .”\nWarning: SCE technician registration without a diploma is for a period of 12 months. After this, he will either have to change the Iqama profession or get a certificate relevant to the work.\nOnce this period is expired, you will neither be able to change your Iqama profession nor renew your Iqama .\n\nThe fee for SCE\n- Registration Fee: SR 500.\n- Membership fee: SR 200/year for technicians and SR 250/year for engineers.\n- Total Fee: SR 700 for technicians and SR 750 for engineers.\n\nWho needs SCE Registration?\nBefore going further, we need to understand that the following two categories of expats require SCE registration;\n- All types of Engineers.\n- List of 136 technician professions (given below).\n\nWhy does SCE reject registration?\nIf you receive a message on your email that your Saudi Council of Engineers registration is rejected after verification, you should not panic as it could be due to one of the following reasons;\n- Incomplete or Unclear documents.\n- The degree is not attested by the Saudi Culture and the Saudi Embassy.\n- Fake Documentation. Source: Saudi Gazette\n- An engineer with less than 5 years of experience. Source: Saudi Gazette\n- Iqama profession is reserved for Saudis e.g., fire and safety engineers.\nIf your Saudi Council of Engineers registration is rejected, call the SCE helpline at 920020820 and the phone officer will guide you.\n\nYaqeen Verified\nYou can see from the screenshot below that the Yaqeen status is already verified.\nYaqeen verified on the Saudi Council of Engineers account means that you have successfully uploaded your Iqama in the SCE system, and your basic details, such as your Iqama number, Iqama expiry date, name, employer name, and the Iqama profession, are already verified by the Ministry of Labor records.", "Al Rajhi Bank\nIn order to pay the Saudi Council of Engineers fee through Al Rajhi bank,\n- Download the Application through PlayStore or iTunes .\n- Log in to your internet banking account.\n- Select “ Payments “.\n- Press the “ One Time Payment ” button.\n- Select “ Government Services “.\n- Search “ 123 – Saudi Council of Engineers “.\nOn the next page,\n- Write the SADAD bill number generated from the SCE website.\n- The system will show the SCE fee to pay.\n- Click on the “ Confirm ” button to pay.\n\nIntroduction\nWhen registering or renewing SCE, you need to pay the Saudi Council of Engineers fee online using the SADAD code. Here we have explained the process;\n\nSNB or Al Ahli\nIn case you want to make the payment of the Saudi Council of Engineers fee through SNB Bank;\n- Download the Application through PlayStore or iTunes.\n- Log in to your internet banking account.\n- Click on the “ Menu ” button.\n- Select “ SADAD ” from the given options.\n- Click on the “ Government Payments “.\n- Biller: Gov. Agencies .\nOn the next page, select the following settings to pay the Saudi Engineers Council fee through SADAD;\n- Biller Group: Gov. Agencies\n- Biller: 123 Saudi Council of Engineers.\n- Subscriber Number: SADAD Bill number.\n- Click on the “ Proceed ” button to make the SCE payment.\nAfter the payment is made, wait for 10 minutes and log in to your SCE account to check the status of the payment.\n\nSaudi Council of Engineers fee\n- Registration Fee: SR 500.\n- Membership fee: SR 200/year for technicians and SR 250/year for engineers.\n- Renewal Fee: SR 200/year for technicians and SR 250/year for engineers.\nAt the time of registration or renewal of membership, SCE sends an SMS to the registered mobile number containing a SADAD bill number to make the payment.\nIf you have lost the SMS, you can log in to your SCE account and retrieve the SADAD number from there.", "Calculation of Dependent Fee\n- July 2017 to June 2018: SR 100 per month.\n- July 2018 to June 2019: SR 200 per month.\n- July 2019 to June 2020: SR 300 per month.\n- July 2020 to June 2021: SR 400 per month.\n- Dependent fee after June 2021: SR 400 per month.\nSome people think that there will be no dependent fee after 2023 which is not true. The government of Saudi Arabia has not made any such announcement.\nIllustration\nIf your Iqama Expiry Date is March 31, 2020, you will have to pay the dependent fee for 12 Hijri months;\n- 3 months @ SR 300/month = SR 900.\n- 8 months 20 days @ SR 400/month = SR 3,500.\n- Total Dependent Fee: SR 4,400 approx.\n- 12 Hijri months = 11 months 20 days Gregorian months.\nEntering the above details in the expat dependent fee calculator given above would generate the following result.\n\nExempt from the Dependent Fee\nThe following 7 types of expatriates are exempt from paying the dependent fee.\n- Government Employees.\n- Domestic Workers.\n- Non-Saudi children of a Saudi father or mother.\n- Widow of a Saudi man.\n- Husband or Wife of a Saudi spouse.\n- Foreign Students living on a Student Visa.\n- Non-Saudi parents of Saudi children.\n\nIntroduction\nEvery expatriate having his family in Saudi Arabia needs to pay the dependent fee. Here is an expat dependent fee calculator which will help you to calculate your dependent fee liability according to the applicable rules in Saudi Arabia.\n- How to pay the dependent fee in KSA?\n\nSome Useful Calculators\nApart from the Dependent Fee calculator, we have produced some other useful calculators as well for your help.\n- End of Service Calculator.\n- Maktab Amal Fee Calculator.\n- Iqama Fee Calculator.\n- Overtime Calculator.\n- Vacation Salary Calculator.\n- End of Service Calculator 2.", "Al Rajhi Bank\nIn order to pay the late birth certificate fee online through Al Rajhi bank;\n- Download the Application through PlayStore or iTunes .\n- Log in to your internet banking account.\n- Click on the three dots on the left-upper corner.\n- Select “ Payments & Bills “.\n- Press the “ Government Payment ” button.\n- Services: Civil Registration .\nOn the next step, follow these settings to pay the late birth certificate fee;\n- Application Type: Birth Registration .\n- Transaction Type: Payment .\n- National ID Number: Iqama Number .\n- Birth Date: the DOB as per the Birth Notification.\n- Click on the “ Confirm ” button to pay SR 50 late birth certificate fee.\n\nIntroduction\nIn order to get the Birth Certificate after 30 days of the child’s birth, you need to pay SR 50 late birth registration fee online.\n- There is no fee if you apply for the birth certificate within 30 days of the birth.\n- SR 50 is the penalty for the late registration of the birth certificate.\n\nSNB or Al Ahli Bank\nIn order to pay the late fee for the birth certificate online through NCB or Al Ahli Bank;\n- Download the Application through PlayStore or iTunes.\n- Log in to your internet banking account.\n- Select “ SADAD “.\n- Click on “ Government Payments and Refund “.\n- Biller: Civil Registration .\n- Service: Birth Registration .\n- Select “ Unregistered “.\n- National ID number: Iqama Number of the head of the family.\n- Birth Date: Date of Birth as per Hijri calendar.\n- Click on the “ Request Payment Fee ” button to pay the fee.", "Al Rajhi Bank\nIn order to pay the Work Permit Levy through Al Rajhi Bank, log in to Al Rajhi Bank;\n- Download the Application through PlayStore or iTunes .\n- Log in to your internet banking account.\n- Click on the three dots on the left-upper corner.\n- Select “ Payments “.\n- Press the “ One Time Payment ” button.\n- Categories: Government Services .\nFrom the Government Services;\n- Select 050 Ministry of Human Resources & Social Development.\n- Enter SADAD Number.\nThe next screen will show you the amount of work permit levy to pay. If you are comfortable with it, click on the payment button.\n\nCalculation of Maktab Amal Fee\nThe work permit levy was imposed for the first time in 2012. The government announced to increase it heavily from the year 2018.\n- YEAR 2017: SR 200/month or SR 2,400 per annum.\n- YEAR 2018: SR 400/month or SR 4,800 per annum.\n- YEAR 2019: SR 600/month or SR 7,200 per annum.\n- Maktab Amal Fee Year 2023: SR 800/month or SR 9,600/annum.\n- Discount: SR 100/month discount to companies that maintain a 50% Saudization level.\n- Industrial Companies: No Maktab Amal Fee.\n\nCheck Maktab Amal Fee payment status\nYou need to get the SADAD number and check the payment status of the work permit levy to pay the work permit levy. In order to do it,\n- Open the Ministry of Labor Website .\n- Select Type of Service: “ خدمة رقصة العمل “\n- Enter Iqama Number /Border Number.\n- Enter Captcha Code and click on “ بحث “\nFrom this screen, you can check the payment status of Maktab Amal fee and copy the SADAD number to pay it online.\n- تم السداد: Work Permit Levy is paid.\n- قيد السداد: Work Permit Levy is due.\n- منتھي الصلاحیة: Work Permit has expired.\n\nExemption from Work Permit Levy\nThe Maktab Amal fee rules for Iqama renewal do not apply on the following categories of expatriates\n- Non-Saudi Government employees.\n- Domestic Workers.\n- Non-Saudi children of a Saudi father or Saudi mother.\n- Widow of a Saudi man.\n- Non-Saudi spouse of a Saudi national.\n- Firms employ less than 5 employees if the owner is a full-time employee of the firm. Source: Saudi Gazette\n- The first 5 expatriate employees are exempt if the firm is employing up to 9 foreigners. Source: Saudi Gazette\n\nIntroduction\nIn order to renew Iqama, the employer needs to pay the work permit levy. In this article, we have given a Maktab Amal Fee calculator and explained the rules and the procedure to check and pay the work permit levy online.\n- How to renew Iqama in Saudi Arabia?\n\nNCB Bank\nIn order to pay the Maktab Amal fee online using NCB bank, login to Al Ahli Account and click on the 3 dashes on the upper-right corner then select;\n- SADAD.\n- One Time SADAD Payment.\nEnter the following details on the next screen;\n- Biller: Alien Control.\n- Biller: 050 Ministry of Human Resources & Social Development.\n- Subscriber Number: SADAD Number.\n\nSome Useful Calculators\n- End of Service Calculator.\n- Saudi Dependent Fee Calculator.\n- Iqama Fee Calculator.\n- Overtime Calculator.\n- Vacation Salary Calculator.\n- End of Service Calculator 2.", "Al Rajhi Bank\nIn order to pay the dependent fee online using Al Rajhi bank,\n- Download the Application through PlayStore or iTunes .\n- Log in to your internet banking account.\n- Click on Payments .\n- Press the “ Government Payment ” button.\n- Services: Residents Services\n\nCheck Dependent Fee in Absher\nIn order to check if the dependent fee is properly paid, log in to your Absher account.\n- Scroll down until you see “ Public Query Available Funds “.\n- Enter “ Iqama Number “.\n- Enter the captcha code.\nIf you find an amount of deposit under “ Passport Deposit “, it means that the dependent fee has been paid.\n\nDependent Fee for a New Iqama\nEnter the following details to issue the final exit visa of a specific associate or want to issue a new Iqama for a dependent;\n- Biller: Residents Services.\n- Service: Associate Fees for a Specific Associate.\n- Select Unregistered.\n- Iqama ID: Family Head Iqama Number.\n- Associate Iqama ID: Border Number or Dependent Iqama #.\n- Fee duration for New Iqama: Iqama Expiry Date .\n- Fee duration for Final Exit: Final Exit Visa Issuance Date + 2 months.\n\nDependent Fee for a New Iqama\nSelect “ Associate Fees for a Specific Associate Service ID ” to pay the dependent fee for the following 3 categories;\n- Issue a final exit for a specific dependent.\n- A baby born outside Saudi Arabia.\n- A family arrived on a permanent family visa.\nNote: There is no dependent fee for the first 3 months of arrival to KSA.\nAfter the selection, enter the following details;\n- Transaction Type: Payment.\n- Iqama ID: Family Head Iqama Number.\n- Associate Iqama ID: Border Number or Dependent Iqama #.\n- Fee duration for New Iqama: Iqama Expiry Date .\n- Fee duration for Final Exit: Final Exit Visa Issuance Date + 2 months .\n\nDependent Fee for all family\nEnter the following details if you want to pay the dependent fee for all family members at once for Iqama renewal;\n- Biller: Residents Services.\n- Service: Associate Fees for all Registered Associated on the Head of Household.\n- Select Unregistered.\n- Iqama ID: Family Head Iqama Number.\n- Fee Duration for Iqama Renewal: Iqama Expiry Date + 1 year.\n- Pay Dependent Fee for 3 months: Iqama Expiry Date + 3 months.\n- Fee duration for Final Exit: Final Exit Visa Issuance Date + 2 months.\n\nDependent Fee for all family\nIf you want to pay the dependent fee for all family members under your sponsorship, select “Associate Fees for All Registered Associates on the Head of Household Iqama Service ID” and enter the following details;\n- Transaction Type: Payment .\n- Iqama ID: Family Head Iqama Number .\n- Fee duration for Iqama Renewal: Iqama Expiry Date + 1 year.\n- Pay Dependent Fee for 3 months: Iqama Expiry Date + 3 months.\n- Fee duration for Final Exit: Final Exit Visa Issuance Date + 2 months.\n\nDependent fee for a newborn\nEnter the following details to pay the dependent fee for a child born inside Saudi Arabia;\n- Biller: Residents Services.\n- Service: Adding Dependent born Inside Saudi Arabia .\n- Select Unregistered .\n- Iqama ID: Family Head Iqama Number .\n- Dependent DOB: Date of Birth of the newborn .\n- Fee duration for New Iqama: Iqama Expiry Date.\n\nDependent fee for a newborn\nIf your child is born in KSA , select the option “ Adding dependent born inside Saudi Arabia ” and enter the following details;\n- Transaction Type: Payment.\n- Iqama ID: Family Head Iqama Number.\n- Birth Date: Dependent Date of Birth.\n- Fee duration: Iqama Expiry Date .\n\nIntroduction\nEvery expat having a family in Saudi Arabia needs to pay the dependent fee at the time of renewal of the Iqama or issuance of the new iqama of a family member.\n- Saudi Dependent Fee calculator.\n\nSNB or Al Ahli Bank\nIn order to pay the dependent fee online using SNB bank;\n- Download the Application through PlayStore or iTunes.\n- Log in to your internet banking account.\n- Click on the Menu in the bottom-right corner.\n- Select “ SADAD “.\n- Choose “ Government Payments “.", "Application details\nOn the application details page, enter your professional field, specialty, and qualification. Moreover, if you have already taken your Prometric or R&C exam, you need to enter the following details;\n- Enter R&C Eligibility ID.\n- Upload Prometric Result Copy.\n\nEducation\nOn the Education page, you need to enter your highest qualification, and upload the following;\n- Degree or diploma.\n- Academic transcript.\n- Dataflow verification of degree.\n- Dataflow reference number.\n\nIntroduction\nEvery medical professional in Saudi Arabia needs to register with the Saudi Commission for Health Specialties (SCFHS) by creating a new account and applying for classification with Mumaris plus.\n- How to apply for Mumaris plus renewal?\n\nMumaris plus new account\nFirst of all, open the following website to create a new account. https://portal.scfhs.org.sa\nThere will be two options from where you need to select “Individual”.\nFill the form to create a new Mumaris plus account and click on the “signup button”.\nNow login to your Mumaris plus account and click on the “New Services” and then “Professional Classification” button.\nNow click on the “Apply Now” button and fill the declaration form. In normal cases, all the questions will be answered with “No”.\n\nPayment\nIf all the details are filled in correctly, submit the application which will take you to the payment screen. You can either pay SCFHS Mumaris plus fee through SADAD or a credit card.\nCongratulations, you have successfully created a new account with Mumaris plus and applied for the classification to the Saudi Commission for Health Specialties. The SCFHS responds back within one to three weeks.\n\nPersonal information\nOn the personal information page, you need to upload your photograph and the passport copy.\n\nRequired Documents\nThe following documents should be available on your computer before creating a new account and applying for classification in SCFHS Mumaris plus.\n- Photograph.\n- Passport copy.\n- Degree or diploma.\n- Academic transcript.\n- Dataflow verification of degree.\n- Employment Certificates.\n- Certificate of Registration/Licensing.\n- Dataflow verification of License.\n- Dataflow reference number.\n- R&C Exam Eligibility ID.\n- Prometric exam (R&C) result.\n\nWhat Next?\nProfessional Classification: The first step before being registered as a health practitioner in SCFHS is creating a new account with Mumaris plus (explained above).\nProfessional Registration: Register officially as a health practitioner.\nProfessional Re-Registration: The renewal of professional registration as a health practitioner.\nRecognition of CPD Hours: Recording CPD hours obtained abroad or through self-learning activities.\n\nWork Experience\nOn the work experience page, you need to add the details of all your previous jobs and upload the related employment certificates.\nOnce the employment details are added, click on the “Add Work Experience” button again and select “A certificate of Registration/Professional Licensing” and upload;\n- Certificate of Registration/License.\n- Dataflow verification of License.\n- Dataflow reference number.", "Al Rajhi Bank\nTo pay the iqama renewal fee online using Al Rajhi Bank,\n- Download the Application through PlayStore or iTunes .\n- Log in to your internet banking account.\n- Select the “ Payments ” option.\n- Press the “ Government Payment ” button.\n- Click on “ Residents Services “.\n- Application Type: Renew Iqama .\nOn the next screen, you need to enter the following details;\n- Transaction Type: Payment .\n- Iqama ID: Iqama number .\n- Iqama fee Duration: 3, 6, 9, or 12 months .\nIf the expat employee’s name and the fee amount are correct, click on the “ confirm ” button to pay iqama renewal fees online.\n\nCheck Iqama Fee in Absher\nTo check if your Iqama renewal fee is paid correctly on Absher,\n- Log in to Absher: https://www.absher.sa/\n- Scroll down until you see “ Public Query Available Funds “.\n- Enter “ Iqama Number “.\n- Enter the captcha code.\nIf you find a deposit of SR 650 under “ Passport Deposit ,” the Renewal fee has been paid.\n\nFine for the late renewal of Iqama\nIf the Iqama is not renewed within 3 days of its expiry, the following penalties are applied. The employer needs to pay the Iqama renewal fee online along with the fine.\n- First Time: SR 500 fine.\n- Second Time: SR 1,000 fine.\n- Third Time: Deportation of expatriates.\n\nIntroduction\nThis article explains the procedure for paying the Iqama renewal fee online for 3, 6, 9, or 12 months and checking whether it was paid correctly. Here is the process.\n- How to renew Iqama in Saudi Arabia?\n\nIqama Fee 2025\nHere are the details of the quarterly renewal fee for the residence permit in Saudi Arabia;\n- Iqama Renewal Fee for 3 months: SR 163.\n- Renewal Fee for 6 months: SR 325.\n- Renewal Fee for 9 months: SR 488.\n- Renewal Fee for 12 months: SR 650.\n\nIqama Renewal Fee Calculator\nThe Iqama fee calculator can help you check the fee you must pay to renew your Iqama.\n- Iqama Fee 2025 with insurance and other costs: SR 10,750.\n- Payment of Dependent Fee .\n- Payment of Maktab Amal Fee.\n\nSNB or Al Ahli Bank\nTo pay the Iqama renewal fee online using SNB bank;\n- Download the Application through PlayStore or iTunes.\n- Log in to your internet banking account.\n- Click on “ Menu “\n- Select “ SADAD “.\n- Click on “ Government Payments “.\n- Biller: Residents Services .\n- Service: Renew Iqama .\n- Beneficiary: Unregistered .\n- Iqama ID: Iqama Number .\n- Iqama Duration: 3, 6, 9, or 12 months\nIf the expat employee’s name and the fee amount are correct, click on the “ Confirm ” button to pay the fee.\n\nSome Useful Calculators\nApart from the Iqama Fee calculator, we have also produced some other helpful calculators for your help.\n- End of Service Calculator.\n- Saudi Dependent Fee Calculator.\n- Maktab Amal Fee Calculator.\n- Overtime Calculator.\n- Vacation Salary Calculator.\n\nWho pays the Iqama Renewal Fee?\nAs per Article 40 (1) of the Saudi Labor Law, the employer must pay for the residence permit renewal fee or Maktab Amal Fee.", "Introduction\nIn order to change the Iqama profession in Saudi Arabia, you need to pay SR 1,000 as its fee through SADAD.\n- How to change Iqama profession?\n\nRajhi Bank\nIn order to pay the fee to change Iqama profession through Al Rajhi Bank;\n- Download the Application through PlayStore or iTunes .\n- Log in to your internet banking account.\n- Select the “ Payments ” option.\n- Press the “ Government Payment ” button.\n- Click on the “ Alien Control “.\n- Application Type: C hange of Occupation .\nOn the next page select the following;\n- Transaction Type: Payment .\n- Iqama ID: Iqama Number .\nThe system will fetch the Iqama holder details and show you the amount of SR 1,000 to pay for the change of occupation. You can check available funds on Absher after making the payment.\n\nSNB Bank – Al Ahli Bank\nIn order to pay iqama profession change fee in Saudi Arabia through SNB or Al Ahli Bank;\n- Download the Application through PlayStore or iTunes.\n- Log in to your internet banking account.\n- Click on “ Menu “\n- Select “ SADAD “.\n- Click on “ Government Payments “.\n- Biller: Alien Control .\n- Service: Change of Occupation .\n- Beneficiary: Unregistered .\n- Iqama ID: Iqama Number .\nOn the next page, you would be able to pay the fee to change the Iqama occupation. You can check available funds on Absher after making the payment.", "1. Local broker scaling to regional reach\nA domestic broker wants to serve clients across GCC and North Africa. They need Arabic and English interfaces, local payment rails and compliance with several regulators. A regional specialist knows the licensing paths, onboarding expectations and reporting formats. This compresses setup time and cuts rework.\n\n1. Market connectivity and asset coverage\nAsk which exchanges, ECNs and liquidity providers they already connect to. Check whether they have experience with FX, equities, derivatives, commodities or crypto, depending on your strategy. Request details about:\n- Supported protocols, such as FIX and proprietary APIs.\n- Latency between client order and market venue.\n- Failover mechanisms between data centers.\nThese details affect execution quality and client trust.\n\n2. Bank upgrading its dealing room\nA bank wants to replace a legacy dealing system for FX and money markets. They must keep existing risk limits and reports while modernizing the front end. A MENA partner can map current flows, rebuild only the weak parts and preserve what already works. That reduces disruption for traders and operations.\n\n2. Regulation and compliance expertise\nMENA regulators pay close attention to investor protection, AML and market abuse. Your platform must reflect this from day one.\nLook for:\n- Built-in KYC and AML workflows.\n- Audit trails for orders, quotes and user actions.\n- Configurable limits by client, instrument, and desk.\n- Reporting formats aligned with local regulators.\nAsk for concrete examples of audits or regulatory reviews their systems have passed.\n\n3. Prop desk or family office going systematic\nA family office wants to run systematic strategies across multiple venues. They need reliable data, custom risk rules and back-testing. A trading software specialist can deliver a research and execution stack that fits the team’s processes. This gives them more control over algorithms, data and cost.\n\n3. Risk and treasury functions\nTrading risk is not only about VaR reports. It shows up in limit breaches, margin calls and liquidity gaps.\nA serious trading software partner in MENA should support:\n- Real-time exposure dashboards by client, symbol and book.\n- Margin calculation engines with scenario testing.\n- Collateral management and cash management views.\n- Stress testing for price shocks and gaps.\nAsk to see live or demo dashboards, not just slideware.\n\n4. User experience for different personas\nRetail traders, wealthy clients and dealers use the platform in different ways. Each group needs a focused interface.\nCheck whether the company can design:\n- Simple flows for onboarding and first trade for retail clients.\n- Portfolio and performance views for wealth customers.\n- High-density dealing screens for internal desks.\nAsk about UX research methods, not only about front-end frameworks.\n\n5. Security and operations\nTrading systems are constant targets. Security must be embedded, not added at the end.\nDiscuss:\n- Authentication methods and session handling.\n- Encryption at rest and in transit.\n- Separation of environments and access policies.\n- Monitoring, alerting and incident response.\nAsk how they handle security testing and what third-party audits, if any, they have passed.\n\nCore capabilities you should demand\nWhen you talk to any trading software development company in MENA , probe for specific capabilities. Do not settle for generic claims about quality or speed.\n\nFinal checklist before you pick your partner\nBefore you sign with any trading software development company in MENA , confirm five things.\n- They understand your business model better than your slide deck does.\n- They show you real systems and metrics, not only mock-ups.\n- They explain risks and constraints clearly, even when that hurts the sales pitch.\n- Their references confirm how they behave under pressure.\n- The governance model makes it easy to add features, markets and products over time.\nIf these boxes are ticked, you are much closer to a trading platform that wins clients rather than just keeping the lights on.\n\nHow a strong MENA trading tech partner runs projects\nProcess matters as much as code. Here is a typical delivery flow for a trading software development company in MENA that knows its craft.\n- Discovery and product shape They interview business, trading, risk and operations teams. They map order flows, client journeys and compliance constraints.\n- Architecture and backlog They propose a modular architecture with clear boundaries between trading core, risk, back office and channels. They produce a prioritized backlog that reflects regulatory deadlines and go-to-market goals.\n- MVP build They deliver a minimal version with a narrow asset set and a few critical flows. You get something real to test with internal users or a pilot client group.\n- Integration and migration They connect to your core banking, CRM, payment partners and reporting systems. They plan data migration from legacy platforms, including positions and client data.\n- Testing and go-live They run functional, performance and security tests. They stage parallel runs where old and new platforms operate together for a period.\n- Run, support and roadmap They provide a clear support model and release schedule. They plan how to expand assets, geographies or client segments over time.\nAsk each candidate to describe this flow using one of their projects. Look for concrete timelines, risks and lessons learned.\n\nHow to shortlist a trading software development company in MENA\nUse a simple, practical checklist. Score each vendor and compare.\n- Domain proof\n- At least three live trading or brokerage platforms in production.\n- References who can talk about outages and stress periods, not only about launch day.\n- Regulatory track record\n- Experience with your target regulators or similar ones.\n- Examples of inspections, audits or incident investigations they have passed with their clients.\n- Technical depth\n- Clear architecture diagrams and technology choices.\n- Evidence of performance and security testing, not just promises.\n- Delivery approach\n- Transparent project plan, including risks and dependencies.\n- Regular demos and access to the actual team, not only to sales.\n- Post-go-live support\n- SLAs that match your trading hours and time zones.\n- Clear process for hotfixes, releases and change requests.\nIf a vendor cannot answer concrete questions on these points, move on.\n\nIntroduction\nThinking about launching or upgrading a trading platform in MENA. Wondering whether to work with a global vendor or a trading software development company in MENA . The stakes are high, and so is the upside.\nFintech revenues in the Middle East, North Africa and Pakistan are projected to more than double between 2022 and 2025. Analysts expect the MENA fintech market to reach around USD 2.6 billion by 2030, with steady annual growth close to 10 percent. At the same time, MENA’s private sector still underperforms its potential, so firms that move fast on digital trading stand out.\nIn this landscape, the right trading software development company in MENA can decide who leads and who follows.\n\nKey metrics to watch during and after delivery\nTechnology is only useful if it moves your numbers. Define metrics together with your trading software development company in MENA .\nExamples:\n- Time from client registration to first funded trade.\n- Daily active traders vs total accounts.\n- Order rejection rate by reason code.\n- Average and worst-case latency.\n- Incident count and mean time to recovery.\n- Revenue share from new products launched on the platform.\nThese figures show whether the platform supports your business model or slows it down.\n\nMarket options: global vendor vs generic IT vs MENA specialist\nYou have three broad choices. You can buy a global off-the-shelf platform. You can hire a generic IT firm. Or you can work with a specialist trading software development company in MENA .\nHere is a quick comparison.\n\nPricing models and cost drivers\nTrading platforms can be expensive, but the cost structure can stay clear.\n\nScenarios where a MENA-based trading tech partner shines\nA trading software development company in MENA often adds the most value in complex or regional cases.\n\nTable 1. Options for trading technology in MENA\nThis does not mean global platforms never fit. They can work well for very standard brokerage models. But if your value proposition depends on region-specific products or flows, a local specialist often gives you more control.\n\nTable 2. Common pricing structures\nMain cost drivers include:\n- Number of asset classes and venues.\n- Amount of custom functionality vs reuse.\n- Integration complexity with your existing systems.\n- Non-functional requirements like latency, uptime and security certifications.\nAsk each vendor to show a sample cost breakdown from a project similar to yours, with sensitive data removed.\n\nUsing external data and insights\nTrading platforms in MENA do not operate in a vacuum. They sit on top of global markets and local economies. You and your technology partner should track credible sources:\n- IMF and World Bank reports for macro trends and financial sector reforms.\n- BIS statistics for FX and derivatives turnover, which influence liquidity needs and risk models.\n- Fintech-specific studies that quantify growth and client behavior in the region.\nUse this data when you define your product roadmap and risk appetite. Your platform should reflect the real world, not assumptions.\n\nWhat a trading software development company in MENA actually does\nA genuine trading software development company in MENA is not just an IT outsourcing vendor. It combines engineering skills with capital markets know-how.\nTypical work includes:\n- Multi-asset trading platforms for web and mobile.\n- Order management systems (OMS) and execution management systems (EMS).\n- Connectivity to local and global exchanges, liquidity providers and market data feeds.\n- Risk engines for margin, exposure and limits.\n- Back-office modules for settlements, fees and reporting.\n- Client portals for onboarding, KYC, and account management.\n- Integrations with core banking, payment gateways and CRM systems.\nEach of these blocks affects spreads, slippage, client satisfaction and regulatory exposure. That is why a generic software vendor often struggles here.\n\nWhy trading tech in MENA matters right now\nMENA has a young, digital-native population with high smartphone and internet penetration. These users expect mobile-first trading, instant onboarding and real-time market data.\nAt the same time, global FX and derivatives volumes keep hitting new records. That creates more cross-border flows, more hedging needs and more pressure on local brokers and banks to upgrade their systems.\nRegulators in the region are also building frameworks for fintech and digital finance. Sandbox programs, new licenses and clearer rules make it easier to launch new trading products, but they also raise the bar for compliance.\nThis mix of demand, regulation and competition makes the choice of technology partner a strategic decision.", "Approve through Absher\nIn order to approve the request for the transfer of Iqama sponsorship, a domestic worker needs to;\n- Log in to Absher account https://www.absher.sa/\n- Click on “ Services ” under My Services .\n- Select “ Passports “.\n- Choose “ Sponsorship Transfer Acceptance “.\nOn the next page,\n- Click on the “ View Sponsorship Transfer Requests “.\n- Review the request and “ Accept ” or “ Reject ” it.\n- The request must be approved within 7 days to avoid auto-rejection\n\nDomestic Worker Iqama Transfer to Business\nThe transfer of sponsorship of a domestic worker from an individual to an establishment has been banned.\nThe transfer of sponsorship from establishments or companies to Individuals is still banned.\nError Message: Labor Service cannot be transferred from an establishment to an individual electronically through Absher.\nThe government of Saudi Arabia had allowed the transfer of sponsorship of a domestic worker to an establishment or company in 2020 after 7 years if the following two conditions are met. However, later the decision was reversed.\n- His Iqama was renewed for not more than one year last time.\n- He will have to change his profession.\n\nIntroduction\nIt is illegal to hire a domestic worker such as a house driver in Saudi Arabia without Iqama transfer to your name. There are two ways to legally hire a domestic worker in Saudi Arabia.\n- Apply for a domestic worker visa.\n- Transfer the Sponsorship of a domestic worker.\n\nIqama transfer without employer’s permission\nArticle 2 of Labor Law Regulations allows Iqama transfer of a domestic worker without his employer’s approval under the following circumstances.\n1- Delay in salaries for 3 months.\n2- Not issuing first Iqama within 90 days of arrival.\n3- Not renewing Iqama within 30 days of its expiry.\n4- Not picking up the domestic worker from the airport or shelter house within 15 days of arrival.\n5- Assigning an employee to work for someone else.\n6- Assigning a domestic worker to a dangerous job in violation of Health and Safety standards.\n7- Abusing a domestic worker.\n8- Setting a domestic worker under Huroob incorrectly.\n9- In case of legal dispute, if the employer does not appear in court 2 consecutive times.\n10- Termination of contract by the employer within the probation period.\n- Source: Saudi Gazette\nIn the first 3 cases, the Iqama transfer would be automatic. In the rest of the cases, the employee needs to get court approval for Iqama transfer without the employer’s consent.\n\nMinimum Salary Requirement\nOne Saudi family is entitled to 5 domestic workers while expatriate families and Saudis married to expatriates are allowed to have 2 domestic workers.\n- 1st Domestic Worker: Minimum salary SR 5,000 and bank balance SR 35,000.\n- 2nd Domestic Worker: Minimum salary SR 18,000 and bank balance SR 120,000.\n- 3rd & 4th Domestic Worker: Minimum salary SR 30,000 and bank balance SR 250,000.\n- 5th Domestic Worker: Minimum bank balance SR 500,000.\nSource: Arab News\n\nRequest through Absher\nIn order to transfer a domestic worker’s sponsorship in Saudi Arabia, the following process is followed through Absher;\n- The new employer will create a request to transfer.\n- The employee will approve the request through Absher.\n- The old employer will accept the request.\n- Upon acceptance, the new employer will pay the fee .\n- The new employer will visit Jawazat to get the print of the Iqama.\n\nRequirements for Domestic Worker Iqama Transfer\nThe following requirements must be met to transfer the Iqama sponsorship of a domestic worker such as a house driver or housemaid.\n- The suitable profession of the new Kafeel (if expat).\n- The applicant must be married to transfer the sponsorship of a housemaid.\n- Minimum Salary Requirement (explained below.)\n- The domestic worker Iqama must be transferable.\n- Iqama Transfer Fee. Recommended: How to pay Iqama transfer fee?\nIf a house driver, housemaid, or any other domestic worker meets any of the 10 conditions, they can transfer their sponsorship without the consent of their Kafeel .", "Introduction\nToday I am going to share with you the Iqama form. The Iqama form is used for any of the following 6 purposes. You can either print and fill the form yourself in Arabic or hire an agent sitting outside the Jawazat office to do it for you.\n- Apply for First Iqama of Dependents in Saudi Arabia.\n- Apply for Exit Re-Entry Visa for your Dependents (Manually)\n- Apply for Iqama of Newly Born Baby – Born inside Saudi Arabia\n- Apply for Iqama of Newly Born Child – Born outside Saudi Arabia\n- Naqal Maloomat of Passport.\n- Replacement of a lost Iqama .\nDownload: You can download the PDF copy of the Iqama form from here.\nHere is the guideline to fill out the form. You can fill out the form yourself.", "Change name on the birth certificate\nIn order to change the name on the birth certificate before the issuance of Iqama in Saudi Arabia, follow this procedure;\n1 – Contact the hospital where your child was born and fill a form to change the name on the Birth Notification issued by the Ministry of Health.\n2 – Once the new notification is received, take an appointment with the Ahwal Madani .\n3 – Download the Amend, delete, add, correct form from the MOI website and fill it.\n4 – Visit the Ahwal Madani office on the date of the appointment and the officer will change the name on the birth certificate.\n5 – Make sure to read the name on the birth certificate, if there is a spelling mistake in it, you can visit the manager’s office immediately to change the name.\n\nDo you really need it?\nYou are required to change the name on the birth certificate only for the issuance of the first Iqama for your children. Once the first Iqama is issued, there is no need to change the birth certificate as there is a different procedure for that. Recommended: How to change the name on Iqama?\n\nIntroduction\nThe name on your child’s Iqama, Birth Certificate, and Birth Notification would be exactly the same. Here is the procedure to change the name on the birth certificate in Saudi Arabia.", "Appointment\nAlthough the Pakistan Embassy and the Pakistan consulate are not too busy these days so there is no need for an appointment, still you can take it to save your time;\n- Appointment with Pakistan Embassy Riyadh\n- Appointment with Pakistan consulate in Jeddah\n- Pakistan Consulate Jeddah Phone Number: 0126692371\n- Pakistan Embassy Riyadh Phone Number: 0114884111\n- You can apply for the passport from 8 am till 3 pm.\n\nIntroduction\nIn order to get the Pakistani passport for a newborn baby in Saudi Arabia, you need to follow a lengthy procedure which is explained below.\n\nOrdinary Passport fee.\nThe ordinary passport is generally received in 30 days.\n- 5 Years passport with 36 pages – SR 86.\n- 5 Years passport with 72 pages – SR 158.\n- 5 Years passport with 100 pages – SR 172.\n\nPakistani passport fees for newborn baby\nThe fee to apply for a Pakistani passport for a newborn baby in Saudi Arabia is the following. Be noted that they will only issue a passport for a maximum period of 5 years.\n\nPassport Collection\nOne of the parents of the newborn baby can visit the Pakistani Embassy/consulate on or after the date mentioned on the receipt to collect the passport in Saudi Arabia.\n- Follow the grey line to reach the passport collection office.\n- Passport Collection Time: 8 am to 3 pm.\n\nRequired Documents\nThe following documents are required to apply for a Pakistani passport for a newborn baby in Saudi Arabia.\n- Birth Certificate attested by the MOFA.\n- Birth Certificate translation attested by the Pakistan Embassy .\n- National Identity Card (NICOP) the newborn issued by NADRA.\n- Original NICOP of Parents + copies.\n- Copies of parents’ passports.\n- Copies of parents’ Iqama.\n\nUrgent Passport fee.\nThe urgent passport is generally received in 15 days.\n- 5 Years passport with 36 pages – SR 143.\n- 5 Years passport with 72 pages – SR 257.\n- 5 Years passport with 100 pages – SR 343.\n\nVisit Riyadh Embassy or Jeddah Consulate\nMake sure one of the parents is at the location at the appointment time.\n- Map Location of Pakistan Embassy in Riyadh\n- Map Location of Pakistan Consulate in Jeddah\nPay the fee on the first counter to apply for a Pakistani passport for a newborn baby in Saudi Arabia and then follow the red line on the floor;\n- Take photograph.\n- Help the officer to fill the Pakistani passport form.\n- Review the form.\n- Submit to the designated officer.\nThe officer might ask you a few questions about you or your spouse such as what do you do, where do your in-laws live in Pakistan. After this, they will stamp the receipt.\nYou can go to another counter with this receipt and pay some fee to book Aramex to deliver your passport to your home.", "Introduction\nExpats can get baby vaccination for free in Saudi Arabia by booking an appointment through Sehaty application. Here is the entire process;\n\nStep 01: Downlaod Sehaty App\nIn order to get an appointment for baby vaccination in Saudi Arabia, first of all you need to install Sehaty application;\n- Download Sehaty App from PlayStore or iTunes .\n- Register your account.\n- Log in to the Application.\n\nStep 02: Get appointment for baby vaccination\nNow you need to select the following to book a baby vaccination in Saudi Arabai through Sehaty App;\n- Click on “ Family Members “.\n- Select the name of your child .\n- Click on the “ Vaccines ” option.\n- Select the “ Children ” tab.\n- Click on the “ Book Appointment “.\nOn the next page, you need to select the following;\n- Immediate Consultation: Child Vaccines .\n- Service: Well Baby and Vaccination Clinic .\n- Facilities: Select the nearest center .\nOn the next page, select the following;\n- Choose Doctor: Click on “ Skip this step “.\n- Select the date and time of the vaccination.\n- Review the details and click on the “ Confirm Booking “.\nThat’s it, you have successfully booked the appointment for baby vaccination in Saudi Arabia.\n\nStep 03: Visit the Vaccination Center\nYou need to visit the health center at the time of the appointment along with the following;\n- Iqama or Birth Certificate of the child.\n- Print of the Saudi National Address or electronic ejar contract .\n- Saudi Vaccination Card for the child.\n\nStep 04: Download the vaccination Card\nIf your child has completed the vaccination, you can download the vaccination card online through the Sehaty App. In order to download it;\n- Log in to the Application.\n- Click on “ Family Members “.\n- Select the name of your child .\n- Click on the “ Vaccines ” option.\n- Select the “ Children ” tab.\nOn this page you can see the entire history of vaccination of your child with the details of the date and the type of vaccination taken.\n- Click on the “ Donwload Report “ button.\n- You can save the vaccination card for future use.", "Apply for the Passport\nYou can apply for the Passport of a newly born child with the Pakistan Embassy after 3,4 days of applying for the NICOP through the manual process.\nIf you have applied for it online, call the NADRA helpline after seven days to get the NICOP number of the baby and proceed with the passport process.\n\nCollection of NICOP\nYou are done applying for the NICOP of a newborn baby in Saudi Arabia. You must visit them on the date mentioned on your token to collect the NICOP.\n- NICOP Collection Time: 8 am to 3 pm.\n\nDelivery of NICOP\n- After approx 5 to 7 days, your application status will change.\n- NICOP will be delivered to your home address in Pak or can also be requested to be delivered to KSA (With some extra cost)\n\nIntroduction\nTo get a Pakistani passport for the newborn baby, you must apply/renew the NICOP online or manually through NADRA, Saudi Arabia.\n- NICOP stands for National Identity Card for Overseas Pakistanis.\n\nNADRA Appointment\nAlthough NADRA offices are not too crowded these days, still you should consider taking a NADRA appointment to apply for the NICOP of a newborn.\n\nOnline NICOP Procedure\nTo apply for the NICOP for the newborn baby online;\n- Create your ID on https://id.nadra.gov.pk/e-id/welcome\n- Select NICOP and provide answers to the required questions.\n- Upload all the required documents (listed above).\n- References can be your mother, father, or other relatives/friends.\n- Submit your application.\n- Pay the fee for the NICOP through a credit card.\n\nPakistani ID card fee in Saudi Arabia\nThe fee for a new Pakistani ID Card (NICOP) in Saudi Arabia is;\n- SR 150 for Urgent NICOP – delivered in 30 days.\n- SR 182 for Executive NICOP – delivered in 15 days.\n\nRequired Documents for NICOP for a newborn\n- Original Birth Certificate of Newborn .\n- Birth Certificate translation attested by the Pakistan Embassy.\n- Original Passport of Parents along with Photocopies.\n- Original NICOP of parents along with Photocopies.\n- Iqama copies of parents.\n- Newborn baby picture (if applying online).\n\nVisit NADRA Office\nVisit the NADRA office at your appointment, along with the above-mentioned documents.\n- NADRA Jeddah Location: https://goo.gl/maps/zJgWHzkC8FbLXPxM7\n- NADRA Office Time: 8 am to 3 pm.\n- One of the parents should be accompanied by the newborn.\nStep-by-step procedure;\n- Pay the fee for the NICOP of the newborn baby in Saudi Arabia.\n- The second window will take the picture of the newborn.\n- You don’t need to visit the Biometrics window, as biometrics is unnecessary for children below 15.\n- After the picture, you will have to visit the Data Entry Window. After entering the details, they will print a form for you and ask you to sign it.\n- Submit copies of the required documents and the signed form to them.\n- They will prepare a file and ask you to visit a designated officer. The officer might ask you a few questions and then sign the form.", "Ahwal Madani Map Locations\nWe have given the map location of Ahwal Madani offices in Riyadh, Jeddah, Dammam, Khobar, and Makkah below.\n- Riyadh: https://goo.gl/maps/6FqtYXoJoCvqo42d7\n- Jeddah: https://goo.gl/maps/MLsEh1CFxeU5uR888\n- Dammam: https://goo.gl/maps/uhgaCMB3V9uruAWF6\n- Khobar: https://goo.gl/maps/3dPrxuFmzHB41xSA7\n- Makkah: https://goo.gl/maps/zZ5YvHJGwXQbkFQK8\n\nApply for a Birth Certificate online\nYou can apply for the birth certificate of the newborn online through Absher if;\n- National Address Registration .\n- The baby is less than 1 year old.\n- Birth notification SMS from the MOI is issued.\n- SR 50 late fee if applied after 30 days of the birth.\nIn order to apply for a birth certificate online;\n- Login to your Absher account.\n- Click on “ My Services “.\n- Select “ Civil Affairs “.\n- Click on “ New Born Registration “.\n- Check the spellings of the name/DOB are correct. Contact the hospital for correction if required.\nUpon successful registration;\n- The system will automatically generate an Iqama number.\n- Send an SMS to your activated mobile number.\n- Select a postal delivery service to receive the birth certificate at your home.\nIn case you do not want to wait for the delivery;\n- Take Ahwal Madani Appointment .\n- Visit them with Father and Mother Iqama.\n- Get the print immediately.\n\nBirth Notification from the Hospital\nThe first step to getting a Birth Certificate from Ahwal Madani in Saudi Arabia is to;\n- Apply for the baby’s birth notification from the hospital where the baby is born.\n- The hospital will send the document to the Ministry of Health for registration.\n- It might take 2 weeks to get the SMS from the MOI.\n- List of 51 names banned in Saudi Arabia\n\nGet the Iqama for the Newborn\nAfter getting the birth certificate from Ahwal Madani, you need to follow these steps to get the Iqama for the newborn.\n- The next step is to get the Birth Certificate attested by the Ministry of Foreign Affairs.\n- After this, apply for the passport of the newborn baby through the embassy or consulate of your country.\n- Once the passport is issued, you can get the Iqama for the newborn baby.\nGod forbids if you lose the birth certificate for any of your children, you need to report it through your Absher account. Recommended: How to report a lost Birth Certificate?\n\nIntroduction\nIn order to get an Iqama for your newborn child born in Saudi Arabia, an expat need to first take the Birth Certificate from Ahwal Madani.\n\nMother is on a Family Visit Visa\nIf a child is born in Saudi Arabia while his mother is on a family visit visa, you need to follow the same procedure as mentioned above until you get your newborn baby’s passport.\n15 days before leaving Saudi Arabia, visit the إدارة شؤون الوافدين section in Jawazat along with the following documents to get the exit stamp on the child’s passport.\n- Original Passport of baby + Copy\n- Original Iqama of baby’s father+ Copy\n- Original Passport of baby’s father+ Copy\n- Original Passport of baby’s mother+ Copy\n- A copy of the Saudi visa stamped on the mother’s passport.\n- Marriage Certificate + Arabic translation.\n- Baby’s Birth Notification SMS sent by the MOI.\nFather is not a Saudi Resident\nIf a child is born in Saudi Arabia while the mother is on a family visit visa and the father does not have a Saudi Iqama, you need the following documents in addition to the documents mentioned above to get a birth certificate from the Ahwal Madani in Saudi Arabia.\n- Attested marriage certificate along with Arabic translation (from home country Home Ministry, Saudi Embassy and Ministry of Foreign Affairs)\n- Power of Attorney from Father of the child authorizing and permitting any person (preferably close relatives) for applying for the birth certificate, collecting it, signing documents and do related legal procedures\nThe Power of Attorney must be issued by the home country court, attested by the Saudi Embassy in the home country and Ministry of Foreign Affairs in Saudi Arabia.\n\nPrint Birth Certificate from Absher\nAfter the birth certificate is issued by Ahwal Madani, you can print it from your Absher account. To do it;\n- Login to your Absher account.\n- Click on “ My Services “.\n- Select “ Civil Affairs “.\n- Click on “ Birth Certificate Services “.\nRemember that you can print the birth certificate only after it is issued by Ahwal Madani following the abovementioned process. On the next page;\n- Click on “ View Birth Certificate “.\n- Select the Dependent.\n- Absher will show you the birth certificate to print.\n\nVerify Birth Certificate\nIn case you want to check if the birth certificate is original or fake, you can verify it on Absher through this link;\n- Open the Birth Certificate Verification link.\n- Enter the Birth Certificate Number.\n- Write the Iqama Number.\n- Enter the Date of Birth.\n- Write the Image code.\nRequired Documents\nIf your online application is not successful, prepare the file of the following documents before you visit Ahwal Madani to get your baby’s governmental birth certificate in Saudi Arabia.\n- Ahwal Madani Appointment .\n- Birth notification SMS from the MOI.\n- Iqama copy of the baby’s father.\n- Iqama copy of the baby’s mother.\n- Passport copy of the baby’s father.\n- Passport copy of the baby’s mother.\n- SR 50 late fee if applying after 30 days of the birth.\n- Marriage Certificate + Arabic translation if the wife is not a dependent of the husband or if she is on a family visit visa.\n- Filled form 87 for Birth Certificate .\n- A copy of the Saudi visa stamped on the mother’s passport (in case the mother does not have an Iqama).\n- A screenshot of the wife’s details from Absher (in case the wife is on a family visit visa).\n\nVisit Ahwal Madani\nIn order to take the birth certificate in Saudi Arabia, try to reach the Ahwal Madani office at least 20 minutes before your appointment.\n- You will take a token and wait for your turn.\n- Submit all the documents to the respective counter and wait for the birth certificate to be printed.\n- A Text message will be sent on your mobile from Ahwal Madani confirming the issuance of a Birth Certificate in Saudi Arabia.\n- Now you can check the list of your dependents in the Absher account. The newborn has been added to the list and an Iqama number has been issued for him.\n- If the name on the birth certificate is incorrect, you need to immediately raise the issue and he will ask you to go to the manager to rectify it.", "Ahwal Madani appointment through Absher\nIn order to get a civil affairs appointment;\n- Log in to your Absher account https://www.absher.sa/\n- Scroll down and click on the “ Appointments ” button.\n- Select the “ Civil Affairs ” option.\n- Click on the “ Proceed to Service ” button.\nOn the new page;\n- Click on the “ Book New Appointment ” button.\n- Services: تسجيل واقعة ميلاد\n- Select the Region.\n- Select the Branch of the region.\nYou can book an Ahwal Madani appointment in any city within the region where your child is born.\nOn the next screen s elect the date for the civil affairs appointment.\nOn the last screen, the system will confirm the appointment and list down the documents that you are required to bring to their office.\n- Print the Appointment paper.\n- How to get Birth Certificate in Saudi Arabia?\nThere is a Late Birth Registration Fee of SR 50 if you are going to the Ahwal Madani or Civil Affairs office after one month of your child’s birth. Make sure you pay the Late Birth Registration Fee onlin e.\n\nIntroduction\nIn order to get an iqama for your newborn child in Saudi Arabia, first you need to get an Ahwal Madani appointment for the birth certificate. Here is the procedure.", "After One Year\nAfter spending one year in Saudi Arabia, an employee can transfer Iqama sponsorship without the approval of the employer.\n\nCheck if Iqama is transferable or not.\nTo keep it simple, almost all Iqamas are transferrable if your employer is willing to transfer your sponsorship.\nSome companies and organizations do not prefer to release their employees who want to change jobs. However, the Ministry of Labor has taken this power from them. Now they cannot stop an employee from leaving the company if he has spent more than one year in Saudi Arabia.\n\nDoes it lead to legal complications?\nIt is important to note that having a transferable Iqama does not mean that you are immune from contract violations.\nIf you leave an employee without completing your contract , the employer cannot stop you in the Qiwa system, but he is entitled to apply Article 77 as per Saudi Labor Law .\nIf your contract prohibits you from working for a competitor for a certain period of time and you violate this clause, the employer can sue you in labor court.\n\nExpired Documents\nIf the Iqama or work permit has expired , the employee can transfer without the approval of the current employer.\n\nIntroduction\nWe often hear that an employee with transferable Iqama has the right to transfer his sponsorship. What is a transferable Iqama, and how can we check it?\n\nMissing Documentation\nIf an employer is unable to issue a work permit for an employee within 90 days of arrival in Saudi Arabia, the employee can transfer his sponsorship without the employer’s approval even within the first year.\n\nWhat is transferable Iqama?\nA transferable Iqama means that the resident can change his job without leaving Saudi Arabia by transferring sponsorship . As per the new rules, an employee’s iqama becomes transferable in the following cases;\n\nWithin One Year\nIf you want to transfer within the first year of arrival in Saudi Arabia, the current employer’s approval is required . If the employer is unwilling to do so, your Iqama is not transferable.", "Al Rajhi Bank\nIn order to pay the sponsorship transfer fee through Al Rajhi Bank;\n- Download the Application through PlayStore or iTunes .\n- Log in to your internet banking account.\n- Select the “ Payments ” option.\n- Press the “ Government Payment ” button.\n- Click on the “ Alien Control “.\n- Select “ Transfer of Services ” from the options.\nOn the next page select the following;\n- Transaction Type: Payment .\n- Iqama ID: Iqama Number .\nThe system will fetch the Iqama holder details and show you the amount to pay for the Iqama transfer. You can check available funds on Absher after making the payment.\n\nFee for Transfer of Sponsorship\nThe fee for the transfer of Iqama sponsorship increases with every نقل كفاله. The fee for the;\n- the 1st transfer is SR 2,000 .\n- the 2nd transfer is SR 4,000 .\n- the 3rd transfer onwards is SR 6,000 .\n\nIntroduction\nIn order to complete the process to transfer sponsorship, you need to pay the Iqama transfer fee in Saudi Arabia.\n- How to transfer employees through Qiwa?\n\nIqama transfer fee for dependents\nIn case you want to pay the fee for the transfer of sponsorship of a dependent who is currently under your sponsorship, there are 3 options available.\n- Transfer dependent to be the Head of Household.\n- Transfer Head of household to be dependent.\n- Transfer dependent on a new head of household.\n\nPay the Iqama transfer fee\nIn order to pay the Iqama transfer fee, we have used the internet banking account of Al Rajhi bank and SNB Al Ahli bank.\n\nSNB Al Ahli bank\nIn order to pay the sponsorship transfer fee through SNB Al Ahli Bank;\n- Download the SNB Bank application from Playstore or iTunes .\n- Log in to your account.\n- Click on the “ Menu “.\n- Select SADAD .\n- Click on Government Payments .\n- Biller: Alien Control .\n- Service: Transfer of Services .\n- Select Unregistered .\n- Iqama ID: Iqama Number .\nOn the next page, the SNB system will show you the fee to pay. Click on the “ confirm ” button to pay the fee.\n\nWho is responsible to pay for it?\nIn Saudi Arabia companies generally pay only SR 2,000 for the transfer of Iqama sponsorship and ask employees to pay the rest of the amount. For example, in the case of a third transfer, the employer pays SR 2,000 and the employee pays SR 4,000 himself.\nHowever, a ccording to Article 40 (3) of the Saudi Labor Law, the Iqama transfer is the responsibility of the employer to whom an employee is transferring in.\nFor example, if you are getting transferred from Kafeel A to Kafeel B,  full Iqama transfer fee will be paid by Kafeel B.", "Check Driving License Medical Report\nTo renew or get a new driving license in Saudi Arabia, you need to pass a driving license medical test .\nUnfortunately, there is no online platform to check the result of the Efada medical report for a driving license.\nHowever, once you pass the eye and blood tests, the staff updates your Efada medical report to the Absher system. You will receive an SMS from seha.sa once they update it to the Absher system.\n\nCheck Medical Report – Efada\nYou can check the status of the medical test report for Saudi Iqama online through the Efada and MOH websites. To do it;\n- Open: https://www.efada.com.sa/EMC\n- Inquiry Type: Certificate results .\n- Enter the Border Number .\n- Enter the Phone number provided at the time of taking samples.\nOnce you enter these details, the system will present the report in the following format.\n- Status Approved means Passed .\n\nCheck Medical Report – MOH\nThe second way to check the status of the medical test report for Saudi Iqama online is through the Ministry of Health website.\n- Open: https://www.moh.gov.sa/EfadaService.aspx\n- Enter the Border Number .\n- Enter the Sponsor ID number.\n- Type: Iqama Issuance.\nClick on “search” to check the status. It is essential to mention here that the MOH system in Saudi Arabia is also integrated with Efada; therefore, you will find the same result here.\n- Result is not found : لم يتم إرسال نتيجة فحص العمالة للجوازات حتى الأن\n\nGet the medical test for Saudi Iqama\nTo get the medical test done for a new Saudi Iqama,\n- Find the nearest approved medical center .\n- Present your passport at reception.\n- Present a copy of the Saudi visa.\n- Pay a SR 200 fee for the medical test.\n- The laboratory will take a blood test.\n- You would be required to provide the stool test, too.\nThe test includes an HIV/AIDS test, TB Xray, eyesight, and hearing test, a test for cholera (a charming stool sample test). Since it is a stool test, you must be ready for this.\n\nIntroduction\nAfter coming to Saudi Arabia permanently, you must undergo a medical test to get your new Iqama issued. Here is how to check the result of the medical report online at efada.com.sa.emc and on the MOH platform in KSA.\n- How to get a new Iqama in Saudi Arabia?", "Introduction\nMr. Zuhaib Ali who works in HR department of a reputed company in Saudi Arabia has shared with us the following list of professions of Saudi Arabia. The source of the list is the system of Ministry of Labor as Zuhaib has taken this from the website of Ministry of Labor. I have noticed that many people face problems at the time of deciding correct profession for them. Well, now your problem is resolved as you have a comprehensive and complete list of professions in Saudi Arabia. You can select profession as per your requirement and give government relations officer of your company the Arabic name, English name and even the code number of the profession. I am very thankful to Mr. Zuhaib Ali for sharing this useful file with us.[irp]\nList of Professions eligible for Family Visas in Saudi Arabia\nList of Professions reserved for Saudis\nList of all Iqama Professions in Saudi Arabia", "Assembling Jobs Professions\nHere is the list of all Iqama professions related to assembling jobs along with the occupation codes.\n\nConstruction Industry Profession\nHere is the list of all Iqama professions related to the construction industry, along with the occupation codes in Saudi Arabia.\n- عامل تصنيع in English means manufacturing Worker.\n- عامل انشاءات in English means Construction Worker.\n\nDiplomats and Security Profession\nPeople working in Saudi Arabia under the sponsorship of embassies, consulates, and expats working in security can have any of the professions and occupation codes given below.\n- The safety officer iqama profession is reserved for Saudis .\n\nDirectors and Managers Professions\nHere are some professions associated with management positions in companies.\n\nEducation & Training Professions\nHere is the list of all Iqama professions related to education and training, along with the occupation codes.\n\nElectrical Iqama Profession\nHere is the list of all Iqama professions related to electrical jobs, along with the occupation codes.\n\nEngineers & Accountants\nThe authorities of different professions maintain a list of Iqama professions related to their field. Therefore, you can check if your occupation falls under any of these authorities from the links below.\n- Saudi Council of Engineers profession list .\n- SCE Profession List – Technician.\n- Information Technology Professions\n- SOCPA Professional List .\n\nFarming & Agriculture Profession\nHere are some professions associated with farming and agriculture industry.\n\nFinance Related Jobs\nSome Iqama professions related to accounting, auditing, and finance-related jobs need to register with SOCPA , which is covered under the SOCPA professional list above. We have given a comprehensive list of all iqama professions related to accounting, auditing, and finance-related jobs, along with the occupation codes in Saudi Arabia.\n\nGeneral Iqama Professions\nHere is the list of some other Iqama professions that we could not group in any of the categories above.\n\nHotel Professions\nHere is the list of all Iqama professions related to hotel jobs, along with the occupation codes.\n- عامل تعبئة وتغليف in English means Packaging and Wrapping worker.\n\nIntroduction\nMany people face problems while selecting the correct Iqama profession. Therefore, we have provided a comprehensive list of all iqama professions in Saudi Arabia with occupation codes.\nYou can select a profession from the iqama profession list as per your requirement and tell the GRO of your company the Arabic name, English name, and even the occupation code of the profession .\nBefore going further, it is essential to go through the following two links to choose your iqama profession.\n- List of Professions eligible for Family Visas\n- List of Professions reserved for Saudis\n\nLabor Workers\nHere, we have a list of Iqama Professions related to Workers and Labor and the occupation codes.\n- عامل تحميل وتنزيل in English means loading and unloading worker.\n- عامل مهن فريدة in English means Special trades worker.\n- عامل تعبئة رفوف in English represents Shelf Stacker.\n\nMaintenance Professions\nHere is the list of all Iqama professions related to maintenance jobs, along with the occupation codes.\n\nMechanical Profession\nHere is the list of all Iqama professions related to mechanical jobs, along with the occupation codes.\n\nMedia Professions\nHere is the list of all Iqama professions related to Media jobs, along with the occupation codes.\n\nMedical Profession\nHere is the list of all Iqama professions related to doctors, nurses, and other medical-related jobs, along with the occupation codes.\n- Occupation code 332201 is given to مساعد صيدلي, which means Assitant Pharmacist.\n- Occupation code 311511 is given to استشاري حساسية, which means Allergy Consultant.\n\nProduction Profession\nHere is the list of all Iqama professions related to production jobs, along with the occupation codes.\n\nSales and Marketing profession\nIf you plan to pursue sales and marketing jobs, remember there is 30% Saudization on 6 Sales and Marketing Iqama professions . Here is the list of all Iqama professions under the sales and marketing categories and the occupation codes.\n\nTransport/Aviation professions\nIf you plan to pursue sales and marketing jobs, remember that 28 aviation professions are reserved for Saudis, such as;\n- 2513061 – مرشد سياحي عام – General Tourist Guide.\n- 6125024 – مضيف جوي – Air Steward.\n- سائق عموم آليات الطرق in English means Pan-road machinery driver.\n- سائق سيارة عمومي in English means Public Driver.\nHere is the list of all Iqama professions under the transportation and aviation categories and the occupation codes.", "Introduction\nAll expat accountants under the SOCPA professional list need SOCPA membership registration for the issuance and renewal of iqama. Here is the profess;\n- How to renew SOCPA membership?\n\nSOCPA Exams\nSometimes SOCPA rejects applications with a comment that the applicant has less than 15 academic hours in accounting. In such a case, you can take a bachelor’s degree in accounting from any university in the world or take SOCPA exams.\nIn order to take SOCPA exams, click on the “Exam” and then the “Registration” button. T he per-subject fee for taking a SOCPA exam is;\n- SR 1,000 for the first time.\n- SR 500 for repeating the exam.\n\nSOCPA Membership Requirements\n- Passport-size photo.\n- Scanned copy of the degree.\n- Copy of valid Iqama.\n- Transcripts/Marksheet (optional).\n- Copy of Passport.\n- SOCPA authorization letter.\n\nSOCPA Professional list\nOnly the following 44 jobs under the SOCPA professional list are required to register with SOCPA to issue/renew their Iqama.\n- 1112131 – مدير شؤون مالية ومحاسبة – Finance and Accounting Manager\n- 1217131 – مدير حسابات وميزانية – Accounts and Budget Manager\n- 1217281 – مدير إدارة التقارير المالية – Financial Reports Manager\n- 1217331 – مدير إدارة الزكاة والضرائب – Zakat and Taxes Manager\n- 1217381 – مدير إدارة المراجعة الداخلية – Internal Audit Manager\n- 1217661 – مدير الإدارة العامة للمراجعة – General Audit Manager\n- 2218191 – رئيس برامج التدقيق الداخلي – Head of Internal Audit Programs\n- 2621031 – مراقب مالي – Financial Controller\n- 2621151 – مراجع مالي أول – Senior Financial Auditor\n- 2621141 – مشرف مراجعة مالية – Financial Audit Supervisor\n- 3621141 – مشرف مراجعة مالية – Financial Audit Supervisor\n- 3621151 – مراجع مالي أول – Financial Audit Supervisor\n- 2622011 – محاسب عام – Senior Financial Auditor\n- 2622021 – محاسب تكاليف – General Accountant\n- 2622031 – مدقق حسابات – Cost Accountant\n- 2621081 – مراجع داخلي – Auditor\n- 3621012 – فني حسابات عام – Internal Auditor\n- 3621022 – فني تدقيق حسابات – General Accounting Technician\n- 3621032 – فني حسابات كلفة – Auditing Technician\n- 4211173 – كاتب تكاليف – Cost Accounting Technician\n- 4211183 – كاتب مالية – Cost Clerk\n- 4121044 – كاتب مسك الدفاتر – Financial Clerk\n- 121101 – مدير مالي – Bookkeeping Clerk\n- 121102 – مدير حسابات – Financial Manager\n- 121103 – مدير حسابات تعريفة – Accounts Manager\n- 121104 – مدير خزينة – Tariff Accounts Manager\n- 121105 – مدير ميزانية – Treasury Manager\n- 121106 – مدير مراجعة – Budget Manager\n- 121107 – مدير مراجعة داخلية – Audit Manager\n- 121113 – مدير تحصيل – Internal Audit Manager\n- 121116 – مدير خزانة – Collection Manager\n- 241102 – محاسب تكاليف – Treasury Manager\n- 241106 – مراقب مالي – Cost Accountant\n- 241103 – مراجع داخلي – Financial Controller\n- 431101 – كاتب حسابات – Internal Auditor\n- 241101 – محاسب – Accounts Clerk\n- 241107 – أخصائي موازنة مالية – Accountant\n- 241108 – أخصائي حسابات ضرائب – Financial Budget Specialist\n- 241105 – محاسب قانوني – Tax Accounts Specialist\n- 335202 – مسؤول ضرائب – Chartered Accountant\n- 331301 – مساعد حسابات – Tax Officer\n- 241109 – أخصائي مراقبة مخزون – Accounts Assistant\n- 241110 – أخصائي مستودعات – Inventory Control Specialist\n- 331302 – مراقب مخزون – Warehouse Specialist\n\nSOCPA Registration Process\nFirst of all, open the website and click on the “New User” to start the SOCPA registration process.\nOn the next screen, you will have to fill the SOCPA registration form with your name, iqama number, email address, and phone number. After filling the form;\n- Activate your account by clicking on the email.\n- Login to your SOCPA account.\nAfter the login, click on the “Membership and Professional registration” and then click on the “Membership Request” from the drop-down menu.\n\nStep 1: Membership Info\nOn this screen, you will be given information about the SOCPA registration and membership, read through this page, and click on the “Next” button.\n\nStep 2: Qualification\nAt this stage of SOCPA registration, you need to;\n- Select the qualification.\n- Enter the name of the university.\n- Select the country where the university is situated.\n- Enter the GPA or Grades.\n- Select the Iqama profession.\n\nStep 3: Attachment\nNow you need to upload all the required documents for SOCPA membership. You can download the authorization letter from the given link, sign it, and upload it again in the system.\n\nStep 4: Payment\nOn the fourth step, you need to make a payment of SR 840 which includes SR 525 subscription fee and SR 315 for the annual fee.\nYou can pay the SOCPA registration fee through debit or credit card, Mada card, or SADAD.\nOnce the fee is paid, you can click on the “Payment” and then “Paid bill” from the drop-down screen to get the invoice. You can submit the invoice to your employer and ask for reimbursement to try your luck.\n\nStep 5: Temporary Accounting Technician\nAfter the successful registration, the SOCPA will immediately issue you a temporary accounting technician certificate. You can click on the “Membership and Professional registration” and then “Dashboard” to download this certificate.\nKeep in mind that you would be able to renew your Iqama or transfer your sponsorship on the basis of this certificate.\n\nStep 6: SOCPA Associate Member\nAfter verifying your degrees uploaded at the time of registration, SOCPA will issue you an Associate Membership which means that you are a permanent member.\nIn my case, it took them around 6 months to verify my degree and convert the certification from temporary to Associate.\n\nThe degree requirement\nWhat are the degrees acceptable for SOCPA membership? Here is the list.\n- Bachelor or master’s degree in accounting.\n- Post-secondary accounting diploma.\n- SOCPA Certificate.\n- A professional certificate from an approved IFAC body including but not limited to CPA USA, ICAEW, CICA, CA ANZ, ACCA, ICAP, CMA USA, ICMA Pak.\n- Any bachelor’s degree with at least 15 academic hours in accounting. In case the academic hours are less than 15, you can register for exams as explained below.\nThe degree or certificate needs to be attested by the Saudi Embassy and the Saudi Culture of the issuing country.", "Introduction\nIn case, the online system for the transfer of sponsorship does not work, you will need three letters for the transfer sponsorship. In this article, we have given a sample request or demand letter as well as the sample letters written by the old Kafeel to Jawazat and the labor office for the transfer of sponsorship in Saudi Arabia.\n\nLetter to Jawazat\nIn the same way, the current Kafeel writes a letter to the Jawazat that he has no problem if the employee transfers his sponsorship to another sponsor. We have given a sample letter to Jawazat which needs to be stamped by the Chamber of Commerce .\n\nLetter to the Labor Office\nAfter submitting the demand or request letter to the current Kafeel, the current sponsor prepares two letters to transfer the sponsorship. The first letter duly attested by the Chamber of Commerce is addressed to the Labor office accepting the transfer.\n\nRequest / Demand letter for transfer of sponsorship\nFirst of all, the new employer writes a request or demand letter addressing the old Kafeel to transfer your sponsorship to him. This letter needs to be stamped by the Chamber of Commerce .", "Changing Iqama Name – Absher\nYou can change the name of Iqama in Arabic through Absher.\n- Log in to Absher https://www.absher.sa/ .\n- Click on the “ Family Members ” tab.\n- Select the “ Resident ID Services ” option.\nOn the next screen, select the dependent whose name you want to change in Arabic.\nClick on “ Start Service ” to change the name.\nOn the next screen;\n- Fill in the name in Arabic in the specified column. This is exactly how the name will be printed on Iqama. It should be reconciled with the English name mentioned on the passport.\n- Agree to the terms and conditions.\n- Click on the “ Next “ button.\nThat’s it. You have successfully changed the Arabic name of your dependent on the Iqama.\n- Repeat the same exercise for all your dependents.\n\nChanging Iqama Name – Jawazat\nIn the second method to change the Iqama name, the government relations officer of your company to go to the Jawazat himself with the following documents;\n- Jawazat Appointment with the option Resident Services .\n- Fill out Form 203.\n- Copy of the passport.\n- Original Iqama.\nThe Jawazat officer will correct the name and issue you a new Iqama immediately without any fee.\nOnce you have successfully changed the name of Iqama in Saudi Arabia, you must visit the traffic police station to change the name on your driving license.\n\nChanging Iqama Name – Muqeem\nMy English name on Iqama was different from my passport. I went to my company’s government relations officer and asked him for the solutions. He opened the Muqeem system in front of me and changed my name in the system instantly.\nThe GRO can do it by logging in to the Muqeem account.\n- Log in to the Muqeem: https://muqeem.sa/#/login\n- Select the “ تعديل الاسم المترجم ” from the given services.\n- Write the new name.\nAfter 2 minutes, the English name on my Absher account was changed. I got the new hard copy with the correct spelling when my iqama was renewed.\n\nIntroduction\nIf your Iqama name differs from the passport or there is a mismatch between Arabic and English names, you must change/correct it in Saudi Arabia.\n\nWhy correct the name of Iqama?\nIf the name on the Iqama is different from the name on the passport or the Arabic name on the Iqama does not match the Arabic name, it can lead to the following three problems;\n- No Bank will open your bank account.\n- The police clearance certificate will have a different name.\n- The documents issued from Saudi Arabia would not be acceptable outside KSA, e.g., birth certificates of children.", "Company Driver Iqama profession\nIf you are working for a company and the Iqama is also issued by a business establishment, you can easily change your Iqama profession to any other profession such as labor following this process.\n- How to change Iqama profession in Saudi Arabia?\n\nHouse Driver to Business Driver\nA person hoving the Iqama profession of house driver سائق خاص can change his Iqama profession to be a labor or any other business profession after changing his sponsorship to a business establishment.\nIf you read the rules related to the transfer of domestic worker sponsorship , it is near to impossible to transfer to a business establishment.\nHence, generally, it is second to impossible for house drivers سائق خاص to change Iqama profession to a business driver or labor in Saudi Arabia.\n\nHouse Driver to Domestic Worker\nIf your Iqama profession is house driver سائق خاص , it means that you are working for an individual person at his home.\nIn this case, you can easily change your Iqama profession from house driver سائق خاص to any other domestic profession such as Housecleaner or عامل منزلية . The entire process for the change would be followed by your Kafeel.\n\nIntroduction\nThe rules to change the Iqama profession are quite complicated in Saudi Arabia for domestic workers such as house drivers or سائق خاص .", "Change Photo on Iqama for Adults + Kids\nIn order to change the picture on your Iqama, follow the following process;\n\nChange Photo on Iqama for Children\nYou need to provide pictures of the baby at the time of applying for Iqama for newborns . The same pictures remain on their iqama for several years.\nHowever, according to the updated system, whenever children are traveling outside Saudi Arabia, you can request the immigration officer to change their pictures on Iqama. They are more likely to accept your request if the old picture is considerably different from the current appearance of the child.\nI have requested them once and they did it immediately. However, in case they do not honor your request, you can always follow the other method explained below.\n\nIntroduction\nThere are two ways to change the picture or photo on Iqama, one is specifically for children and the other one is for both children and adults.\n\nRequirements\n- Jawazat Appointment with the option Resident Services .\n- Fill out the following form to change Iqama information. Point 9: تغيير الصورة على الإقامة\n- Point 9: تغيير الصورة على الإقامة\n- Original Iqama.\n- Original Passport.\n- Copy of father’s Iqama (if dependent).\n- Letter from the employer requesting to change the Iqama picture duly attested by the chamber of commerce .\n\nStep-by-Step Process\n- Go to the counter with the camera installed on his desk.\n- Provide your Iqama and explain the purpose.\n- The officer will take your fingerprints to confirm your identity.\n- The officer will take a new picture.\nThat’s it, now you can go to another counter to print the Iqama.\n\nWhy do you need to change the picture?\nAt the time of entering Saudi Arabia, the immigration officer took your picture. You might have noticed that the photo on your Iqama remains the same despite several years having passed.\n- How to change the name on Iqama?\nIf your looks have considerably changed from the time you entered Saudi Arabia, you might have to change the photo on your Iqama. Otherwise, you will be facing issues of recognition at different government offices.", "Fine for working without Iqama transfer\nIf a dependent is found working for a sponsor without transferring his/her sponsorship, he or will be penalized in the following way;\n- SR 1,000 fine for the first time.\n- SR 2,000 fine for the first time.\n- SR 3,000 fine + deportation for the third time.\n\nIntroduction\nYou must follow a lengthy procedure to transfer a dependent’s Iqama sponsorship, whether a wife or son, to another employer or company. In this article, we have explained the procedures to;\n- Transfer dependent iqama to another employer.\n- Iqama transfer of Wife from Father to Husband.\n- Iqama transfer from a company to a husband/father.\n- Iqama transfer of family members after the death of the father.\n- Transfer dependent Iqama from Father to Mother\n\nIqama transfer of Wife from Father to Husband\nIf two Iqama holders got married outside Saudi Arabia, they need to attest their marriage certificate from the following and submit it to Jawazat.;\n- Ministry of Foreign Affairs of that country.\n- Saudi Embassy of that Country.\n- Ministry of Foreign Affairs in Saudi Arabia.\nIf two expatriates get married in Saudi Arabia , the Iqama sponsorship of the wife can be transferred from her father to her husband by submitting the following to Jawazat.\n\nIqama transfer of family members in case of death\nGod forbids if the head of a family dies, they can transfer the family members can transfer their sponsorship to another family member who is already employed by an establishment in Saudi Arabia. e.g. after the father’s death, the iqama can be transferred to one of his sons.\n\nLetter from the Court\nBefore visiting the court, make sure you have arranged the following;\n- 4 witnesses to state that your father is dead and you are the legal guardian now.\n- A copy of the letter from the Jawazat.\n- All the above-mentioned documents.\nThe court will register your case and present you to a Judge. The judge will question the witnesses and once he is fully convinced, he will hand the witnesses a paper to sign. Once you and the witnesses have all signed the paper, the court will issue the letter.\n\nRenewal of Iqama\nYou can renew the family Iqama through the “Sponsorees” option in your Absher account by paying the following two kinds of fee;\n- SR 1,000 per family member for the renewal for 2 years.\n- The Dependent Fee.\n\nRequired Documents\n- A waiver letter by the employer of the wife duly attested by the Chamber of Commerce allowing her the Iqama transfer.\n- A letter from the Father requesting the Iqama transfer on a blank paper. Agents sitting outside Jawazat can help you write this letter.\n- Iqama transfer form for each child.\n- Copies of Iqama + passport for each family member.\n- Payment of fee for the transfer of dependent’s sponsorship.\n\nRequired documents\n- Waiver letter from the employer of the husband duly attested by the Chamber of Commerce allowing the iqama transfer.\n- A NOC from the father signed in front of the Jawazat officer. The format can be taken by the agents sitting in front of Jawazat.\n- Iqama transfer form can be filled by the agents too.\n- A copy of the marriage certificate.\n- Original passport + Iqama of the wife.\n- A copy of the Iqama of wife + husband + father.\n- Payment of fee for the transfer of wife’s sponsorship from father to husband.\n\nRequired documents\nIn order to transfer a dependent’s sponsorship from a company to an individual (father/husband), you need to arrange the following documents and visit the Jawazat office.\n- A copy of the Job contract.\n- The proof of termination of the contract.\n- The NOC from the employer to transfer the employee service.\n- A proof that he/she was a dependent and his service was transferred.\n- Iqama copy of the dependent.\n- Iqama copy of the dependent.\n\nRequired documents\n- A letter of request by the person who wants to take the sponsorship of the family.\n- Waiver letter from the employer allowing the iqama transfer.\n- Salary certificate issued by the company duly attested by the chamber of commerce.\n- The GOSI certificate.\n- Copies of Iqama + Passport of all family members.\n- Copies of Birth Certificates of all family members.\n- Copy of the passport + iqama of the deceased family member.\n- Wife and children Iqama.\n- If your sibling is in school then a Bonafide certificate from school.\n- Death Certificate.\n- Deed of Sustenance (from your embassy).\n- A letter of confirmation that the sister is unmarried.\n- Two passport size photographs of each family member.\n- A letter from the embassy that the mother is unmarried.\n\nSubmit the documents to Jawazat\nNow get back to the legal affairs department in Jawazat and submit all the documents to them along with the letter from the court. They will issue you the print of the new Iqama.\n\nTransfer dependent Iqama from Father to Mother\nAccording to the Saudi Residency Law, if the final exit of the sponsor is issued, all his or her dependents need to travel with him on a final exit. However, in case the wife is working under the sponsorship of another employer, she can transfer the sponsorship of her children to her name.\n\nTransfer dependent iqama to another employer\nHRSD Ministry has allowed companies to hire expat dependents (husband, wife, children) if 5 conditions are fulfilled. After the hiring, t he employer can start the process to transfer dependent iqama;\n- The employer will create a request to transfer dependent Iqama sponsorship through the Qiwa system. They will select your Iqama profession and upload the contract in the Qiwa system.\n- The dependent will register with Qiwa and approve the contract in the system. Qiwa Status: Under Process.\n- Qiwa Status: Under Process.\n- Upon accepting the contract, t he guardian (father, husband) will is required to accept the request on Qiwa under “ Home Worker Transfer “. Qiwa Status: PENDING COMPLETING TRANSFER IN ABSHER.\n- Qiwa Status: PENDING COMPLETING TRANSFER IN ABSHER.\n- Now the employer has to complete the transfer of sponsorship within 14 days by visiting the Jawazat office with the following documents; CR of the establishment. Original Passport and iqama of the dependent + copy. Copy of Passport and iqama of the guardian. Filled Jawazat form for the transfer of sponsorship of the dependent. One photograph with white background. Medical Insurance from the Employer’s company. No Objection Certificate signed by your Guardian.\n- CR of the establishment.\n- Original Passport and iqama of the dependent + copy.\n- Copy of Passport and iqama of the guardian.\n- Filled Jawazat form for the transfer of sponsorship of the dependent.\n- One photograph with white background.\n- Medical Insurance from the Employer’s company.\n- No Objection Certificate signed by your Guardian.\n\nVisit Jawazat\n- Book Jawazat appointment with the purpose: Resident Services.\n- Submit all the documents to the Jawazat.\n- The officer will review your request and transfer the Iqama sponsorship of the wife from the father to the husband in the system.\n- After that, you can go to another window to print a copy of the new Iqama.\n\nVisit Jawazat\n- Book Jawazat appointment with the purpose: Resident Services.\n- Submit all the documents to the Jawazat.\n- The officer will review your request and transfer the Iqama sponsorship of the wife/husband in the system.\n- After that, you can go to another window to print a copy of the new Iqama.\n\nVisit Jawazat\n- Book Jawazat appointment with the purpose: Resident Services.\n- Take these documents to the Legal Affairs Department in Jawazat.\n- They will then verify all your documents and issue a letter addressed to the courts stating that your case is authentic.\n\nVisit Jawazat\n- Book Jawazat appointment with the purpose: Resident Services.\n- The new sponsor (wife) will have to present all the above-mentioned documents to Jawazat.\n- They will review the documents and if the application is accepted, you will be able to print the new Iqamas for your children.\n\nWho is entitled?\nIt is worth mentioning that iqama transfer from a company to husband/father is only possible for;\n- A Spouse.\n- An unmarried daughter.\nYou cannot transfer the Iqama of a son from a company/employer.", "Dependents are outside KSA\nThe Iqama renewal of an expatriate family is possible even if one or all the dependents are outside the Kingdom of Saudi Arabia (KSA). However, you need to complete the following requirements;\n- Payment of Dependent Fee .\n- A certificate issued from the college/university (for the Iqama Renewal of a son above 18 years old).\n\nFamily Head is outside KSA\nAccording to the latest announcements made by the Jawazat in Saudi Arabia, now the iqama renewal of a family head who is outside Saudi Arabia is also possible through the Absher platform.\nA few years ago, the presence of the whole expatriate family in Saudi Arabia was the requirement to renew the Iqama. In the absence of the online system, authorities used to take an affidavit from the Kafeel of the Iqama holder that his dependents are inside Saudi Arabia.\n\nIntroduction\nMany people have questioned if the Iqama renewal is possible while expatriate family head or his dependents are outside the Kingdom of Saudi Arabia (KSA).", "Add Requirements: Born outside Saudi Arabia\nThe Iqama procedure for a newborn born outside Saudi Arabia is slightly different. Once you bring the baby to Saudi Arabia , you need to arrange the following additional requirements to apply for the Iqama.\n- Passport page with the border number.\n- Copy of the visa stamped on the passport /on-arrival visa.\n- Payment of SR 2,000 Iqama fee for the newborn baby .\n- Polio immunization certificate received from the hospital.\n\nIntroduction\nNo matter a child is born inside or outside Saudi Arabia, you need to follow this procedure to get the Iqama for the newborn baby. Here is the complete procedure.\n\nIqama Renewal/Exit Reentry/Final exit\nMany people have questioned me if they can renew their Iqamas get a final exit visa, exit reentry visa without the newborn baby Iqama. Here are the things you can/cannot do without the newborn Iqama.\n- Iqama renewal is possible but you have to pay the dependent fee for the newborn too.\n- Exit Re-Entry will not be issued with this error code: Alien has dependent with pending status.\n- Final exit cannot be issued unless you get Iqama for newborn.\n\nRequirements to get Iqama for newborn baby\nNow there is no need to visit Jawazat to get the Iqama for a newborn baby in Saudi Arabia. What you need to do is to m ake one PDF file of all the below-mentioned documents to upload to Absher.\n- Birth Certificate for the newborn.\n- Baby’s Passport.\n- Valid Insurance in the system.\n- Payment of Dependent Fee.\n- Photographs of the newborn.\n- Father’s passport copy.\n- Mother’s passport copy.\n- Father’s Iqama copy.\n- Mother’s Iqama copy.\n- Baby’s vaccination card.\n- SR 1,000 fine if you are applying for Iqama after 12 months of birth (applicable only on babies born in Saudi Arabia).\n- Original Marriage Certificate duly attested by the Ministry of Foreign Affairs if your wife is not under your sponsorship.\n\nStep 1: Apply for Iqama for newborn baby\nOnce you have the PDF file ready, you need to login to your Absher account https://www.absher.sa/ .\n- Click on the “ Services ” tab under “My Services”.\n- Select the “ Passports ” option.\n- Click on the “ Tawasul “.\nOn the next screen, select the following settings to apply for the Iqama for a newborn baby in Saudi Arabia.\n- Click on the “ New Request ” button.\n- Sector: Resident Service inside the Kingdom.\n- Service: Newborn Registration if the child is born in Saudi Arabia .\n- Service: Add Dependent if the child is born outside Saudi Arabia .\n- Request Description.: Explain your problem.\n- Attachment: Attach the PDF file you have created before.\n- You can use an online PDF compressor to reduce its size.\n- The name of the PDF file should be one word only, without any space.\nSpecial character not allowed: Remove all the (. ! ?, ‘ “ etc) special characters and you should be good to go.\n\nStep 2: Rejection Reasons\nIf your Tawasul request is rejected with the reason\n- عليك عمل تامين طبي ويا ارسال الطلب مره اخرى , it means that the link between the insurance of your child and Jawazat is missing. You should contact your insurance company to resolve it.\n- جب ارفاق جميع الوثائق بالشكل الصحيح ليتم استكمال طلبكم, it means that there is some problem with the attachment.\n- الاسم في جواز السفر غير مطابق للاسم في شهادة ميلاد للمولوده , it means that the name on the passport does not match with the birth certificate.\n\nStep 3: Print the Iqama\nFinally, you will receive one message on your phone stating our request has been answered. At that time;\n- Log in to your Absher account https://www.absher.sa/.\n- Click on the “ General Services “.\n- Select “ Passports “.\n- Click on the “ Tawasul ” service.\n- Select “ Inquire for Requests “ .\nIf your request is accepted, you can visit the Jawazat office to get the print of the Iqama along with the following documents;\n- The print of the Tawasul request.\n- Photographs of the newborn.\n- Filled Iqama Form .\n- Book Jawazat Appointment with the service: Resident Services .\n- You can also request the postal delivery of Iqama from Absher.\nThe Jawazat officer will print the Iqama immediately.", "Introduction\nAccording to the new rules of Iqama renewal, the process to renew Iqama has been significantly eased up. Here is the process.\n\nIqama fee calculator\nYou can check the fee you need to pay to renew your Iqama with the help of the Iqama fee calculator.\n\nIqama renewal after 60 years\nThe GRO of a company or Kafeel will have to visit Jawazat to renew the Iqama of 60 years plus expatriate employees.\n\nIqama renewal for son above 18 years\nIf you have a dependent son under your sponsorship in the age bracket of 18 years to 25 years, you need to submit the following additional documents to the GRO of your company.\n- Application form.\n- A certificate issued from the college/university.\n- Passport Size photo of the son.\n- Iqama copies of the son and father.\n- SR 500 additional fee.\n\nIqama renewal while expatriate is out of KSA\n- Iqama renewal of an expatriate employee while he is out of KSA: YES\n- Iqama renewal of an expatriate dependent while he is out of KSA: YES\n\nNew rules for iqama renewal\nHere we would like to talk about 2 new rules for Iqama Renewal;\n- The iqama renewal is possible 6 months in advance.\n- Iqama renewal for expats is possible while they are outside Saudi Arabia.\n- The MOL has allowed quarterly iqama renewal. Here is how to renew Iqama for 3 months .\n\nPenalty for expired Iqama\nIf the Iqama is expired and not renewed within 3 days of its expiry, the following penalties are applied. It is the responsibility of the employer to pay the fine if the delay is caused by him.\n- First Time: SR 500 fine.\n- Second Time: SR 1,000 fine.\n- Third Time: Deportation of expatriates.\n\nRenew Iqama online\nAfter completing all the above-mentioned requirements, your sponsors will log in to the Muqeem account and renew the Iqama.\n- Employer will login to Muqeem https://muqeem.sa/#/login\n- Click on “ المعاملات الإلكترونية “.\n- Select “ تجديد الإقامة “.\n- Enter the security code sent on mobile.\n- Enter the Iqama Number .\n- Select the duration of Iqama renewal i.e. 3, 6, 9, or 12 months.\n- Click on the “ Submit ” button.\n- That’s it, your Iqama has been successfully renewed.\n- You can check the Iqama expiry date on the Absher account.\n- If your Iqama card is going to expire, you can visit Jawazat to print a new card. There is no need for the new card if the expiry date is not written on it.\n\nRenew iqama without Kafeel\nAlthough the Iqama renewal process is processed by the Kafeel, there is a remote possibility to renew Iqama without Kafeel. In order to do that;\n- Check Iqama Huroob Status and make sure there is no Huroob.\n- Check if you can transfer Iqama without Kafeel .\n- Transfer your Iqama to a new employer through Qiwa.\n- The new employer will renew the Iqama.\n\nRequirements to Renew Iqama\n- Payment of Iqama Renewal Fee.\n- Payment of Dependent Fee .\n- Payment of Maktab Amal Fee.\n- Valid Health Insurance .\n- The professional membership account must be active. SOCPA Membership for Accountants. Marmaris Plus or SCFHS membership for medical staff. SCE membership for engineers and technicians.\n- SOCPA Membership for Accountants.\n- Marmaris Plus or SCFHS membership for medical staff.\n- SCE membership for engineers and technicians.\n- HIV/AIDS test for 10 nationalities only.", "Introduction\nThere are 12 details or information in the format of your Iqama such as your name in Arabic and English, Iqama number, ID version, place of issue, date of issue, date of birth, iqama profession, nationality, religion, and the name of the employer.\n- Name in English\nThe first line on your Iqama just above the Iqama number is your name in English. When you receive your card for the first time, make sure that;\n- The name in English is coinciding with the name in Arabic.\n- The spelling of the name on the passport is the same as on the Iqama.\nIf any of these details are inaccurate, you should return back your residency permit card immediately for rectification. If you are working in some company, do not receive your card unless mistakes are rectified.\n- Recommended: How to change the name of Iqama?\n- Name in Arabic\nThe second line of information contained in Iqama is your name in Arabic which is written just above the Iqama number. Make sure your name is correct and matching with the English name.\n- Iqama Number\nThe third line on your Iqama is your Iqama number written in Arabic numbers. If you analyze the Iqama number format, it is a 10-digits number. An iqama number format is a chronological number issued by Jawazat.\n- Recommended: How to check Iqama number online?\n- Iqama ID Version\nIqama ID version shows the number of cards already issued for the employee. Now the residency card is issued for 5 years. So, after 5 years when you will be given a second card, the serial number will be 2 there.\n- Place of Issue\nUntil 2017, the place of issue used to show the city name from where the residency permit card is issued. But now it only shows “Electronic Services” which means that the card has been issued electronically.\n- Date of Issue\nThe next line on the face of your Iqama is the date of issue of card and it is written in Arabic according to the Hijri calendar.\n- Recommended: How to check Iqama issue date online?\nIt is important to mention here that now the date of expiry is no more printed on Iqama, but it does not mean that there is no expiry date of your iqama.\n- Recommended: How to check Iqama Expiry Date?\n- Date of Birth\nThe next line is the date of birth in the Gregorian calendar. The date of birth should match with the Date of Birth written on your passport. Just like the name and number on Iqama, if your date of birth is not matching with your passport, you should return your Iqama for rectification.\n- Iqama Profession\nIqama profession tells other people about the job at which you are working. As per Article 38 of Saudi Labor Law, Iqama profession should match with your actual profession.\n- Recommended: How to change Iqama profession in Saudi Arabia\n- Nationality\nYour nationality determines the attitude of government officials towards you. The treatment of a western expatriate is different from a South Asian expatriate.\n- How to change nationality in Iqama?\n- Religion\nThe religion on your Iqama determines if you can enter the two holy cities of Saudi Arabia namely Makkah and Madina. It is important to mention here that Non-Muslims cannot enter Makkah or Madina.\n- How to change religion in Iqama?\n- Name of Employer\nName of your employer is written in Arabic here just above the Iqama number written in English. It is illegal to work for someone who is not your employer.\n- Iqama Number in English\nIf you cannot read the Iqama ID written in Arabic, don’t worry as we have your Iqama number and name printed in English for you in the same format as Arabic. It is normally written on the left bottom corner of the card.", "Applying for a Visa for the Newborn Baby\nIf you meet the above-mentioned pre-conditions, you can bring your newborn baby to Saudi Arabia by applying for a visa through the Saudi Embassy.\nIn order to do that, submit the following documents through an agent ( Etimad in Pakistan ) to the Saudi Embassy.\n\nFamily Visit visa for newborn baby\nIf the mother has already stamped the family visit visa on her passport and the child is born later, you will have to follow this procedure to stamp a visit visa for a newborn baby in Saudi Arabia.\n- Apply for a Family Visit Visa in Saudi Arabia .\n- Stamp the family visit visa on the newborn baby’s passport.\n\nImportant Guidelines\n- It is better to book the flight through Saudi Airlines or at least through any other airline of the Gulf as they know the rules to bring a newborn baby to Saudi Arabia on an on-arrival visa.\n- Once you land in Saudi Arabia, the immigration officer will check the above-mentioned documents and stamp the passport.\n- The visa is automatically linked with the father’s Iqama. In case the wife is a working lady, she can mention it to the Jawazat officer to link the visa of the newborn to her Iqama (optional).\n- The on-arrival visa for the newborn baby is free.\n- Apply for the Iqama of the newborn.\n\nImportant Guidelines\n- You will have to pay a fee of around SR 100 to stamp the visa on the newborn baby’s passport.\n- Once the visa is stamped, your child can travel to Saudi Arabia within the validity of the visa.\n- Apply for the Iqama of the newborn.\n\nIntroduction\nYou can bring your newborn baby to Saudi Arabia either with an on-arrival visa or by applying for the visa through the Saudi embassy. We have explained both of the procedures below.\n\nOn-Arrival Visa for the Newborn Baby\nIf you meet the above-mentioned pre-conditions, your child can get an on-arrival visa at any international airport in Saudi Arabia. Make sure that the mother is possessing the following documents with her;\n\nPermanent Family Visa for newborn baby\nIf the mother has already stamped the permanent family visa on her passport and the child is born later, you will have to follow this procedure to stamp a permanent family visa for a newborn baby in Saudi Arabia.\n- No need to apply for a new visa in Saudi Arabia.\n- Submit a new application to the Saudi Embassy through an agent for stamping the newborn baby’s passport.\n- Attach the mother’s passport where the permanent family visa is already stamped.\n\nPre-Conditions\nYou can bring your newborn baby to Saudi Arabia only if all the below conditions are met;\n- The child must be less than 12 months old.\n- Both parents have a valid Iqama.\n- The mother has a valid exit reentry visa.\n\nRequired Documents\n- Newborn Baby’s original passport.\n- Newborn Baby Birth Certificate attested by the Ministry of Foreign Affairs.\n- Newborn Baby’s Vaccination Card.\n- Newborn Baby’s 2 photos with a white background.\n- Mother’s original passport.\n- Mother’s valid exit reentry visa.\n- Iqama copies of parents.\n- Father’s passport copy.\n- The complete address of the father’s employer in Saudi Arabia.\n- Absher paper with Iqama expiry (both father and mother).\n\nRequired Documents for the on-arrival visa\n- Newborn baby’s birth certificate.\n- Newborn baby’s vaccination card.\n- Iqama copy of the parents.\n- Passport copies of the parents.\n- Valid Exit Reentry Visa of the mother.", "Check Iqama Profession – PACC\nYou can also check the profession of any expat in Saudi Arabia using his Iqama number on the Professional Accreditation website. To do it;\n- Open the website: https://svp-local.pacc.sa/worker-eligibilty\n- Enter your Iqama Number .\n- Click on the “ Check ” button.\nThe PACC website will show you the current Iqama profession of the expat employee.\n\nCheck Iqama Profession – Qiwa\nYou can also check your Iqama profession through Qiwa;\n- Register yourself with the Qiwa platform.\n- Log in to your Qiwa: https://sso.qiwa.sa/sign-in\n- Click on “ Individual Account “.\n- Click on the 3 lines in the upper right corner.\n- Select the “ My Information ” option.\nOn the next screen, scroll down until you find Your Resume.\n- Click on “ Go to your Resume “.\n- You will find your Iqama profession under your name on Qiwa.\nFinding your new profession here indicates that your Iqama profession status has been changed.\n\nCheck Iqama profession – Absher\nTo check Iqama profession online through Absher;\n- Log in to Absher: https://absher.sa\n- Click on the 3 lines in the upper right corner.\n- Select “ Dashboard ” from the drop-down menu.\n- On the next page, click on “ More Details “.\nHere you can find your current Iqama profession under “ Job Category .” If you find your new profession here, it is a confirmation of the change in your Iqama profession status.\n\nIntroduction\nThere are 4 ways to check the status of change in the Iqama profession in Saudi Arabia, as explained below.\n- How to change Iqama profession?\nArticle 38 of Saudi Labor Law forbids employers from employing workmen in a profession other than the one specified in his Iqama.\n\nIqama Profession – MOFA\nThe fourth way to check your Iqama profession is through the MOFA website.\n- Open this website https://visa.mofa.gov.sa/Account/\n- Click on the “ Login ” button.\n- Enter your Iqama Number .\n- Approve the Nafath access .\nOn the next page, you will be given many options, out of which you need to select;\n- Family Visit Visa Application for Residents .\nOn the first page of the application, the system will fetch your details, and you can find the updated Iqama profession under the “ Job ” tab.\nCongratulations if you find your new Iqama profession here. It is a confirmation of the change in your Iqama profession status.\n\nIqama profession printed on the card\nThe job profession is one of the 12 details written on your Iqama , and you can find it on the 8th line of the card, as shown below. This is how government officials figure out your Iqama profession during a raid.", "Expats with Engineering and Accountancy\nThe next requirement in the iqama process of Saudi Arabia is getting yourself registered with a professional body;\n- Accounts-related professions registered with SOCPA .\n- Engineers and technicians registered with Saudi Council of Engineers .\n- Doctors and paramedical staff registered with SCFHS .\n\nIntroduction\nWhen you have arrived in Saudi Arabia on an employment visa, the most important thing is getting your new Iqama card.\n- Procedure to get a family Iqama for dependents .\n\nMedical requirements for the new Saudi Iqama\nThe first step in the process to get a new iqama for employees in Saudi Arabia is to;\n- Go to one of the approved medical centers .\n- Pay SR 200 fee for the medical test.\n- The test includes HIV/AIDS test, TB Xray, eyesight, and hearing test, a test for cholera (a charming stool sample test).\n- Check the Status of the Medical Test Report Online.\nKeep in mind that there is a stool test so better be prepared for that.\n\nNo iqama after 90 days of arrival?\nIf your Iqama is not issued within the first 90 days of your arrival, there will be a penalty that your employer will have to suffer. Moreover, it also gives you the right to transfer your sponsorship without the consent of your sponsor .\n\nRequirements to issue the first Iqama\nThe following are the requirements to issue a new Iqama for employees;\n- Medical test (explained below).\n- Passport Copy.\n- Border Number – Check border number online .\n- Health Insurance.\n- Pay Iqama Issuance Fee – SR 650.\n- Pay Maktab Amal Fee .\n- Registration with SOCPA, SCE, or SCFHS (explained below).\n- Green Nitaqat Category .\nIqama Processing Time: Once all the requirements are fulfilled, the employer will apply for the new Iqama online and the Iqama card will be delivered to him through the Saudi post within 3 days.\n\nWho pays for the Iqama issuance?\nIt is the responsibility of the employer and the right of an employee to get the Iqama within 90 days of arrival to Saudi Arabia.\nThe employer will be taking care of all the expenses of your Iqama (Article 40.1 of the Saudi Labor Law).", "Approved Medical Centers in Dammam\nWe have listed down all the Efada approved medical centers and hospital to conduct the medical test for the renewal and issuance of Iqama in Dammam, Saudi Arabia below.\n\nApproved Medical Centers in Jeddah\nWe have listed down all the Efada approved medical centers and hospital to conduct the medical test for the renewal and issuance of Iqama in Jeddah, Saudi Arabia below.\n\nApproved Medical Centers in Riyadh\nWe have listed down all the Efada approved medical centers and hospital to conduct the medical test for the renewal and issuance of Iqama in Riyadh, Saudi Arabia below.\n\nIntroduction\nIn order to apply for the first Iqama after entering Saudi Arabia, you need to take a medical test from an approved medical center.\n- How to get a new Iqama in Saudi Arabia?\nYou can go to any approved medical centers in Saudi Arabia and take the medical test for the issuance of Iqama. It will be a;\n- Blood Test.\n- Stool Test.\n- How to check Medical Test report for Saudi Iqama online?\n\nOther cities\nWe have listed down all the Efada approved medical centers and hospitals to conduct the medical test for the renewal and issuance of Iqama in all other cities of Saudi Arabia below.", "Introduction\nThe HRSD Ministry has reserved 100 Iqama professions for Saudi nationals as per Article 36 of Saudi Labow Law. Here is the list of all Iqama professions with 100% Saudization – updated 2025.\nThey will either have to change their profession or leave the job, as there are no iqama renewals for expats in these professions. The newly added professions are given at the end of the list.\n\nList of Iqama Professions with 100% Saudization\n1- Cashier.\n2- Complaint Clerk or Claims Clerk.\n3- Booking Clerk.\n4- Customs clearance clerk.\n5- Director of personnel relations.\n6- Director of labor Affairs.\n7- Reservation Agent.\n8- Tourist Program Designer.\n9- Duty Clerk or Attendance Control Clerk.\n10- Employment Clerk.\n11- Executive HR Manager.\n12- Female Sales Specialist for Ladies Shop.\n13- Head of Personnel Department.\n14- HR Manager.\n15- Senior HR Coordinator.\n16- Payroll Officer.\n17- HR Director.\n18- Compensation and Benefits Officer.\n19- Training Manager.\n20- Key Specialist.\n21- Labor Affairs Manager.\n22- Receptionist (general).\n23- Receptionist (hospitals).\n24- Receptionist (hotel).\n25- Recruitment Clerk or Employment Clerk.\n26- Representative or Broker.\n27- Security Guard.\n28- Treasurer.\n29- Staff Affairs Clerk or Personal Affairs Clerk.\n30- Staff Relations Manager.\n31- Staff Relations Specialist.\n32- Individual Affairs Clerk.\n33- Timekeeper.\n34- Typist.\n35- Shops selling watches.\n36- Shops selling Eye-Glasses and Frames.\n37- Medical appliances and equipment shops.\n38- Electrical appliances and electronic shops.\n39- Car Spare Parts Shops.\n40- Building and construction material shops.\n41- Shops selling Carpets.\n42- Automobile and motorbike showrooms.\n43- Home and office furniture shops.\n44- Readymade garments, children and men’s wear.\n45- Household utensils shops.\n46- Confectionery shops and patisseries.\n47- Light-vehicle driver\n48- Order Taker.\n49-S afety and security officer.\n50- Safety and security supervisor.\n51- Food service employee.\n52- Telephone operator.\n53- Supervisor of telephone operators.\n54- Data-entry clerk.\n55- Administrative clerk.\n56- Secretary.\n57- General services supervisor.\n58- Room service supervisor.\n59- Maintenance supervisor.\n60- Sales and marketing supervisor.\n61- Tourism programs supervisor.\n62- Front office supervisor.\n63- Director of security and safety.\n64- Acting director.\n65- Maintenance manager.\n66- Room service manager.\n67- Customer service manager.\n68- Administrative manager.\n69- Sales and marketing representative.\n70- Director of tourism programs.\n71- Director of the front office.\n72- Director of staff relations.\n73- Health and Safety professionals.\n74 -Customer Care Service officer at Call Centers. – Arab News\n75 -Translator.\n76 -Stock Keeper. – HRSD Ministry\n77- Real Estate Broker.\n78- Real Estate Sale and Rental Broker.\n79- Land and Real Estate Registry Clerk.\n80- Real Estate Marketer.\n81- Property Manager.\n82- Certified Sustainable Engineer.\n83- Certified Resident Engineer.\n84- Quality Inspector Engineer.\n85- Building Inspector.\n86- Real Estate Arbitrator. – Twitter\n87- Government Relations Officer.\n88- General manager.\n89- Customs Categorizer.\n90- Customs clearance broker. – Saudi Gazette\n91- Copilot – 315305. – Saudization in the Aviation Professions\n92- Air controller – 315301.\n93- Dispatcher – 315402.\n94- Meteorologist – 315401.\n95- Tourist Information Clerk – 221024 .\n96- Call Center Clerk – 422201.\n97- Customer Service Center Inquiries Clerk – 422202.\n98- Query Clerk – 422501.\n99- Customer Data Clerk – 422902.\n100- ATV splitter operator – 422302 .", "Introduction\nYour Iqama (Residence Permit) is the document you need to keep with you every time. If at any point in time, you are found without having legal Iqama with you, you will be fine which may vary according to the frequency you have caught in.\nPlease remember, you are not living in your own country, neither are you living in some European or American country where the provision of residence permit number will be enough for the proof that you are a legal resident of the company. You will have to produce your Original Iqama to the officer asking for it.\nIf you are caught for the first time without Iqama and your Iqama is still valid, you would be detained and locked up in a Jail. After that, you would be allowed to call to someone who has access to your Original Iqama.\nLet’s say, you have Iqama at home so you can call your brother or friend to pick it from there and bring it to the Police station. After producing the original iqama, you would be released and the government will impose a fine penalty of SR 1,000/- for not producing the Iqama on demand.\nRecently it has been published in the Saudi Gazette that there will be no more detention in case an employee is caught without Iqama.\nI f you are caught for the second time without Iqama, it means you are in habit of making violations of the Law. The Same procedure would be followed with the exception of the amount of iqama fine. This time, SR 2000 Iqama fine will be imposed for the repeated violation.\nA warning will be given that if the mistake is repeated the third time, consequences may lead to deportation.\nIf you are caught without Iqama for the third time, consequences are really very serious. This time you will have to call your Kafeel along with the original Iqama.\nA fine of SR 3,000/- will be imposed upon the person making the violation. Moreover, the government will make arrangements for the deportation.\nGulf News has reported that a plan to ban the deported expatriates from one GCC country from entering on work visas in any other GCC country has been finalized. To know about the status of the implementation, click on this link “ GCC Wide Ban on Deported Expatriates of GCC Countries ”\nA couple of years ago, sponsors used to hand over a letter to their employees stating that their Iqama is under renewal. At that time, this letter used to be treated a piece of sufficient evidence in lieu of Iqama. However, now the Iqama renewal process is online so this letter would not be acceptable to any authority.\nWe have explained in detail in this article about the procedure you need to adopt in case Iqama is lost . If any official asks you about the Iqama, you can show him the police report if it is recently generated.\nAgain, if a police report is more than one month old, that official has every right to declining this report as replacement of producing Iqama on demand.", "Fee/Penalty for the Lost Iqama\nThe fee or penalty applicable for the lost Iqama in 2024 depends upon the following factors;\n- Iqama is stolen and reported to police within 24 hours = No Fee.\n- Iqama is lost for the; first time = SR 1,000. second time = SR 2,000. third time = SR 3,000.\n- first time = SR 1,000.\n- second time = SR 2,000.\n- third time = SR 3,000.\n- Source: Ministry of Interior.\n\nIntroduction\nIf your Iqama is lost in Saudi Arabia, you need to report it to the police, pay the fee or penalty applicable in 2024 and get the print of the new Iqama. We have shared the updated procedure below.\n- SR 3,000 fine for not carrying Iqama\n\nStep 1: Inform your Sponsor\nThe first and most important step is to inform your sponsor about the missing Iqama if it is not found after a reasonable search. This procedure is to be followed by the sponsor.\n- Employee’s sponsor: Kafeel/GRO of the company.\n- Dependent’s Sponsor: Head of the Family.\n\nStep 2: Police Report\nIqama is stolen: Visit the nearest police station to report the lost Iqama along with the sponsor if the Iqama is stolen. Here you will be required to write an application in Arabic explaining how the iqama is lost.\n- Fee: Zero .\nIqama is lost: The police report is not required if the Iqama is lost due to any reason except being stolen.\n- Fee: SR 1,000 .\n\nStep 3: Pay the fee\nThere is no separate tab to pay the fee for the lost Iqama on SADAD. Therefore, you can follow the process to pay the fee to change the Iqama profession .\nThe amount would be shown under passport deposits while checking available funds .\n\nStep 4: Arrange Required Documents\nEmployee Iqama: In the next step, your sponsor must visit Jawazat along with the following documents to get the new print in replacement of a lost Iqama.\nDependent Iqama: If a dependent’s Iqama is lost, make one PDF file of all the documents below.\n- Jawazat Appointment with the purpose “ Resident Services “.\n- Download Iqama Form and fill it in Arabic.\n- Police Report (if applicable)\n- Payment of the fee to replace Iqama.\n- Iqama copy of the dependent.\n- Passport copy of the dependent.\n- Iqama copy of the head of the family.\n- Passport copy of the head of the family.\n\nStep 5: Report Lost Iqama in Absher\nOnce you have the PDF file ready, log in to your Absher account to report the lost Iqama for your dependents;\n- Log in to Absher: https://www.absher.sa/.\n- Click on the “ Services ” tab under “My Services”.\n- Select the “ Passports ” option.\n- Click on the “ Tawasul “.\nOn this screen, select the following settings to report a lost Iqama for dependents in Saudi Arabia.\n- Click on the “ New Request ” button.\n- Sector: Resident Service inside the Kingdom.\n- Service: Report Lost or Damaged Resident ID.\n- Request Description: Explain how the residence permit is lost.\n- Attachment: Attach the PDF file you have created before.\n- You can use an online PDF compressor to reduce its size.\n- The name of the PDF file should be one word only without any space.\nSpecial character not allowed: Remove all the (. ! ?, ‘ “ etc) special characters and you should be good to go.\n\nStep 6: Print the Iqama\nFinally, you will receive one message on your phone stating our request has been answered. The next step to get a new Iqama in replacement of a lost Iqama is to;\n- Log in to your Absher account https://www.absher.sa/.\n- Click on the “ General Services “.\n- Select “ Passports “.\n- Click on the “ Tawasul ” service.\n- Select “ Inquire for Requests “ .\nIf your request is accepted, you can visit the Jawazat office to get the print of the Iqama along with the following documents;\n- The print of the Tawasul request.\n- All the above-mentioned documents.\n- Book Jawazat Appointment with the service: Resident Services .\nThe Jawazat officer will print the Iqama immediately.", "Delivery Charges in Saudi Arabia\nAlthough many factors may have an impact on it, the following are the average baby delivery charges in Saudi Arabia.\n- Normal Delivery cost: around SR 3,500 to SR 5,000.\n- Cost of Cesarean Delivery: around SR 7,000 to SR 10,000.\nKeep in mind that this cost does not cover the fee for the regular follow-ups and checkups during pregnancy.\n- Pregnancy Checkup: SR 100/visit.\nOnce the baby is born, you will have to follow the procedure to get iqama for a newborn baby in Saudi Arabia .\n\nIntroduction\nPregnant women without medical insurance or on family visit visas should budget the baby delivery charges in Saudi Arabia. Here is a rough estimate of the normal and cesarean delivery costs in Saudi Arabia.\n- Does family visit visa insurance cover pregnancy? NO.\n\nWhat to do if you don’t have medical insurance?\nIf you are planning the delivery of your baby in Saudi Arabia while your wife does not have insurance or she is here on a family visit visa, you should;\n- Consult other women in your community about the hospital to visit.\n- Look for a small polyclinic unless there is any medical complication. List of polyclinics in Jeddah\n- List of polyclinics in Jeddah\n- Don’t go to a high-class hospital (they would rip you off).\n- Discuss the money constraint with the doctor.\n- Finalize a delivery package for both normal and cesarean cases.", "Introduction\nIn this article, we have shared the list of all those professions who are eligible to apply for a permanent family visa in Saudi Arabia.\n- Apply for a Permanent Family Visa in Saudi Arabia\nIn case your profession is not one of the listed professions below, you might have to change your Iqama profession.\nHowever, while selecting the profession you need to be careful as some professions are reserved only for Saudis . You must ensure that your Iqama is not one of them.\n\nList of professions eligible for family visa\n1-Accountant / Accounts Verifier / Auditor.\n2-Accounts Manager.\n3-Administration Coordinator.\n4-Administrative Manager.\n5-Administrative Researcher.\n6-Agricultural specialist (General).\n7-Air Controller.\n8-Air Hostess.\n9-Air Navigator.\n10-Air Transport Manager.\n11-Aircraft Landing Controller.\n12-Aircraft Maintenance Technician.\n13-Aircraft Takeoff Controller.\n14-Aquatic Specialist.\n15-Archeological Director.\n16-Archeological Prospector.\n17-Archeological Researcher.\n18-Architectural Draftsman.\n19-Army Officer.\n20-Artists which include actors, musicians, composers, poets, painters, and singers.\n21-Assistant Engineer (All specializations).\n22-Assistant General Manager.\n23-Assistant Pharmacist.\n24-Assistant Pilot.\n25-Astronomer.\n26-Auditor.\n27-Author.\n28-Aviation Guide.\n29-Aviation Technician.\n30-Aviation Trainer.\n31-Bank Manager.\n32-Bank Official.\n33-Banker.\n34-Banking Business Manager.\n35-Breeding Specialist (Animals/ Birds/ Bees).\n36-Broadcasting Manager.\n37-Business lady.\n38- Businessman.\n39-Captain of Ship/Cruise/Carrier/Steamship.\n40-Career Counselor.\n41-Chairman (All types).\n42-Chairman / Executive Director.\n43-Chemist (All Specializations).\n44-Chief Justice.\n45-Cinema Cameraman.\n46-Cinema Director.\n47-Cinema or Television Producer.\n48-College Dean.\n49-Commercial Broker.\n50-Commercial Manager.\n51-Company or Factory Manager.\n52-Computer Programmer / Computer Technician.\n53-Consultant (All types).\n54-Consultant (All types).\n55-Control Equipment Technician.\n56-Cooperative Society Manager.\n57-Correspondent (Newspaper/Radio/TV).\n58-Cruise Ship Guide.\n59-Customs Clearer.\n60-Customs Specialist.\n61-Decoration Designer.\n62-Dental Technician (Fixing).\n63-Diplomat (Members of diplomatic corps).\n64-Director.\n65-Earthquakes expert.\n66-ECG Technician\n67-Economic Analyst\n68-Electricity Manager\n69-Employees at the Embassies in the GCC countries (Except\n70-All types of engineers if they are registered with the Saudi Council of Engineers.\n71-Executive Manager or Director\n72-Executive Secretary\n73-Farm Manager\n74-Finance Manager\n75-Finance/Economics Expert\n76-Flight Technician\n77-Food Controller\n78-Foodstuff Technician\n79-Gardening Specialist\n80-General Professional Trainer\n81-General Specialist\n82-General Supervisor\n83-Geologist (General)\n84-Geology Technician\n85-Head of Prosecution\n86-Horse Breeding Technician\n87-Hospital Manager\n88-Hotel Manager\n89-Information Systems Expert\n90-Institute Manager\n91-Insurance Manager\n92-Investment Manager\n93- Investor\n94-Jeweler\n95-Journalist\n96-Judge\n97-Lab Specialist\n98-Lab Technician\n99-Laboratory Manager\n100-Land Hostess\n101-Land Transport Manager\n102-Lawyer / Advocate\n103-Lecturer\n104-Legal Expert\n105-Legal Researcher\n106-Library Manager\n107-Literator\n108-Maintenance Manager\n109-Male or Female Nurse\n110-Manager (All types)\n111-Manager or Director of any government organization or a private company.\n112-Marine Navigator\n113-Marine Traffic Controller\n114-Marine Transport Manager\n115-Maritime Controller\n116-Marketing Executive\n117-Marketing Manager\n118-Marketing Representative\n119-Media Controller\n120-Media Manager\n121-Media Person\n122-Media Specialist\n123-Medical Analysis Specialist\n124-Medical Equipment Technician\n125-Medical Therapy Specialist\n126-Medical X-ray Specialist\n127-Microscopic Technician\n128-Mining Technician\n129-Ministry Undersecretary\n130-Museum Manager\n131-Nutrition Specialist\n132-Operations Analyst\n133-Optical Technician\n134-Partner\n135-Pharmaceutical Technician\n136-Pharmacist\n137-Physician (All specializations)\n138-Physicist\n139-Pilot\n140-Player (All sports items in a sports club)\n141-President or Director of a Club\n142-President or Director of a University\n143-Press Photographer\n144-Printing and Publishing Manager\n145-Procurement Representative\n146-Production Director\n147-Professional Security and Safety Technician\n148-Professor\n149-Program Designer\n150-Program Producer.\n151-Proofreader\n152-Prosecutor\n153-Psychiatrist\n154-Quality Controller\n155-Quantity Enumerator\n156-Radio or TV Transmission Technician\n157-Referee (sports)\n158-Regional Director\n159-Religious person\n160-Research & Studies Director\n161-Road Controller\n162-Sales Executive\n163-Sales Manager\n164-Sales Representative\n165-School Manager\n166-Scientist\n167-Secretary or Manager of Library\n168-Ship Captain\n169-Ship Maintenance Technician\n170-Shop Supervisor\n171-Sociologist\n172-Special Needs Teacher\n173-Speech Specialist\n174-Sports Medicine Specialist\n175-Sports Representative\n176-Sports Trainer\n177-Statistics Specialist\n178-Support Services Jobs)\n179-Surgeon (All specializations)\n180-Systems Analyst\n181-Teacher / Instructor\n182-Telecom Technician\n183-Television Manager\n184-Theatre Manager\n185-Tourism Agency Manager\n186-Tourist Guide\n187-Trader\n188-Train Maintenance Technician\n189-Translator\n190-Travel or Tourism Agent\n191-TV Cameraman\n192-TV or Radio Programs Presenter\n193-University Professor\n194-University student\n195-Veterinary Doctor\n196-Weather expert\n197-Well Drilling Technician\n198-X-Ray Specialist\n199-X-ray Technician\n200-Zoology Specialist\nWe have not provided any list of Iqama professions who are NOT eligible to apply for a visit visa in Saudi Arabia. It means any profession which is not stated above is not eligible to apply for a family visa in Saudi Arabia.", "Approved by MOL/Pending with MOI\nIf the message appears while checking the iqama transfer status that it is approved by the HRSD Ministry but pending with the Ministry of Interior,\n- It could be because you haven’t paid the fee for the transfer of sponsorship .\n- Or your new employer will have to visit Jawazat to complete the process.\n\nCheck Iqama transfer status in Absher\nAfter the transfer is completed at the MOL level, you can check the status of the Iqama transfer on Absher.\n- Login to your Absher account https://www.absher.sa/\n- Click on the “ Dashboard “.\nMobile: A new screen will open where you need to click on the “ More Detail ” button.\nDesktop: Look at the left side of your screen where your full name, picture, birth date, and marital status are given. Click on the “ More Details ” link given under this.\nYou can find the name of your new Kafeel here, it means that the iqama transfer status is COMPLETE .\n\nCheck Iqama transfer status – MOL\nFirst of all, you need to check the Iqama transfer status through the labor office service inquiry on mol.gov.sa. Click on the link;\n- https://www.mol.gov.sa/Services/Inquiry/LaborOfficeServicesInquiry.aspx\nThere is no need to search for the English version as it has not been provided by the Ministry.\n- نوع الخدمة: Select the option نقل خدمة عامل وافد.\n- رقم إقامة العامل: Enter the Iqama number .\n- Enter the verification code shown on your computer screen.\n\nCheck Iqama transfer status – Qiwa\nYou can also check your Iqama transfer status through Qiwa;\n- Register yourself with the Qiwa platform.\n- Log in to your Qiwa Individual account https://auth.qiwa.sa/en/sign-in\n- Click on the “ Individual Account “.\n- You can find the name of your current employer here.\n\nCheck Kafeel Name through Mudad\nYou can check the Iqama transfer status through the Mudad platform as well. In order to do it;\n- Register with the Mudad platform .\n- Click here: https://mudad.com.sa/system-selection\n- Select Compliance System .\n- Sign in to your account.\n- Now you can check the name and the number of employees in your company.\n\nCheck Naqal Kafala Status through MOFA\nYou can also check the Iqama transfer status through the MOFA website. In order to do it;\n- Activate Nafath app.\n- Open this website https://visa.mofa.gov.sa/Account/\n- Click on the “ Login ” button.\n- Enter your Iqama Number .\n- Open the Nafath app and approve the Sign in.\nOn the next page, you will be given many options out of which you need to select;\n- Family Visit Visa Application for Residents .\nIf you find the name of the new employer on the next screen, it means that your Naqal Kafala has been completed.\n\nIntroduction\nAfter starting the employee transfer process through Qiwa, you can always check the Iqama transfer status or Naqal Kafala status online.\nKeep in mind that t he sponsorship is transferred in two phases;\n- HRSD Ministry/Labor Office.\n- Jawazat/MOI.\n- How to transfer employees through Qiwa in KSA?\n\nIqama Transfer Request understudy\nIf the message appears while checking the iqama transfer status “ تحت الدراسة “, it means that the request has been created by your new employer but it is not yet approved by the current employer.\n- The validity of the iqama transfer request: 90 days .\n\nIqama has transferred\nIf the message appears;\n“ حالة الطلب في وزارة الداخلية: تم نقل خدمة العامل الى صاحب عمل جديد بتاريخ 1441/03/08، وفي حال عدم استلام رخصة الاقامة بعد, على صاحب العمل الجديد استلامها من الجوازات “,\nit means that the request for the transfer of Iqama sponsorship has been accepted as you can check the name of your new Kafeel there.\nPay the fee to transfer Iqama sponsorship within 12 days of acceptance of the request to complete the process in Jawazat.\n\nNo Request for Iqama transfer\nIf the message appears\n“ لم يتم تقديم اي طلب نقل خدمة للعامل، علما بأن صاحب العمل الحالي هي مؤسسة/شركة “\nit means that there is no request for the transfer of sponsorship in the system of the Ministry of Labor.", "1- Transfer pending Employer’s Approval\nIn the following two cases, the current employer’s approval is required through Qiwa to transfer Iqama as explained in the process below.\n- When the employee has been in Saudi Arabia for less than one year.\n- Process: All steps 1-6 as explained below.\n\n2- Direct Transfer\nIn the following cases, you will be able to transfer your Iqama without the current employer’s approval and even without completing the notice period ;\n- If the employee’s work permit has expired.\n- If the employee’s Iqama has expired .\n- If an employer is unable to issue a work permit for an employee within 90 days of arrival in Saudi Arabia.\n- Process: All steps except Step 3 and Step 4.\n\n3- Transfer pending notice period\nAs per the new rules for the transfer of sponsorship in Saudi Arabia, if an employee has worked for more than one year in Saudi Arabia, he can also transfer his sponsorship without the approval of the current employer. However, he will have to complete a 90-day notice period.\nThe current employer can modify the notice period to an earlier date depending upon his agreement with the employee.\n- Process: All steps except Step 3.\n\nAcceptance\nThe employee Iqama will be transferred if;\n- The current employer a ccepts the request within 14 days or;\n- The system automatically accepts the request to transfer the employee without Kafeel’s approval .\n- Qiwa Status: Approved.\n\nAuto Cancellation\nIf the current employer does not accept the request within 14 days, the iqama transfer request is automatically canceled in Qiwa.\n- Qiwa Status: Auto Cancelled due to not approve or reject the request for more than 14 days.\n\nIntroduction\nAs per the new rules, the transfer of Iqama sponsorship in Saudi Arabia is completed on the Qiwa platform. Article 39 of Saudi Labor Law states that a Non-Saudi cannot work for anyone other than his Kafeel or sponsor.\n\nRejection\nIf the current employer rejects the Iqama transfer request on Qiwa, he must justify it online, as the employment contract is incomplete.\n- Qiwa Status: Rejected by Current Employer.\n\nStep 1: Upload Employment Contract in Qiwa\nThe new employer can upload the employment contract to create a request to transfer Iqama sponsorship through the Qiwa platform if the employee is;\n- working in Saudi Arabia.\n- not in a different transfer process.\n- does not hold a Final exit visa.\n- Qiwa Status: Pending for Laboror Approval.\n\nStep 2: Job Offer Acceptance in Qiwa\nAs per the new rules for transferring Iqama sponsorship in Saudi Arabia, the employee needs to accept a job offer or an employment contract on the Qiwa platform within 10 days of its creation to proceed with transferring Iqama sponsorship.\n- Register yourself with the Qiwa platform.\n- Log in to Qiwa Individual account: https://sso.qiwa.sa/sign-in\n- Click on the “ Individual Account “.\n- Click on the 3 bars for options.\n- Select the “ Services ” tab.\n- Click on the “ Employee Transfers “.\n- On the next page, click on the “ View Contract “.\n- Read the employment contract in detail before accepting it in Qiwa. After the acceptance, it would be your only legally binding contract in the eyes of the HR ministry and the Saudi government.\n- Agree to the terms and conditions.\n- Accept or Reject the contract.\n- If you face any problem in accepting the request, you can; send an email to support@qiwa.sa Call Qiwa Helpline: 920000105\n- send an email to support@qiwa.sa\n- Call Qiwa Helpline: 920000105\n\nStep 3: Acceptance by the current employer\nIn case the employee has not completed one year in Saudi Arabia, the request for transfer of Iqama sponsorship will be sent to the current employer for approval or rejection. The current employer has 5 options at this time;\n- Accept the request immediately.\n- Accept the request with a default notice period, i.e., 90 days.\n- Accept the request with a reduced notice period of less than 90 days.\n- Reject the request.\n- Leave the request as it is.\n- Qiwa Status: Pending for Current Employer’s Approval.\n\nStep 4: Pending for notice period completion\nIf the employee has completed one year in Saudi Arabia and his Iqama and work permits are valid , the notice period will start in Qiwa as soon as he accepts the contract. Qiwa will also start showing the remaining number of days for the notice period.\n- Qiwa Status: Pending for notice period completion.\nThe current employer has 3 options at this time;\n- Accept the request immediately.\n- Accept the request with a default notice period, i.e., 90 days.\n- Accept the request with a reduced notice period of less than 90 days.\n\nStep 5: Approved: P ending Employee Transfer Completion\nAt the end of the completion of the notice period (if any), the Iqama transfer service in Qiwa will start showing the following statuses. It means that all the required formalities have been fulfilled.\nYou need to complete some procedural steps to get the Iqama issued. Your employer might need to visit Jawazat to complete the process.\n- Approved: Pending Employee Transfer Completion.\n\nStep 6: Print the new Iqama\nAt this stage in time;\n- Pay the fee to transfer Iqama sponsorship within 12 days of acceptance of the request to complete the process in Jawazat.\n- Article 40 of Saudi Labor Law states that the employer is responsible for paying the fee.\n- Once the transfer is complete, you can check the name of your new Kafeel in Absher.\n- Once it is done, you can visit any Jawazat office to get the print of your new Iqama.\nHowever, if the new employer does not initiate the request within 12 days, the entire process will be canceled, and the system will show the message.\n- Qiwa Status: Expired because of not completing the request by the new employer.\n\nTypes of Iqama Transfer\nYou can transfer Iqama as many times as you want during your stay in Saudi Arabia. Your Iqama will be transferred in one of the following 3 ways on Qiwa;", "Change Iqama profession manually\nIn case you are not able to change your Iqama profession online, the GRO of your company will have to visit the labor office along with the following documents to do it.\n- A letter from the employer requesting to change the profession.\n- A form to change the profession.\n- Iqama copy\n- Commercial Registration Copy.\n- Qiwa portal Error that you are unable to change your profession online.\n- Sponsor ID .\nAfter submitting the documents, the GRO will receive an SMS to proceed with changing the Iqama profession in Muqeem. Now pay the fee and then your profession would be changed by the employer.\n\nHas the change in Iqama profession stopped in KSA?\nAccording to the latest news in 2023, the change of Iqama profession is open . However, there could be several reasons for the rejection of the request such as;\n- The change in the Iqama profession is banned by MOL for some time.\n- The membership with the SOCPA, SCE, or Mumaris plus has expired.\n- The expat who is required to be registered with two professional bodies has registered with only one e.g. a computer technician who wants to change his Iqama profession to an accountant needs to register with both SOCPA and SCE.\n- The Iqama profession is reserved for Saudis .\n- The company is in Red Nitaqat Category .\n- The Iqama has expired.\n- The profession is blocked (Qiwa Error)\nQiwa Error: The current occupation is not allowed in this cycle. No Jobs Eligible. This qiwa error appears when the profession you are working at has been blocked due to Saudization requirements.\n\nIntroduction\nIf your current profession on Iqama is different from your actual profession, you need to change it to comply with Article 38 of Saudi Labor Law.\n- How to check Iqama Profession online?\n\nIqama profession change without a Certificate\nSome professions can be changed without a certificate while others require an attested degree. Here are some scenarios;\n- No degree or certificate is required to change non-technical professions e.g. Labor to Cleaner.\n- A resident with the computer technician Iqama profession can register himself with SCE without any certificate and change the profession to a Labor within 12 months of registration.\n- A resident with the accountant Iqama profession can register himself with any degree with the SOCPA and then transfer the profession to labor.\nHowever, if your family is already in Saudi Arabia on a family visit visa or a permanent family visa , you would not be able to opt for a lower degree profession such as labor.\n\nIqama profession for domestic workers\nIf you have been awarded a domestic visa like a House driver, Housemaid, etc. it cannot be changed to a business profession. It can only be transferred to some other domestic professions.\n\nRequirements\n- The expat needs to be inside Saudi Arabia.\n- Attested degree matching with the Iqama profession.\n- Payment of SR 1,000 fee to change Iqama profession .\n- Passing the Saudi Professional Verification Exam .\n- Registration with the relevant professional body; All Engineers and 136 technician professions need to register with the Saudi Council of Engineers . All accountants and auditors need to register with SOCPA . All health practitioners need to register with Mumaris Plus . All veterinary professionals need to register with the Ministry of Agriculture.\n- All Engineers and 136 technician professions need to register with the Saudi Council of Engineers .\n- All accountants and auditors need to register with SOCPA .\n- All health practitioners need to register with Mumaris Plus .\n- All veterinary professionals need to register with the Ministry of Agriculture.\n- The status of the worker must not be “ Pending service transfer “.\n- The worker must be inside Saudi Arabia.\n- In order to change the profession from one professional body (SCE) to another (SOCPA), registration with both professional bodies is required.\nAny expat who entered Saudi Arabia with an engineering professional visa, but the Saudi Council of Engineers rejected his application, should apply for a profession change first. Temporary approval of 10 days will be granted by the SCE for the change of profession. Source: SCE\n\nStep 1: Employer requests the profession change\nOnce you have all the above-mentioned documents with you, contact the Government Relations Officer of your company. He will create a request to change the Iqama profession in the Qiwa platform.\n- Log in to Qiwa’s platform.\n- Choose “occupation change” service from the e-services.\n- Select the workers whose profession you want to change.\n- Select the occupation you want to change to.\n- Fill in the details of each worker’s employment contract.\n- Apply for the change of Iqama Profession.\n- Qiwa Status: Pending Employee Approval .\n\nStep 2: Employee Acceptance\nAfter the request is created, the employee will have to accept the request to change the Iqama profession through the Qiwa account.\n- Register yourself with the Qiwa platform.\n- Log in to your Qiwa Individual account: https://sso.qiwa.sa/sign-in\n- Click on the “ Individual Account “.\n- Click on the 3 bars for options.\n- Select the “ Services ” tab.\n- Click on the “ Change Occupation “.\n- Accept the request.\nAs per the HRSD Ministry, worker acceptance is not required for doctors, experts, specialists, engineers, specialized experts, monitoring technicians, or worker professions. – Saudi Gazette\n\nStep 3: Pending NIC Approval\nThe next step is for the HRSD Ministry to accept the request. After the request for the change of Iqama profession is approved by the MOL, the Qiwa will show the following message.\n- Qiwa Status: Pending for NIC Approval.\nNow, the sponsor has to pay the fee to change their Iqama profession , log into his Qiwa system, and complete the rest of the procedural requirements.\n\nStep 4: Print the Iqama\nOnce the change of Iqama profession is accepted by the MOL and MOI and is reflected in the Absher account, your employer will print a new Iqama copy for you. Your profession is written on line 8 of the Iqama card.\n- How to check the Iqama profession online?", "Introduction\nIt is very important to understand the meaning of Kafeel and sponsorship system in Saudi Arabia if you are planning to come to this country.\nYou need to be under the sponsorship of one Kafeel if you are living here. This Sponsor can be an individual, a partnership business or a company.\nThe meaning of Kafeel in Saudi Arabia can be understood by the statement that you need permission from your Sponsor to enter Saudi Arabia, leave the country for a temporary or permanent basis, buy a car on a lease, borrow loan from a bank, open bank account and the list is unlimited.\n- Entering to Saudi Arabia\nEntering to Saudi Arabia for job purpose is not legally possible without the involvement of a Kafeel. There are some other ways of entering Saudi Arabia which is not legal so we are not discussing them here. Normally companies hire you from your native countries and send a visa to an agent authorized by you.\nIf you look at your passport, your visa is valid for only 3 months. Don’t be afraid, this is actually the probation period you need to complete before getting your residence permit. You will have to go through a certain procedure that is covered in this article to apply for your first Iqama .\nIf your Sponsor does not make your Iqama within 3 months, you have the right to look for another job and transfer the sponsorship even without his consent.\n- Iqama (Residence Permit)\nThe resident permit in Saudi Arabia is called Iqama. Every expatriate must have an Iqama. After entering Saudi Arabia, you can live for only the first 3 months without Iqama. After that, you would be treated as illegal.\nThe legal requirement is that if your Kafeel is satisfied with you, he can issue you Iqama even for less than 3 months i.e probation period. In order to process an Iqama, you need to surrender your passport to your Sponsor. It is not advisable to travel to some other city if you don’t have your Iqama or Passport with a valid visa.\n- Exit Re-Entry Visa\nLabor Law in Saudi Arabia provides a minimum of 21 leave days to each employee per annum. If you have completed five years with one Sponsor, you are entitled to 30 leave days per annum. ( Entitled Leaves for Employees as per Saudi Labor Law )\nMoreover, your employer is responsible for ticketing expenses in your home country. Only your Sponsor can issue your Exit Re-Entry visa cost of which is SR 200 for the first 2 months and SR 100 for an additional month. However, you can issue an exit re-entry visa for your family.\n- The sponsor of your Family\nYour employer is your Sponsor and you can be the Sponsor of your family. Your family consists of your parents, wife and your children. They need your permission for all the things for which you need approval from your Sponsor.\n- Sponsor and Employer\nIt is illegal to work for someone who is not your Sponsor. So, in order to be legal in Saudi Arabia, your sponsor and your employer should be the same persons.\nHowever, it is possible that with the permission of your Sponsor you start working for some other Sponsor and the second Sponsor takes your Kafala under his name. It is called “ transfer of sponsorship “.\nIn this way, your new employer will become your Sponsor.  But during the period, your sponsorship is under processing of the transfer, you can work for the new employer. If you are working for someone who is not your Sponsor and you are caught by the passport office (Jawazat), penalties can be severe to you including a fine up to SAR 100,000/-, jail of 2 years followed by deportation.\n- Marriage in Saudi Arabia\nThere is no need to seek permission for marriage from Sponsor in Saudi Arabia. We have already published a detailed article in this regard. Recommended: Getting married in Saudi Arabia\n- In Case of Death\nEven in the case of the death of someone, there are lots of documents required from Sponsor to register the person as dead in the records. This is the reason; it takes around 3 days on average to bury a dead body of expatriate if the family is willing to bury him in Saudi Arabia.\nIf they want to take the body back to the native country, the procedure may prolong to even 15 days. For detailed guidelines in this regard, please have a look at this article.\n- Legality of Sponsor holding the Passport\nIt has become a general practice in Saudi Arabia that Sponsor holds the passports of all the employees who are under his sponsorship in his custody.\nHe hands it over to them only when they are leaving Saudi Arabia with his permission. However, this practice is illegal. Have a look at this article for the reference of the law.\n- What to do if your Kafeel dies in Saudi Arabia?\nThere is no problem for the people who are working in big companies as their sponsor is the company itself and if the company is running, they don’t need to fear anything.\nHowever, the problem is for domestic workers like housemaids, domestic drivers, and private watchmen. They will have to transfer the sponsorship to the name of his brother/son or any other close relative."]